Repository: ACMAD-Niamey/climweb
Catalog: pages/organisation_pages/about/locale/*/LC_MESSAGES/django.po
Languages: am, ar, es, fr

source: This can be the month of the year or the exact date. Leave blank if not known
am: ይህ የዓመቱ ወር ወይም ትክክለኛው ቀን ሊሆን ይችላል. ካልታወቀ ባዶ ይተውት።
ar: يمكن أن يكون هذا الشهر من السنة أو التاريخ المحدد. اتركه فارغا إذا لم يكن معروفا
es: Puede ser el mes del año o la fecha exacta. Dejar en blanco si no se sabe
fr: Cela peut être le mois de l'année ou la date exacte. Laisser vide si non connu

source: Describe the milestone
am: የድል ጉዞውን ግለጽ
ar: صف المعلم
es: Describa el hito
fr: Décrivez le jalon

source: Organisation's mission
am: የድርጅት ተልእኮ
ar: مهمة المنظمة
es: misión de la organización
fr: Mission de l'organisme

source: Organisation's vision
am: የድርጅት እይታ
ar: رؤية المنظمة
es: visión de la organización
fr: Vision de l'organisation

source: Timeline Heading
am: የጊዜ መስመር ርዕስ
ar: عنوان المخطط الزمني
es: Encabezado de la línea de tiempo
fr: Titre de la chronologie

source: Timeline items
am: የጊዜ መስመር እቃዎች
ar: عناصر المخطط الزمني
es: Elementos de la línea de tiempo
fr: Éléments de la chronologie

source: Organisation's Structure Section Heading
am: የድርጅቱ መዋቅር ክፍል ርዕስ
ar: عنوان قسم هيكل المنظمة
es: Título de la sección Estructura de la organización
fr: Titre de la section Structure de l'organisation

source: Organisation's Struture Heading
am: የድርጅት መዋቅር ርዕስ
ar: عنوان دعامة المنظمة
es: Rúbrica de la estructura de la organización
fr: Intitulé de la structure de l'organisation

source: Organisation's Structure Description
am: የድርጅቱ መዋቅር መግለጫ
ar: وصف هيكل المنظمة
es: Descripción de la estructura de la organización
fr: Description de la structure de l'organisation

source: Organisation's Struture Description
am: የድርጅት አወቃቀር መግለጫ
ar: وصف دعامة المنظمة
es: Descripción de la estructura de la organización
fr: Description de la structure de l'organisation

source: Organisational Structure Image
am: ድርጅታዊ መዋቅር ምስል
ar: صورة الهيكل التنظيمي
es: Imagen de estructura organizacional
fr: Image de la structure organisationnelle

source: A high quality image related to your organisation's structure
am: ከድርጅትዎ መዋቅር ጋር የተያያዘ ከፍተኛ ጥራት ያለው ምስል
ar: صورة عالية الجودة تتعلق بهيكل مؤسستك
es: Una imagen de alta calidad relacionada con la estructura de su organización
fr: Une image de haute qualité liée à la structure de votre organisation

source: Feature Block
am: የባህሪ እገዳ
ar: كتلة الميزات
es: Bloque de funciones
fr: Bloc de fonctionnalités

source: Additional Materials
am: ተጨማሪ ቁሳቁሶች
ar: مواد إضافية
es: Materiales adicionales
fr: Matériaux additionnels

source: Bottom Call to action heading
am: የታችኛው ጥሪ ወደ ተግባር ርዕስ
ar: أسفل عنوان عبارة الحث على اتخاذ إجراء
es: Encabezado de llamada a la acción inferior
fr: En-tête d'incitation à l'action en bas

source: Bottom call to action description
am: የታችኛው ጥሪ ወደ ተግባር መግለጫ
ar: وصف عبارة الحث على اتخاذ إجراء السفلي
es: Descripción de la llamada a la acción inferior
fr: Description de l'incitation à l'action en bas

source: Bottom call to action button text
am: የታችኛው ጥሪ ወደ ተግባር አዝራር ጽሑፍ
ar: نص زر الحث على اتخاذ إجراء السفلي
es: Texto del botón de llamada a la acción inferior
fr: Texte du bouton d'appel à l'action en bas

source: Bottom call to action button link
am: የታችኛው ጥሪ ወደ ተግባር አዝራር አገናኝ
ar: أسفل ارتباط زر الدعوة إلى العمل
es: Enlace del botón de llamada a la acción inferior
fr: Lien inférieur du bouton d'appel à l'action

source: Mission & Vision Section
am: ተልዕኮ እና ራዕይ ክፍል
ar: قسم الرؤية والرسالة
es: Sección de Misión y Visión
fr: Section mission et vision

source: Organisation Structure Section
am: የድርጅት መዋቅር ክፍል
ar: قسم الهيكل التنظيمي
es: Sección de Estructura de la Organización
fr: Section de la structure organisationnelle

source: Bottom Call to action Section
am: የታችኛው ጥሪ ወደ ተግባር ክፍል
ar: قسم الدعوة إلى العمل السفلي
es: Sección de llamada a la acción inferior
fr: Section inférieure d'appel à l'action

source: About Page
am: ስለ ገጽ
ar: حول الصفحة
es: Acerca de la página
fr: À propos de la page
