Repository: ACMAD-Niamey/climweb
Catalog: pages/services/locale/*/LC_MESSAGES/django.po
Languages: am, ar, sw

source: Services listing Heading
am: የአገልግሎቶች ዝርዝር ርዕስ
ar: عنوان قائمة الخدمات
sw: Kichwa cha orodha ya huduma

source: Service
am: አገልግሎት
ar: خدمة

source: What we do button text
am: የምንሰራው የአዝራር ጽሑፍ
ar: نص زر ما نفعله
sw: Tunachofanya maandishi ya kifungo

source: What we do button link
am: የምንሰራው የአዝራር አገናኝ
ar: ما نفعله زر الارتباط
sw: Tunachofanya kiungo cha kifungo

source: Projects description text
am: የፕሮጀክቶች መግለጫ ጽሑፍ
ar: نص وصف المشاريع
sw: Maandishi ya maelezo ya miradi

source: Project Description
am: የፕሮጀክት መግለጫ
ar: وصف المشروع
sw: Maelezo ya Mradi

source: Feature block items
am: የባህሪ እገዳ ንጥሎች
ar: عناصر حظر الميزات
sw: Vipengee vya kuzuia kipengele

source: Youtube playlist
am: የዩቲዩብ አጫዋች ዝርዝር
ar: قائمة تشغيل يوتيوب
sw: Orodha ya kucheza ya Youtube

source: What we do in this Service section
am: በዚህ የአገልግሎት ክፍል ውስጥ ምን እናደርጋለን
ar: ماذا نفعل في قسم الخدمة هذا
sw: Tunachofanya katika sehemu hii ya Huduma

source: Projects Section
am: የፕሮጀክቶች ክፍል
ar: قسم المشاريع
sw: Sehemu ya Miradi

source: Applications
am: መተግበሪያዎች
ar: التطبيقات
sw: Maombi

source: Heading
am: ርዕስ
ar: عنوان
sw: Kichwa

source: Service Page
am: የአገልግሎት ገጽ
ar: صفحة الخدمة
sw: Ukurasa wa Huduma

source: Service Pages
am: የአገልግሎት ገጾች
ar: صفحات الخدمة
sw: Kurasa za Huduma

source: Application
am: መተግበሪያ
ar: طلب
sw: Maombi
