Repository: ACMAD-Niamey/climweb
Catalog: docs/locales/*/LC_MESSAGES/_docs.po
Languages: am, ar

source: Managing Measurement Units
am: የመለኪያ ክፍሎችን ማስተዳደር
ar: إدارة وحدات القياس

source: Organisation settings include the logo, country, address, contact information and social media address (Twitter, Facebook, Youtube and Instagram)
am: የድርጅት ቅንጅቶች አርማ፣ ሀገር፣ አድራሻ፣ የእውቂያ መረጃ እና የማህበራዊ ሚዲያ አድራሻ (Twitter፣ Facebook፣ Youtube እና Instagram) ያካትታሉ።
ar: تتضمن إعدادات المؤسسة الشعار والبلد والعنوان ومعلومات الاتصال وعنوان الوسائط الاجتماعية (Twitter و Facebook و Youtube و Instagram)

source: ![Organisation settings](../../_static/images/settings/settings_explorer.png "Organisation settings")
am: ![ድርጅት መቼቶች](../../_static/images/settings/settings_explorer.png "የድርጅት መቼቶች")
ar: ! [إعدادات المؤسسة] (../../_ static / images / settings / settings_explorer.png "إعدادات المؤسسة")

source: Organisation settings
am: የድርጅት ቅንብሮች
ar: إعدادات المنظمة

source: The CMS allows you to create/edit/delete a theme. You can also set a default theme which will be applied to all pages of the website.
am: ሲኤምኤስ አንድ ገጽታ እንዲፈጥሩ/እንዲያስተካክሉ/እንዲሰርዙ ይፈቅድልዎታል። እንዲሁም በሁሉም የድረ-ገጹ ገጾች ላይ የሚተገበር ነባሪ ገጽታ ማዘጋጀት ይችላሉ።
ar: يتيح لك نظام إدارة المحتوى إنشاء سمة / تحريرها / حذفها. يمكنك أيضًا تعيين سمة افتراضية سيتم تطبيقها على جميع صفحات موقع الويب.

source: ![Themes](../../_static/images/settings/themes.png "Themes")
am: ![ገጽታዎች](.../../_static/images/settings/themes.png "ገጽታዎች")
ar: ! [السمات] (../../_ static / images / settings / themes.png "Themes")

source: Themes
am: ገጽታዎች
ar: ثيمات

source: The theme configurations include theme name, theme colors, borders and shadows.
am: የገጽታ ውቅረቶች የገጽታ ስም፣ የገጽታ ቀለሞች፣ ድንበሮች እና ጥላዎች ያካትታሉ።
ar: تتضمن تكوينات السمة اسم السمة وألوان السمة والحدود والظلال.

source: ![Theme Detail](../../_static/images/settings/theme_detail.png "Theme Detail")
am: ![ገጽታ ዝርዝር](../../_static/images/settings/theme_detail.png "ገጽታ ዝርዝር")
ar: ! [تفاصيل الموضوع] (../../_ static / images / settings / theme_detail.png "تفاصيل الموضوع")

source: Theme Detail
am: የገጽታ ዝርዝር
ar: تفاصيل الموضوع

source: The CMS supports integrations with 3rd party softwares including Recaptcha, YouTube API, Mailchimp, Mautic, Zoom and Google analytics.
am: ሲኤምኤስ Recaptcha፣ YouTube API፣ Mailchimp፣ Mautic፣ Zoom እና Google Analyticsን ጨምሮ ከ3ኛ ወገን ሶፍትዌሮች ጋር ውህደቶችን ይደግፋል።
ar: يدعم نظام إدارة المحتوى التكامل مع برامج الجهات الخارجية بما في ذلك Recaptcha و YouTube API و Mailchimp و Mautic و Zoom و Google analytics.

source: ![Integrations](../../_static/images/settings/integrations.png "Integrations")
am: ![ውህደቶች](../../_static/images/settings/integrations.png "ውህደቶች")
ar: ! [عمليات التكامل] (../../_ static / images / settings / exchanations.png "عمليات التكامل")

source: Integrations
am: ውህደቶች
ar: تكاملات

source: Multiple languages can be configured inorder to allow translation of the website by users to their prefered language. A language prefix and name is required and default state to specify the primary language the website is published in.
am: በተጠቃሚዎች ወደ መረጡት ቋንቋ እንዲተረጎም ለማድረግ ብዙ ቋንቋዎች ሊዋቀሩ ይችላሉ። የቋንቋ ቅድመ ቅጥያ እና ስም ያስፈልጋል እና ድረ-ገጹ የታተመበትን ዋና ቋንቋ ለመወሰን ነባሪ ሁኔታ ያስፈልጋል።
ar: يمكن تكوين لغات متعددة للسماح للمستخدمين بترجمة الموقع إلى لغتهم المفضلة. مطلوب بادئة اللغة والاسم والحالة الافتراضية لتحديد اللغة الأساسية التي يتم نشر موقع الويب بها.

source: ![Languages](../../_static/images/settings/manage_languages_explorer.png "Languages")
am: ![ቋንቋ](../../_static/images/settings/አስተዳድር_ቋንቋዎች_ኤክስፕሎረር.png "ቋንቋዎች")
ar: ! [اللغات] (../../_ static / images / settings / management_languages_explorer.png "اللغات")

source: Languages
am: ቋንቋዎች
ar: اللغات

source: ![Languages](../../_static/images/settings/manage_languages.png "Languages")
am: ![ቋንቋ](../../_static/images/settings/manage_languages.png "ቋንቋዎች")
ar: ! [اللغات] (../../_ static / images / settings / management_languages.png "اللغات")

source: Users & Roles
am: ተጠቃሚዎች እና ሚናዎች
ar: المستخدمون والأدوار

source: Manage Users
am: ተጠቃሚዎችን አስተዳድር
ar: ادارة المستخدمين

source: The CMS allows several users to manage content in the admin interface. These users have roles, which determine the access rights they can exercise.
am: ሲኤምኤስ ብዙ ተጠቃሚዎች በአስተዳዳሪ በይነገጽ ውስጥ ያለውን ይዘት እንዲያስተዳድሩ ያስችላቸዋል። እነዚህ ተጠቃሚዎች ሊጠቀሙባቸው የሚችሉትን የመዳረሻ መብቶች የሚወስኑ ሚናዎች አሏቸው።
ar: يسمح نظام إدارة المحتوى للعديد من المستخدمين بإدارة المحتوى في واجهة الإدارة. هؤلاء المستخدمون لديهم أدوار تحدد حقوق الوصول التي يمكنهم ممارستها.

source: By default, there are 5 roles:
am: በነባሪነት 5 ሚናዎች አሉ፡-
ar: بشكل افتراضي ، هناك 5 أدوار:

source: **Administrator** - This role has complete control over the CMS and can perform tasks such as managing user accounts, creating and deleting pages, and modifying site settings.
am: **አስተዳዳሪ** - ይህ ሚና በሲኤምኤስ ላይ ሙሉ ቁጥጥር ያለው ሲሆን የተጠቃሚ መለያዎችን ማስተዳደር፣ ገጾችን መፍጠር እና መሰረዝ እና የጣቢያ ቅንብሮችን ማሻሻል ያሉ ተግባራትን ማከናወን ይችላል።
ar: ** المسؤول ** - يتمتع هذا الدور بالتحكم الكامل في نظام إدارة المحتوى ويمكنه أداء مهام مثل إدارة حسابات المستخدمين وإنشاء الصفحات وحذفها وتعديل إعدادات الموقع.

source: **Moderator** - A moderator has the next level of access after an administrator. A moderator has access to creating drafts and publishing them.
am: ** አወያይ *** - አወያይ ከአስተዳዳሪው በኋላ ቀጣዩ የመዳረሻ ደረጃ አለው። አወያይ ረቂቆችን የመፍጠር እና የማተም እድል አለው።
ar: ** الوسيط ** - يتمتع الوسيط بالمستوى التالي من الوصول بعد المسؤول. المشرف لديه حق الوصول إلى إنشاء المسودات ونشرها.

source: **Editor** - This role has the ability to create and edit content on the website. They can add and remove pages, modify existing content, and publish new content.
am: ** አርታኢ *** - ይህ ሚና በድር ጣቢያው ላይ ይዘትን የመፍጠር እና የማርትዕ ችሎታ አለው። ገጾችን ማከል እና ማስወገድ፣ ያለውን ይዘት ማሻሻል እና አዲስ ይዘት ማተም ይችላሉ።
ar: ** محرر ** - هذا الدور لديه القدرة على إنشاء وتحرير المحتوى على موقع الويب. يمكنهم إضافة وإزالة الصفحات وتعديل المحتوى الحالي ونشر محتوى جديد.

source: **Forecaster** - This role provides accurate and timely weather forecasts for the region or area that the website serves.
am: ** ትንበያ** - ይህ ሚና ድህረ ገጹ የሚያገለግለው ክልል ወይም አካባቢ ትክክለኛ እና ወቅታዊ የአየር ሁኔታ ትንበያዎችን ይሰጣል።
ar: ** Forecaster ** - يوفر هذا الدور تنبؤات جوية دقيقة وفي الوقت المناسب للمنطقة أو المنطقة التي يخدمها موقع الويب.

source: **CAP Composer** - role are authorized to view and create draft CAP alerts, but not to approve nor to publish final CAP alerts;
am: ** CAP አቀናባሪ *** - ሚናዎች ረቂቅ CAP ማንቂያዎችን ለማየት እና ለመፍጠር ስልጣን ተሰጥቷቸዋል፣ ነገር ግን የመጨረሻ የ CAP ማንቂያዎችን ለማጽደቅ ወይም ለማተም አይፈቀድላቸውም።
ar: ** CAP Composer ** - الدور مخول لعرض وإنشاء مسودة تنبيهات CAP ، ولكن ليس للموافقة على تنبيهات CAP النهائية أو نشرها ؛

source: **CAP Approver** - role are authorized to view and create draft CAP alerts, and approve and publish CAP final alerts
am: **የካፕ አጽዳቂ** - ሚናዎች ረቂቅ CAP ማንቂያዎችን ለማየት እና ለመፍጠር፣ እና የCAP የመጨረሻ ማንቂያዎችን የማጽደቅ እና የማተም ስልጣን ተሰጥቷቸዋል።
ar: ** CAP Approver ** - الدور مخول لعرض وإنشاء مسودة تنبيهات CAP والموافقة على تنبيهات CAP النهائية ونشرها

source: Administrator
am: አስተዳዳሪ
ar: مدير

source: An administrator has the highest level of access to the admin interface, and are able to perform all actions in the Admin interface. A common task of an administrator is to add, modify, or remove user profiles. As an administrator, you can add, modify, and remove users via the Users interface. To access the Users interface, go to Settings > Users from the Wagtail Sidebar.
am: አስተዳዳሪ የአስተዳዳሪ በይነገጽ ከፍተኛው የመዳረሻ ደረጃ አለው፣ እና በአስተዳዳሪ በይነገጽ ውስጥ ያሉትን ሁሉንም ድርጊቶች ማከናወን ይችላል። የአስተዳዳሪው የተለመደ ተግባር የተጠቃሚ መገለጫዎችን ማከል፣ ማሻሻል ወይም ማስወገድ ነው። እንደ አስተዳዳሪ በተጠቃሚዎች በይነገጽ ተጠቃሚዎችን ማከል፣ ማሻሻል እና ማስወገድ ይችላሉ። የተጠቃሚዎች በይነገጹን ለመድረስ ከWagtail Sidebar ወደ Settings> Users ይሂዱ።
ar: يتمتع المسؤول بأعلى مستوى من الوصول إلى واجهة المسؤول ، ويمكنه تنفيذ جميع الإجراءات في واجهة المسؤول. تتمثل المهمة الشائعة للمسؤول في إضافة ملفات تعريف المستخدمين أو تعديلها أو إزالتها. بصفتك مشرفًا ، يمكنك إضافة المستخدمين وتعديلهم وإزالتهم من خلال واجهة المستخدمين. للوصول إلى واجهة المستخدمين ، انتقل إلى الإعدادات> المستخدمون من شريط الذعرة الجانبي.

source: In the Users interface, you can see all of your users, their usernames, roles, and status. The status of a user can either be active or inactive. You can sort this listing either by Name or Username.
am: በተጠቃሚዎች በይነገጽ ውስጥ ሁሉንም ተጠቃሚዎችዎን ፣ የተጠቃሚ ስሞቻቸውን ፣ ሚናዎቻቸውን እና ሁኔታቸውን ማየት ይችላሉ። የተጠቃሚው ሁኔታ ንቁ ወይም የቦዘነ ሊሆን ይችላል። ይህንን ዝርዝር በስም ወይም በተጠቃሚ ስም መደርደር ይችላሉ።
ar: في واجهة المستخدمين ، يمكنك رؤية جميع المستخدمين وأسماء المستخدمين والأدوار والحالة الخاصة بهم. يمكن أن تكون حالة المستخدم إما نشطة أو غير نشطة. يمكنك فرز هذه القائمة إما بالاسم أو اسم المستخدم.

source: ![Manage Users](../../_static/images/users_and_roles/manage_users.png "Manage Users")
am: ![ተጠቃሚዎችን አስተዳድር](../../_static/images/users_and_roles/users_manage_users.png "ተጠቃሚዎችን አስተዳድር")
ar: ! [إدارة المستخدمين] (../../_ static / images / users_and_roles / management_users.png "إدارة المستخدمين")

source: You can add a new user, using the 'add a user' button at the top right and assign them an email, username, first name, last name, password and role. Once the CMS user logs in to their account they will be able to edit this information to their preference.
am: ከላይ በቀኝ በኩል ያለውን 'አክል ተጠቃሚ' የሚለውን ቁልፍ በመጠቀም አዲስ ተጠቃሚ ማከል እና ኢሜል ፣ የተጠቃሚ ስም ፣ የመጀመሪያ ስም ፣ የአያት ስም ፣ የይለፍ ቃል እና ሚና ይመድቡላቸው ። አንዴ የCMS ተጠቃሚው ወደ መለያቸው ከገባ በኋላ ይህንን መረጃ ወደ ምርጫቸው ማርትዕ ይችላሉ።
ar: يمكنك إضافة مستخدم جديد باستخدام زر "إضافة مستخدم" في أعلى اليمين وتخصيص بريد إلكتروني واسم مستخدم واسم أول واسم عائلة وكلمة مرور ودور. بمجرد أن يقوم مستخدم CMS بتسجيل الدخول إلى حسابه ، سيتمكن من تعديل هذه المعلومات حسب تفضيلاته.

source: ![Add Users](../../_static/images/users_and_roles/add_user.png "Add Users")
am: ![ተጠቃሚዎችን አክል](../../_static/images/users_and_roles/add_user.png "ተጠቃሚዎችን አክል")
ar: ! [إضافة مستخدمين] (../../_ static / images / users_and_roles / add_user.png "إضافة مستخدمين")

source: Add Users
am: ተጠቃሚዎችን ያክሉ
ar: أضف مستخدمين

source: Select multiple users by checking the checkbox to the left of each user row, then use the bulk action bar at the bottom to perform an action on all selected users.
am: ከእያንዳንዱ ተጠቃሚ ረድፍ በስተግራ ያለውን አመልካች ሳጥኑ ላይ ምልክት በማድረግ ብዙ ተጠቃሚዎችን ይምረጡ እና በሁሉም በተመረጡ ተጠቃሚዎች ላይ አንድ እርምጃ ለመስራት ከታች ያለውን የጅምላ እርምጃ አሞሌን ይጠቀሙ።
ar: حدد عدة مستخدمين عن طريق تحديد خانة الاختيار الموجودة على يسار كل صف مستخدم ، ثم استخدم شريط الإجراءات المجمعة في الجزء السفلي لتنفيذ إجراء على جميع المستخدمين المحددين.

source: ![Select Users](../../_static/images/users_and_roles/select_users.png "Select Users")
am: ![ተጠቃሚዎችን ምረጥ](../../_static/images/users_and_roles/users_select_users.png "ተጠቃሚዎችን ምረጥ")
ar: ! [حدد المستخدمين] (../../_ static / images / users_and_roles / select_users.png "تحديد المستخدمين")

source: Select Users
am: ተጠቃሚዎችን ይምረጡ
ar: حدد المستخدمون

source: Clicking on a user’s name opens their profile in an edit screen. From here, you can then edit that user's details. It is also possible to change users’ passwords from their edit screen, but it is worth encouraging your users to use the Forgotten password link on the login screen instead. This should save you some time!
am: የተጠቃሚውን ስም ጠቅ ማድረግ በአርትዖት ስክሪን ውስጥ መገለጫቸውን ይከፍታል። ከዚህ ሆነው የተጠቃሚውን ዝርዝሮች ማርትዕ ይችላሉ። እንዲሁም የተጠቃሚ የይለፍ ቃሎችን ከአርትዖት ስክሪናቸው መቀየር ይቻላል፣ ነገር ግን በምትኩ የመግቢያ ስክሪን ላይ ተጠቃሚዎችዎ የተረሳ የይለፍ ቃል ማገናኛን እንዲጠቀሙ ማበረታታት ተገቢ ነው። ይህ የተወሰነ ጊዜ መቆጠብ አለበት!
ar: يؤدي النقر فوق اسم المستخدم إلى فتح ملفه الشخصي في شاشة تعديل. من هنا ، يمكنك تعديل تفاصيل هذا المستخدم. من الممكن أيضًا تغيير كلمات مرور المستخدمين من شاشة التعديل الخاصة بهم ، ولكن الأمر يستحق تشجيع المستخدمين على استخدام رابط "نسيت كلمة المرور" على شاشة تسجيل الدخول بدلاً من ذلك. هذا سيوفر لك بعض الوقت!

source: Managing Roles
am: ሚናዎችን ማስተዳደር
ar: إدارة الأدوار

source: To manage (add, edit, delete) roles, select from settings, groups as below. Each group corresponds to a role with permissions.
am: ሚናዎችን ለማስተዳደር (ለማከል ፣ ለማርትዕ ፣ ለመሰረዝ) ከቅንብሮች ፣ ከታች እንደ ቡድኖች ይምረጡ ። እያንዳንዱ ቡድን ፈቃዶች ካለው ሚና ጋር ይዛመዳል።
ar: لإدارة (إضافة ، تعديل ، حذف) الأدوار ، اختر من الإعدادات ، المجموعات على النحو التالي. تتوافق كل مجموعة مع دور له أذونات.

source: ![Manage Roles](../../_static/images/users_and_roles/manage_roles.png "Manage Roles")
am: ![ ሚናዎችን ያስተዳድሩ ](../../_static/images/users_and_roles/manaage_roles.png "ሚናዎችን አስተዳድር")
ar: ! [إدارة الأدوار] (../../_ static / images / users_and_roles / management_roles.png "إدارة الأدوار")

source: Manage Roles
am: ሚናዎችን ያስተዳድሩ
ar: إدارة الأدوار

source: ![List Roles](../../_static/images/users_and_roles/list_roles.png "List Roles")
am: ![ሚናዎች ዝርዝር](.../../_static/images/users_and_roles/list_roles.png "የዝርዝር ሚናዎች")
ar: ! [أدوار القائمة] (../../_ static / images / users_and_roles / list_roles.png "قائمة الأدوار")

source: List Roles
am: ሚናዎች ዝርዝር
ar: قائمة الأدوار

source: To edit a role and assign different permissions, click on the group. This will navigate to a seperate page where you can manage the permissions of the role.
am: ሚናን ለማርትዕ እና የተለያዩ ፈቃዶችን ለመመደብ ቡድኑን ጠቅ ያድርጉ። ይህ የሚናውን ፈቃዶች ማስተዳደር ወደሚችሉበት የተለየ ገጽ ያመራሉ።
ar: لتعديل دور وتعيين أذونات مختلفة ، انقر فوق المجموعة. سينتقل هذا إلى صفحة منفصلة حيث يمكنك إدارة أذونات الدور.

source: ![Edit Roles](../../_static/images/users_and_roles/edit_role.png "Edit Roles")
am: ![ ሚናዎችን አርትዕ ](../../_static/images/users_and_roles/edit_role.png "Roles አርትዕ")
ar: ! [تحرير الأدوار] (../../_ static / images / users_and_roles / edit_role.png "تحرير الأدوار")

source: Edit Roles
am: ሚናዎችን ያርትዑ
ar: تحرير الأدوار

source: Configure Settings
am: ቅንብሮችን ያዋቅሩ
ar: تكوين الإعدادات

source: Youtube
ar: موقع YouTube

source: ![CAP Explorer](../_static/images/cap/cap_explorer.png "CAP Explorer")
ar: ! [مستكشف CAP] (../_ static / images / cap / cap_explorer.png "CAP Explorer")

source: CAP Explorer
ar: مستكشف CAP

source: ![CAP Settings](../_static/images/cap/cap_settings.png "CAP Settings")
ar: ! [إعدادات CAP] (../_ static / images / cap / cap_settings.png "إعدادات CAP")

source: ![CAP Settings](../_static/images/cap/alert_hazard_types.png "CAP Settings")
ar: ! [إعدادات CAP] (../_ static / images / cap / alert_hazard_types.png "إعدادات CAP")

source: ![CAP Settings](../_static/images/cap/alert_hazard_input.png "CAP Settings")
ar: ! [إعدادات CAP] (../_ static / images / cap / alert_hazard_input.png "إعدادات CAP")

source: ![Daily Weather Explorer](../_static/images/city_forecasts/daily_weather_explorer.png "Daily Weather Explorer")
ar: ! [مستكشف الطقس اليومي] (../_ static / images / city_forecasts / daily_weather_explorer.png "Daily Weather Explorer")

source: ![Checkbox](../../_static/images/surveys/question-types-checkbox.png "Checkbox")
ar: ! [مربع اختيار] (../../_ ثابت / صور / استطلاعات / سؤال أنواع-checkbox.png "مربع اختيار")

source: **HTML**
ar: **لغة البرمجة**

source: ![Flex Page Sections](../../_static/images/flex_page/flex_page_sections.png "Flex Page Sections")
ar: ! [أقسام الصفحات المرنة] (../../_ static / images / flex_page / flex_page_sections.png "أقسام الصفحة المرنة")

source: ![Flex Page Sections](../../_static/images/flex_page/content_panel_sections.png "Flex Page Sections")
ar: ! [أقسام الصفحة المرنة] (../../_ static / images / flex_page / content_panel_sections.png "أقسام الصفحة المرنة")

source: ![Flex Page Sections](../../_static/images/flex_page/title_text.png "Flex Page Sections")
ar: ! [أقسام الصفحة المرنة] (../../_ static / images / flex_page / title_text.png "أقسام الصفحة المرنة")

source: ![Flex Page Sections](../../_static/images/flex_page/title_text_image.png "Flex Page Sections")
ar: ! [أقسام الصفحة المرنة] (../../_ static / images / flex_page / title_text_image.png "أقسام الصفحة المرنة")

source: ![News Explorer](../../_static/images/news/news_explorer.png "News Explorer")
ar: ! [مستكشف الأخبار] (../../_ static / images / news / news_explorer.png "مستكشف الأخبار")

source: ![Services Explorer](../../_static/images/products/services_explorer.png "Services Explorer")
ar: ! [مستكشف الخدمات] (../../_ static / images / products / services_explorer.png "مستكشف الخدمات")

source: Worklow Explorer
ar: مستكشف سير العمل
