Repository: ACMAD-Niamey/climweb
Catalog: docs/locales/*/LC_MESSAGES/_docs.po
Languages: am, ar

source: ![Single Input](../../_static/images/surveys/question-types-single-input.png "Single Input")
am: ![ነጠላ ግቤት](../../_static/images/surveys/question-types-single-input.png "ነጠላ ግቤት")
ar: ! [إدخال فردي] (../../_ ثابت / صور / استطلاعات / سؤال-أنواع-مفرد-إدخال. png "إدخال فردي")

source: Single Input
am: ነጠላ ግቤት
ar: المدخلات الفردية

source: **Checkbox**
am: ** አመልካች ሳጥን**
ar: ** خانة اختيار **

source: For questions that allow for multiple answers, utilize the Checkbox type where respondents can choose one or more options by clicking on the corresponding checkboxes.
am: ለብዙ መልሶች ለሚፈቅዱ ጥያቄዎች፣ ተጓዳኙን አመልካች ሳጥኖቹ ላይ ጠቅ በማድረግ ምላሽ ሰጪዎች አንድ ወይም ብዙ አማራጮችን የሚመርጡበትን የቼክ ሳጥን አይነት ይጠቀሙ።
ar: بالنسبة للأسئلة التي تسمح بإجابات متعددة ، استخدم نوع مربع الاختيار حيث يمكن للمستجيبين اختيار خيار واحد أو أكثر من خلال النقر على مربعات الاختيار المقابلة.

source: Checkbox
am: አመልካች ሳጥን
ar: خانة اختيار

source: **Radiogroup**
am: **የሬዲዮ ቡድን**

source: For questions that offer several options but allow only one response, use the Radiogroup type where respondents can select a single answer by clicking on one of the radio buttons.
am: ብዙ አማራጮችን ለሚሰጡ ጥያቄዎች ግን አንድ ምላሽ ብቻ ለሚፈቅዱ፣ ምላሽ ሰጪዎች ከሬዲዮ አዝራሮች ውስጥ አንዱን ጠቅ በማድረግ አንድ መልስ የሚመርጡበትን የሬዲዮ ቡድን አይነት ይጠቀሙ።
ar: بالنسبة للأسئلة التي تقدم خيارات متعددة ولكنها تسمح بإجابة واحدة فقط ، استخدم نوع Radiogroup حيث يمكن للمستجيبين تحديد إجابة واحدة بالنقر فوق أحد أزرار الاختيار.

source: ![Radiogroup](../../_static/images/surveys/question-types-radiogroup.png "Radiogroup")
am: ![ሬዲዮ ቡድን](../../_static/images/የዳሰሳ ጥናቶች/ጥያቄ-አይነቶች-ራዲዮግሩፕ.png "ራዲዮግሩፕ")
ar: ! [Radiogroup] (../../_ ثابت / صور / استطلاعات / أسئلة-أنواع-radiogroup.png "Radiogroup")

source: Radiogroup
am: የራዲዮ ቡድን

source: **Dropdown**
am: **ዝቅ በል**
ar: **اسقاط**

source: In the Dropdown type, respondents can choose a single answer from a list of options displayed in a drop-down menu. Similar to Radiogroup, this type is suitable for questions that have multiple options but require only one answer. The Dropdown UI can also show more options while using less screen space.
am: በተቆልቋይ አይነት፣ ምላሽ ሰጪዎች በተቆልቋይ ሜኑ ውስጥ ከሚታዩት አማራጮች ዝርዝር ውስጥ አንድ መልስ መምረጥ ይችላሉ። ከሬዲዮ ግሩፕ ጋር በሚመሳሰል መልኩ ይህ አይነት ብዙ አማራጮች ላሏቸው ነገር ግን አንድ መልስ ብቻ ለሚፈልጉ ጥያቄዎች ተስማሚ ነው። የተቆልቋይ ዩአይ በተጨማሪም ያነሰ የስክሪን ቦታን በሚጠቀሙበት ጊዜ ተጨማሪ አማራጮችን ማሳየት ይችላል።
ar: في نوع القائمة المنسدلة ، يمكن للمستجيبين اختيار إجابة واحدة من قائمة الخيارات المعروضة في القائمة المنسدلة. على غرار Radiogroup ، هذا النوع مناسب للأسئلة التي لها خيارات متعددة ولكنها تتطلب إجابة واحدة فقط. يمكن أيضًا أن تعرض واجهة المستخدم المنسدلة المزيد من الخيارات أثناء استخدام مساحة أقل على الشاشة.

source: ![Dropdown](../../_static/images/surveys/question-types-dropdown.png "Dropdown")
am: ![ተቆልቋይ](.../../_static/images/surveys/question-types-dropdown.png "ማውረድ")
ar: ! [قائمة منسدلة] (../../_ ثابت / صور / استطلاعات / سؤال-أنواع-منسدلة. png "قائمة منسدلة")

source: Dropdown
am: ዝቅ በል
ar: اسقاط

source: **Comment**
am: ** አስተያየት**
ar: **تعليق**

source: For open-ended questions that require respondents to provide lengthy answers, use the Comment type where respondents can input their responses in a resizable multi-line text area. This type is suitable for questions that accept multi-line answers.
am: ክፍት ለሆኑ ጥያቄዎች ምላሽ ሰጪዎች ረጅም መልሶች እንዲሰጡ ለሚፈልጉ፣ ምላሽ ሰጪዎች ምላሻቸውን በሚቀየር ባለብዙ መስመር የጽሑፍ ቦታ ማስገባት የሚችሉበትን የአስተያየት አይነት ይጠቀሙ። ይህ አይነት የባለብዙ መስመር መልሶችን ለሚቀበሉ ጥያቄዎች ተስማሚ ነው.
ar: بالنسبة للأسئلة المفتوحة التي تتطلب من المستجيبين تقديم إجابات مطولة ، استخدم نوع التعليق حيث يمكن للمستجيبين إدخال ردودهم في منطقة نصية متعددة الأسطر يمكن تغيير حجمها. هذا النوع مناسب للأسئلة التي تقبل إجابات متعددة الخطوط.

source: ![Comment](../../_static/images/surveys/question-types-comment.png "Comment")
am: ![አስተያየት](.../../_static/images/surveys/question-types-comment.png "አስተያየት")
ar: ! [تعليق] (../../_ ثابت / صور / استطلاعات / سؤال-أنواع-تعليق. png "تعليق")

source: Comment
am: አስተያየት
ar: تعليق

source: **Rating**
am: ** ደረጃ**
ar: **تقييم**

source: When you want respondents to provide a rating, use the Rating type where they can select a single number from within a specified range. This type is appropriate for questions that require a rating response.
am: ምላሽ ሰጪዎች ደረጃ እንዲሰጡ ሲፈልጉ፣ ከተጠቀሰው ክልል ውስጥ አንድ ነጠላ ቁጥር መምረጥ የሚችሉበትን የደረጃ አሰጣጥ አይነት ይጠቀሙ። ይህ አይነት የደረጃ ምላሽ ለሚፈልጉ ጥያቄዎች ተገቢ ነው።
ar: عندما تريد أن يقدم المستجيبون تصنيفًا ، استخدم نوع التصنيف حيث يمكنهم تحديد رقم واحد من نطاق محدد. هذا النوع مناسب للأسئلة التي تتطلب استجابة تصنيف.

source: ![Rating](../../_static/images/surveys/question-types-rating.png "Rating")
am: ![ደረጃ አሰጣጥ](.../../_static/images/የዳሰሳ ጥናቶች/ጥያቄ-አይነቶች-ደረጃ.png "ደረጃ")
ar: ! [التصنيف] (../../_ ثابت / صور / استطلاعات / سؤال-أنواع-rating.png "تصنيف")

source: Rating
am: ደረጃ መስጠት
ar: تقييم

source: **Ranking**
am: **ደረጃ**
ar: **تصنيف**

source: The Ranking type is suitable for questions where respondents need to establish the order of items. This type allows respondents to drag and drop items from a list to rearrange them based on rank or preference.
am: የደረጃ አሰጣጥ አይነት ምላሽ ሰጪዎች የእቃዎችን ቅደም ተከተል ማዘጋጀት ለሚፈልጉባቸው ጥያቄዎች ተስማሚ ነው። ይህ አይነት ምላሽ ሰጪዎች በደረጃ ወይም በምርጫ ላይ ተመስርተው እንደገና ለማስተካከል ንጥሎችን ከዝርዝር ውስጥ እንዲጎትቱ እና እንዲጥሉ ያስችላቸዋል።
ar: نوع الترتيب مناسب للأسئلة حيث يحتاج المستجيبون إلى تحديد ترتيب العناصر. يسمح هذا النوع للمستجيبين بسحب العناصر وإفلاتها من القائمة لإعادة ترتيبها بناءً على الترتيب أو التفضيل.

source: ![Ranking](../../_static/images/surveys/question-types-ranking.png "Ranking")
am: ![ደረጃ](.../../_static/images/የዳሰሳ ጥናቶች/ጥያቄ-አይነቶች-ደረጃ.png "ደረጃ")
ar: ! [الترتيب] (../../_ ثابت / صور / استطلاعات / سؤال-أنواع-تصنيف. png "الترتيب")

source: Ranking
am: ደረጃ መስጠት
ar: تصنيف

source: **Image Picker**
am: **ምስል መራጭ**
ar: ** منتقي الصور **

source: In a survey question where respondents are required to select one or several images or videos from a series, a value associated with the chosen image or video is saved to the survey results.
am: ምላሽ ሰጪዎች ከተከታታይ አንድ ወይም ብዙ ምስሎችን ወይም ቪዲዮዎችን እንዲመርጡ በተፈለገበት የዳሰሳ ጥናት ጥያቄ ውስጥ፣ ከተመረጠው ምስል ወይም ቪዲዮ ጋር የተያያዘ እሴት ወደ የዳሰሳ ጥናቱ ውጤቶች ተቀምጧል።
ar: في سؤال الاستطلاع حيث يُطلب من المستجيبين تحديد صورة واحدة أو عدة صور أو مقاطع فيديو من سلسلة ، يتم حفظ القيمة المرتبطة بالصورة أو الفيديو المختار في نتائج الاستطلاع.

source: ![Image Picker](../../_static/images/surveys/question-types-imagepicker.png "Image Picker")
am: ![ምስል መራጭ](.../../_static/images/surveys/question-types-imagepicker.png "ምስል መራጭ")
ar: ! [منتقي الصور] (../../_ ثابت / صور / استطلاعات / سؤال-أنواع-imagepicker.png "منتقي الصور")

source: Image Picker
am: ምስል መራጭ
ar: منتقي الصور

source: **Boolean**
am: **ቡሊያን**
ar: ** منطقية **

source: When using a Boolean editor, respondents can switch between Yes or No to provide their response. The survey results will record the response as true for Yes or false for No.
am: የቦሊያን አርታዒን ሲጠቀሙ፣ ምላሽ ሰጪዎች ምላሻቸውን ለመስጠት በአዎ ወይም አይደለም መካከል መቀያየር ይችላሉ። የዳሰሳ ጥናቱ ውጤት ምላሹን እውነት ነው ብሎ ይመዘግባል ወይም ውሸት ለ No።
ar: عند استخدام محرر منطقي ، يمكن للمستجيبين التبديل بين نعم أو لا لتقديم ردهم. ستسجل نتائج الاستطلاع الإجابة على أنها صحيحة لـ نعم أو خطأ للرقم.

source: ![Boolean](../../_static/images/surveys/question-types-boolean.png "Boolean")
am: ![ቡሊያን](../../_static/images/የዳሰሳ ጥናቶች/ጥያቄ-አይነት-ቦሊያን.png "Boolean")
ar: ! [قيمة منطقية] (../../_ ثابت / صور / استطلاعات / أسئلة-أنواع-boolean.png "منطقية")

source: Boolean
am: ቡሊያን
ar: قيمة منطقية

source: **Signature Pad**
am: **የፊርማ ሰሌዳ**
ar: ** لوحة التوقيع **

source: To capture a respondent's signature or any other hand-drawn input, use a type that allows respondents to draw their signature using mouse or touch gestures within a designated input area.
am: የምላሽ ፊርማ ወይም ሌላ በእጅ የተሳለ ግብአት ለመያዝ፣ተጠያቂዎች በተወሰነ የግቤት ቦታ ውስጥ የመዳፊት ወይም የንክኪ ምልክቶችን በመጠቀም ፊርማቸውን እንዲስሉ የሚያስችል አይነት ይጠቀሙ።
ar: لالتقاط توقيع المستفتى أو أي إدخال آخر مرسوم يدويًا ، استخدم نوعًا يسمح للمستجيبين برسم توقيعهم باستخدام الماوس أو إيماءات اللمس داخل منطقة إدخال معينة.

source: ![Signature Pad](../../_static/images/surveys/question-types-signature-pad.png "Signature Pad")
am: ![የፊርማ ሰሌዳ](../../_static/images/የዳሰሳ ጥናቶች/ጥያቄ-አይነቶች-ፊርማ-pad.png "የፊርማ ፓድ")
ar: ! [لوحة التوقيع] (../../_ ثابت / صور / استطلاعات / أسئلة-أنواع-التوقيع-pad.png "لوحة التوقيع")

source: Signature Pad
am: የፊርማ ፓድ
ar: لوحة التوقيع

source: **Image**
am: **ምስል**
ar: **صورة**

source: The Image type is used to include an image or video in the survey for presentation purposes only. This type does not generate a value to be saved in the survey results.
am: የምስል አይነት በዳሰሳ ጥናቱ ውስጥ ምስልን ወይም ቪዲዮን ለአቀራረብ ዓላማ ብቻ ለማካተት ይጠቅማል። ይህ አይነት በዳሰሳ ጥናት ውጤቶች ውስጥ የሚቀመጥ እሴት አያመነጭም።
ar: يتم استخدام نوع الصورة لتضمين صورة أو مقطع فيديو في الاستطلاع لأغراض العرض فقط. هذا النوع لا يولد قيمة ليتم حفظها في نتائج الاستطلاع.

source: The HTML type can be used to format text, include links, and insert media or custom elements into the survey. This type is solely for presentation purposes and does not produce a value to be saved in the survey results. However, it is important to note that HTML content can be susceptible to security breaches. Therefore, make sure that any links inserted lead to trusted resources.
am: የኤችቲኤምኤል አይነት ጽሑፍን ለመቅረጽ፣ አገናኞችን ለማካተት እና ሚዲያ ወይም ብጁ ክፍሎችን በዳሰሳ ጥናቱ ውስጥ ለማስገባት ሊያገለግል ይችላል። ይህ አይነት ለአቀራረብ ዓላማ ብቻ ነው እና በዳሰሳ ጥናቱ ውስጥ የሚቀመጥ እሴት አያመጣም። ሆኖም የኤችቲኤምኤል ይዘት ለደህንነት ጥሰቶች ሊጋለጥ እንደሚችል ልብ ሊባል ይገባል። ስለዚህ፣ የገቡት ማንኛቸውም አገናኞች ወደ ታማኝ ሀብቶች እንደሚመሩ እርግጠኛ ይሁኑ።
ar: يمكن استخدام نوع HTML لتنسيق النص وتضمين الروابط وإدراج الوسائط أو العناصر المخصصة في الاستطلاع. هذا النوع مخصص فقط لأغراض العرض ولا ينتج عنه قيمة ليتم حفظها في نتائج الاستطلاع. ومع ذلك ، من المهم ملاحظة أن محتوى HTML يمكن أن يكون عرضة للانتهاكات الأمنية. لذلك ، تأكد من أن أي روابط مدرجة تؤدي إلى موارد موثوقة.

source: **Expression**
am: **መግለጫ**
ar: **تعبير**

source: The Expression type is used to calculate values and present them to respondents. It can be utilized to sum up scores of previous responses, display current date and time, find an average value, and so on. The calculated value is then saved in the survey results. In the example image provided, the Expression type concatenates the first and last names to display a full name. To define an expression in a survey question, type it into the Expression field found in the General category. Your expression can refer to other survey questions (such as {question1} + {question2}) or use pre-built calculation functions.
am: የ Expression አይነት እሴቶችን ለማስላት እና ለምላሾች ለማቅረብ ያገለግላል። ከዚህ በፊት የተሰጡ ምላሾችን ለማጠቃለል፣ የአሁኑን ቀን እና ሰዓት ለማሳየት፣ አማካኝ እሴትን ለማግኘት እና የመሳሰሉትን መጠቀም ይቻላል። ከዚያም የተሰላው እሴት በዳሰሳ ጥናት ውጤቶች ውስጥ ይቀመጣል. በምሳሌው ምስል ላይ፣ የ Expression አይነት ሙሉ ስም ለማሳየት የመጀመሪያ እና የመጨረሻ ስሞችን ያገናኛል። በዳሰሳ ጥናት ውስጥ ያለውን አገላለጽ ለመግለጽ በአጠቃላይ ምድብ ውስጥ በሚገኘው የገለጻ መስክ ውስጥ ይተይቡ። የእርስዎ አገላለጽ ሌሎች የዳሰሳ ጥናት ጥያቄዎችን (እንደ {question1} + {question2} ያሉ) ሊያመለክት ይችላል ወይም አስቀድሞ የተሰሩ የሂሳብ ስራዎችን ይጠቀሙ።
ar: يتم استخدام نوع التعبير لحساب القيم وتقديمها إلى المستجيبين. يمكن استخدامه لتلخيص درجات الردود السابقة ، وعرض التاريخ والوقت الحاليين ، والعثور على قيمة متوسطة ، وما إلى ذلك. ثم يتم حفظ القيمة المحسوبة في نتائج الاستطلاع. في مثال الصورة المتوفرة ، يربط نوع التعبير بين الاسمين الأول والأخير لعرض الاسم الكامل. لتحديد تعبير في سؤال استطلاع ، اكتبه في حقل التعبير الموجود في الفئة عام. يمكن أن يشير تعبيرك إلى أسئلة استطلاع أخرى (مثل {question1} + {question2}) أو استخدام وظائف حسابية مسبقة الإنشاء.

source: ![Expression](../../_static/images/surveys/question-types-expression.png "Expression")
am: ![መግለጫ](.../../_static/images/surveys/question-types-expression.png "መግለጫ")
ar: ! [تعبير] (../../_ ثابت / صور / استطلاعات / سؤال-أنواع-تعبير. png "تعبير")

source: Expression
am: አገላለጽ
ar: تعبير

source: **File**
am: ** ፋይል ***
ar: **ملف**

source: The File type is used to enable respondents to upload files. They can drag and drop one or several files into the designated area or select files using the browser's Upload File dialog window. Once uploaded, the files are saved in the survey results as base64-encoded strings.
am: የፋይሉ አይነት ምላሽ ሰጪዎች ፋይሎችን እንዲሰቅሉ ለማስቻል ጥቅም ላይ ይውላል። አንድ ወይም ብዙ ፋይሎችን ወደተዘጋጀው ቦታ ጎትተው መጣል ወይም የአሳሹን ሰቀላ ፋይል የንግግር መስኮት በመጠቀም ፋይሎችን መምረጥ ይችላሉ። አንዴ ከተሰቀሉ በኋላ ፋይሎቹ በዳሰሳ ጥናት ውጤቶች ውስጥ እንደ ቤዝ64-የተመሰጠሩ ሕብረቁምፊዎች ይቀመጣሉ።
ar: يتم استخدام نوع الملف لتمكين المستجيبين من تحميل الملفات. يمكنهم سحب وإسقاط ملف أو عدة ملفات في المنطقة المخصصة أو تحديد الملفات باستخدام نافذة حوار تحميل ملف في المتصفح. بمجرد التحميل ، يتم حفظ الملفات في نتائج الاستطلاع كسلاسل مشفرة باستخدام base64.

source: ![File](../../_static/images/surveys/question-types-file.png "File")
am: ![ፋይል](.../../_static/images/surveys/question-types-file.png "ፋይል")
ar: ! [ملف] (../../_ ثابت / صور / استطلاعات / سؤال-أنواع-file.png "ملف")

source: File
am: ፋይል
ar: ملف

source: **Single-Choice Matrix**
am: ** ነጠላ ምርጫ ማትሪክስ ***
ar: ** مصفوفة الاختيار الفردي **

source: The Single-Choice Matrix type exhibits radio buttons arranged in rows and columns. Respondents can choose only one radio button within each row.
am: ነጠላ ምርጫ ማትሪክስ አይነት በረድፎች እና በአምዶች የተደረደሩ የሬዲዮ አዝራሮችን ያሳያል። ምላሽ ሰጪዎች በእያንዳንዱ ረድፍ ውስጥ አንድ የሬዲዮ አዝራር ብቻ መምረጥ ይችላሉ።
ar: يعرض نوع Single-Choice Matrix أزرار اختيار مرتبة في صفوف وأعمدة. يمكن للمستجيبين اختيار زر اختيار واحد فقط داخل كل صف.

source: ![Single-Choice Matrix](../../_static/images/surveys/question-types-matrix-single-choice.png "Single-Choice Matrix")
am: ![ነጠላ ምርጫ ማትሪክስ](.../../_static/images/የዳሰሳ ጥናቶች/ጥያቄ-ዓይነት-ማትሪክስ-ነጠላ-ምርጫ።png "ነጠላ ምርጫ ማትሪክስ")
ar: ! [Single-Choice Matrix] (../../_ ثابت / صور / استطلاعات / أسئلة-أنواع-matrix-single-choice.png "Single-Choice Matrix")

source: Single-Choice Matrix
am: ነጠላ ምርጫ ማትሪክስ
ar: مصفوفة الاختيار الفردي

source: **Multiple-Choice Matrix**
am: **ባለብዙ ምርጫ ማትሪክስ**
ar: ** مصفوفة الاختيار من متعدد **

source: The Multiple-Choice Matrix type displays rows and columns. Respondents use these editors to select a desired value in each cell. The following image illustrates the Multiple-Choice Matrix type with the default Dropdown editors.
am: ባለብዙ ምርጫ ማትሪክስ አይነት ረድፎችን እና አምዶችን ያሳያል። ምላሽ ሰጪዎች በእያንዳንዱ ሕዋስ ውስጥ የሚፈለገውን እሴት ለመምረጥ እነዚህን አርታኢዎች ይጠቀማሉ። የሚከተለው ምስል የብዝሃ ምርጫ ማትሪክስ አይነትን ከነባሪ ተቆልቋይ አርታኢዎች ጋር ያሳያል።
ar: يعرض نوع مصفوفة الاختيار من متعدد الصفوف والأعمدة. يستخدم المستجيبون هذه المحررات لتحديد القيمة المطلوبة في كل خلية. توضح الصورة التالية نوع مصفوفة الاختيار من متعدد باستخدام محرري القائمة المنسدلة الافتراضية.

source: ![Surveys](../../_static/images/surveys/question-types-matrix-multiple-choices.png "Surveys")
am: ![የዳሰሳ ጥናቶች](../../_static/images/የዳሰሳ ጥናቶች/ጥያቄ-አይነቶች-ማትሪክስ-multiple-choices.png "የዳሰሳ ጥናቶች")
ar: ! [استطلاعات الرأي] (../../_ ثابت / صور / استطلاعات / أسئلة-أنواع-matrix-multiple-options.png "استطلاعات")

source: **Dynamic Matrix**
am: ** ተለዋዋጭ ማትሪክስ ***
ar: ** مصفوفة ديناميكية **

source: The Dynamic Matrix type is similar to a [Multiple-Choice Matrix](https://surveyjs.io/survey-creator/documentation/end-user-guide#multiple-choice-matrix), but respondents can add and remove matrix rows.
am: የዳይናሚክ ማትሪክስ አይነት ከ[ባለብዙ ምርጫ ማትሪክስ](https://surveyjs.io/survey-creator/documentation/end-user-guide#multiple-choice-matrix) ጋር ተመሳሳይ ነው፣ ነገር ግን ምላሽ ሰጪዎች የማትሪክስ ረድፎችን ማከል እና ማስወገድ ይችላሉ። .
ar: يشبه نوع المصفوفة الديناميكية [مصفوفة الاختيار من متعدد] (https://surveyjs.io/survey-creator/documentation/end-user-guide#multiple-choice-matrix) ، ولكن يمكن للمستجيبين إضافة صفوف المصفوفة وإزالتها .

source: ![Dynamic Matrix](../../_static/images/surveys/question-types-matrix-dynamic-rows.png "Dynamic Matrix")
am: ![ተለዋዋጭ ማትሪክስ](../../_static/images/የዳሰሳ ጥናቶች/ጥያቄ-ዓይነት-ማትሪክስ-dynamic-rows.png "ተለዋዋጭ ማትሪክስ")
ar: ! [مصفوفة ديناميكية] (../../_ ثابت / صور / استطلاعات / أسئلة-أنواع-matrix-dynamic-rows.png "مصفوفة ديناميكية")

source: Dynamic Matrix
am: ተለዋዋጭ ማትሪክስ
ar: مصفوفة ديناميكية

source: **Multiple Text**
am: **ብዙ ጽሑፍ**
ar: ** نص متعدد **

source: Respondents enter their answers into multiple single-line text editors. Use the Multiple Text type for open-ended questions that require more than one short answer.
am: ምላሽ ሰጪዎች መልሳቸውን በበርካታ ባለአንድ መስመር የጽሑፍ አርታዒዎች ውስጥ ያስገባሉ። ከአንድ በላይ አጭር መልስ ለሚፈልጉ ክፍት ለሆኑ ጥያቄዎች የብዝሃ ጽሑፍ አይነት ይጠቀሙ።
ar: يقوم المستجيبون بإدخال إجاباتهم في برامج تحرير نصوص متعددة ذات سطر واحد. استخدم نوع النص المتعدد للأسئلة المفتوحة التي تتطلب أكثر من إجابة قصيرة واحدة.

source: ![Multiple Text](../../_static/images/surveys/question-types-multiple-text.png "Multiple Text")
am: ![በርካታ ጽሑፍ](../../_static/images/የዳሰሳ ጥናቶች/ጥያቄ-ዓይነት-ብዙ-ጽሑፍ.png "ብዙ ጽሑፍ")
ar: ! [نص متعدد] (../../_ ثابت / صور / استطلاعات / سؤال أنواع-multi-text.png "نص متعدد")

source: Multiple Text
am: ብዙ ጽሑፍ
ar: نص متعدد

source: **Panel**
am: **ፓነል**
ar: **لوحة**

source: The Panel type is a container for other questions and panels. Use this type to group several questions or panels and control them all together.
am: የፓነል አይነት ለሌሎች ጥያቄዎች እና ፓነሎች መያዣ ነው. ብዙ ጥያቄዎችን ወይም ፓነሎችን ለመቧደን እና ሁሉንም በአንድ ላይ ለመቆጣጠር ይህን አይነት ይጠቀሙ።
ar: نوع اللوحة عبارة عن حاوية للأسئلة واللوحات الأخرى. استخدم هذا النوع لتجميع عدة أسئلة أو لوحات والتحكم فيها جميعًا معًا.

source: **Dynamic Panel**
am: ** ተለዋዋጭ ፓነል ***
ar: ** لوحة ديناميكية **

source: The Dynamic Panel type is a template panel that can contain multiple questions. Respondents can add and remove panels based on the template.
am: ተለዋዋጭ ፓነል አይነት ብዙ ጥያቄዎችን ሊይዝ የሚችል የአብነት ፓነል ነው። ምላሽ ሰጪዎች በአብነት ላይ በመመስረት ፓነሎችን ማከል እና ማስወገድ ይችላሉ።
ar: نوع اللوحة الديناميكية عبارة عن لوحة نموذج يمكن أن تحتوي على أسئلة متعددة. يمكن للمستجيبين إضافة وإزالة اللوحات بناءً على القالب.

source: ![Dynamic Panel](../../_static/images/surveys/question-types-dynamic-panel.png "Dynamic Panel")
am: ![ተለዋዋጭ ፓነል](../../_static/images/surveys/question-types-dynamic-panel.png "ተለዋዋጭ ፓነል")
ar: ! [لوحة ديناميكية] (../../_ ثابت / صور / استطلاعات / أسئلة-أنواع-dynamic-panel.png "لوحة ديناميكية")

source: Dynamic Panel
am: ተለዋዋጭ ፓነል
ar: لوحة ديناميكية

source: In progress...
am: በሂደት ላይ...
ar: في تَقَدم...

source: Content Assets
am: የይዘት ንብረቶች
ar: أصول المحتوى

source: Flexible Pages (Flex Page)
am: ተጣጣፊ ገጾች (ተለዋዋጭ ገጽ)
ar: الصفحات المرنة (صفحة مرنة)

source: This is a type of content page that offers a high degree of customization and flexibility in terms of layout and content structure. Unlike other pages above, which have a fixed set of predefined fields, a Flex Page allows you to add various content blocks and sections to create dynamic and richly structured pages.
am: ይህ በአቀማመጥ እና በይዘት አወቃቀሩ ከፍተኛ ደረጃ ማበጀትን እና ተለዋዋጭነትን የሚያቀርብ የይዘት ገጽ አይነት ነው። ከላይ ካሉት ገፆች በተለየ መልኩ ቋሚ የተገለጹ መስኮች ካላቸው፣ ተለዋዋጭ እና በበለጸጉ የተዋቀሩ ገጾችን ለመፍጠር Flex Page የተለያዩ የይዘት ብሎኮችን እና ክፍሎችን ለመጨመር ያስችልዎታል።
ar: هذا نوع من صفحات المحتوى يوفر درجة عالية من التخصيص والمرونة من حيث التخطيط وهيكل المحتوى. على عكس الصفحات الأخرى المذكورة أعلاه ، والتي تحتوي على مجموعة ثابتة من الحقول المحددة مسبقًا ، تتيح لك الصفحة المرنة إضافة مجموعات وأقسام محتوى متنوعة لإنشاء صفحات ديناميكية وغنية التنظيم.

source: With a Flex Page, you have the flexibility to add, rearrange, and customize these content blocks within the page editor. This enables you to build complex and unique page layouts without the need for technical expertise or assistance from developers.
am: በFlex Page አማካኝነት እነዚህን የይዘት ብሎኮች በገጽ አርታኢ ውስጥ ለመጨመር፣ ለማስተካከል እና ለማበጀት የሚያስችል ብቃት አለዎት። ይህ ውስብስብ እና ልዩ የሆኑ የገፅ አቀማመጦችን ቴክኒካዊ እውቀት ወይም የገንቢዎች እገዛ ሳያስፈልግ እንዲገነቡ ያስችልዎታል።
ar: باستخدام Flex Page ، لديك المرونة لإضافة وإعادة ترتيب وتخصيص كتل المحتوى هذه داخل محرر الصفحة. يمكّنك هذا من إنشاء تخطيطات صفحات معقدة وفريدة من نوعها دون الحاجة إلى الخبرة الفنية أو المساعدة من المطورين.

source: The ability to create Flex Pages is one of the features that make Wagtail a powerful and user-friendly CMS. It allows website administrators and editors to have greater control over the presentation of content, making it easier to maintain a consistent design while accommodating diverse content needs across different pages of the website.
am: Flex Pages የመፍጠር ችሎታ ዋግታይልን ኃይለኛ እና ለተጠቃሚ ምቹ ሲኤምኤስ ከሚያደርጉት ባህሪያት አንዱ ነው። የድር ጣቢያ አስተዳዳሪዎች እና አርታኢዎች በይዘት አቀራረብ ላይ የበለጠ ቁጥጥር እንዲኖራቸው ያስችላቸዋል፣ ይህም በተለያዩ የድረ-ገጾች የተለያዩ የይዘት ፍላጎቶችን በማስተናገድ ወጥነት ያለው ዲዛይን ለመጠበቅ ቀላል ያደርገዋል።
ar: القدرة على إنشاء Flex Pages هي إحدى الميزات التي تجعل Wagtail نظام إدارة محتوى قويًا وسهل الاستخدام. يسمح لمسؤولي ومحرري مواقع الويب بتحكم أكبر في عرض المحتوى ، مما يسهل الحفاظ على تصميم متسق مع تلبية احتياجات المحتوى المتنوعة عبر صفحات مختلفة من موقع الويب.

source: Create a Flex Page
am: Flex ገጽ ይፍጠሩ
ar: قم بإنشاء صفحة مرنة

source: To create this page navigate to the 'pages' item on the explorer menu as shown below and click on the pages item at the top.
am: ይህንን ገጽ ለመፍጠር ከዚህ በታች እንደሚታየው በአሳሽ ምናሌው ላይ ወዳለው 'ገጾች' ንጥል ይሂዱ እና ከላይ ያለውን የገጾች ንጥል ላይ ጠቅ ያድርጉ።
ar: لإنشاء هذه الصفحة ، انتقل إلى عنصر "الصفحات" في قائمة المستكشف كما هو موضح أدناه وانقر على عنصر الصفحات في الأعلى.

source: ![Pages Explorer](../../_static/images/pages/pages_explorer.png "Pages Explorer")
am: ![ገጽ አሳሽ](.../../_static/images/pages/pages_explorer.png "Pages Explorer")
ar: ! [مستكشف الصفحات] (../../_ static / images / pages / pages_explorer.png "مستكشف الصفحات")

source: Pages Explorer
am: ገጾች አሳሽ
ar: مستكشف الصفحات

source: Hover over the Home item and click 'Add Child Page'
am: በመነሻ ንጥል ላይ ያንዣብቡ እና 'የልጆችን ገጽ አክል' ን ጠቅ ያድርጉ
ar: مرر مؤشر الماوس فوق عنصر الصفحة الرئيسية وانقر فوق "إضافة صفحة فرعية"

source: ![Add Child Page](../../_static/images/pages/add_child_page.png "Add Child Page")
am: ![የልጅ ገጽ አክል](../../_static/images/pages/add_child_page.png "የልጆች ገጽ አክል")
ar: ! [إضافة صفحة فرعية] (../../_ static / images / pages / add_child_page.png "إضافة صفحة فرعية")

source: Add Child Page
am: የልጅ ገጽ ያክሉ
ar: أضف صفحة فرعية

source: Select Flex Page from the type of pages provided.
am: ከቀረቡት ገጾች አይነት Flex Page የሚለውን ይምረጡ።
ar: حدد Flex Page من نوع الصفحات المتوفرة.

source: ![Add Flex Page](../../_static/images/flex_page/add_flex_page.png "Add Flex Page")
am: ![Flex Page አክል](../../_static/images/flex_page/add_flex_page.png "Flex Page አክል")
ar: ! [إضافة صفحة مرنة] (../../_ static / images / flex_page / add_flex_page.png "إضافة صفحة مرنة")

source: Add Flex Page
am: የFlex ገጽን ያክሉ
ar: أضف صفحة فليكس

source: Sections of a Flex Page
am: የተለዋዋጭ ገጽ ክፍሎች
ar: أقسام صفحة فليكس

source: The main sections of the flex page include the **page title, banner and content** section.
am: የተለዋዋጭ ገጹ ዋና ክፍሎች ** የገጽ ርዕስ፣ ባነር እና ይዘት** ክፍልን ያካትታሉ።
ar: تشمل الأقسام الرئيسية للصفحة المرنة قسم ** عنوان الصفحة والشعار والمحتوى **.

source: Flex Page Sections
am: Flex ገጽ ክፍሎች
ar: أقسام الصفحة المرنة

source: The **content section** contains a set of resuable and reorderable blocks, i.e
am: **የይዘት ክፍል** እንደገና ሊዘጋጁ የሚችሉ እና ሊደረደሩ የሚችሉ ብሎኮች ስብስብ ይዟል፣ ማለትም
ar: يحتوي ** قسم المحتوى ** على مجموعة من الكتل التي يمكن إعادة ترتيبها وإعادة ترتيبها ، أي

source: Title and Text Block
am: ርዕስ እና ጽሑፍ እገዳ
ar: كتلة العنوان والنص

source: Title, Text and Image Block
am: ርዕስ፣ ጽሑፍ እና ምስል አግድ
ar: العنوان والنص وكتلة الصورة

source: Accordion Block ![Flex Page Sections](../../_static/images/flex_page/accordion.png "Flex Page Sections")
am: አኮርዲዮን አግድ ![Flex Page Sections](../../_static/images/flex_page/accordion.png "Flex Page Sections")
ar: بلوك الأكورديون! [أقسام الصفحات المرنة] (../../_ static / images / flex_page / accordion.png "أقسام الصفحة المرنة")

source: Table Block ![Flex Page Sections](../../_static/images/flex_page/table.png "Flex Page Sections")
am: የሰንጠረዥ እገዳ![Flex Page Sections](.../../_static/images/flex_page/table.png "Flex Page Sections")
ar: كتلة الجدول! [أقسام الصفحات المرنة] (../../_ static / images / flex_page / table.png "أقسام الصفحات المرنة")

source: News
am: ዜና
ar: أخبار

source: Creation of news
am: ዜና መፈጠር
ar: خلق الأخبار

source: The creation of news follows the steps below:
am: የዜና መፈጠር የሚከተሉትን ደረጃዎች ይከተላል.
ar: يتبع إنشاء الأخبار الخطوات التالية:

source: Create a news type
am: የዜና ዓይነት ይፍጠሩ
ar: قم بإنشاء نوع الأخبار

source: Create a news listing page
am: የዜና ዝርዝር ገጽ ይፍጠሩ
ar: إنشاء صفحة قائمة الأخبار

source: Create a news page
am: የዜና ገጽ ይፍጠሩ
ar: قم بإنشاء صفحة أخبار

source: News Creation Example Scenario
am: የዜና ፈጠራ ምሳሌ ሁኔታ
ar: سيناريو مثال إنشاء الأخبار
