Repository: ACMAD-Niamey/climweb
Catalog: docs/locales/*/LC_MESSAGES/_docs.po
Languages: am, ar

source: ![Additional Materials](../../../_static/images/about/additional_material.png "Additional Materials")
am: ![ተጨማሪ እቃዎች](../../../_static/images/about/additional_material.png "ተጨማሪ እቃዎች")
ar: ! [مواد إضافية] (../../../_ static / images / about / extra_material.png "مواد إضافية")

source: Additional Materials
am: ተጨማሪ ቁሳቁሶች
ar: مواد إضافية

source: ![Feature Block Sections](../../../_static/images/services/feature_block_section.png "Projects Sections")
am: ![የባህሪ እገዳ ክፍሎች](../../../_static/images/services/feature_block_section.png "የፕሮጀክቶች ክፍሎች")
ar: ! [أقسام كتلة الميزات] (../../../_ static / images / services / feature_block_section.png "أقسام المشاريع")

source: **Bottom Call to action Section** - call to action button at the bottom of the page.
am: ** የታችኛው ጥሪ ወደ ተግባር ክፍል *** - ከገጹ ግርጌ ላይ ወደ ተግባር ይደውሉ።
ar: ** القسم السفلي للحث على اتخاذ إجراء ** - زر الحث على اتخاذ إجراء في أسفل الصفحة.

source: ![Bottom CTA Sections](../../../_static/images/about/bottom_cta_section.png "Bottom CTA Sections")
am: ![የታችኛው የሲቲኤ ክፍሎች](.../../../_static/images/about/bottom_cta_section.png "ከታች የሲቲኤ ክፍሎች")
ar: ! [أقسام CTA السفلية] (../../../_ static / images / about / bottom_cta_section.png "أقسام CTA السفلية")

source: Bottom CTA Sections
am: የታችኛው የሲቲኤ ክፍሎች
ar: أقسام CTA السفلية

source: Organisation Pages
am: የድርጅት ገጾች
ar: صفحات المنظمة

source: ![Organisation page](../../../_static/images/organisation/organisation_preview.png "Organisation page")
am: ![ድርጅት ገጽ](../../../_static/images/organisation/ድርጅት_ቅድመ እይታ.png "የድርጅት ገጽ")
ar: ! [صفحة المؤسسة] (../../../_ static / images / Organization / organisation_preview.png "صفحة المؤسسة")

source: The Organisational Index page lists the pages below:
am: ድርጅታዊ መረጃ ጠቋሚ ገፅ ከዚህ በታች ያሉትን ገፆች ይዘረዝራል።
ar: تسرد صفحة الفهرس التنظيمي الصفحات أدناه:

source: To create the overall organisation page that houses the pages above, begin by adding a child page to the home page and selecting 'Organisation Index Page'.
am: ከላይ ያሉትን ገፆች የያዘውን አጠቃላይ የድርጅት ገጽ ለመፍጠር የሕፃን ገጽ ወደ መነሻ ገጽ በማከል እና 'የድርጅት መረጃ ጠቋሚ ገጽ' የሚለውን በመምረጥ ይጀምሩ።
ar: لإنشاء صفحة المؤسسة العامة التي تضم الصفحات أعلاه ، ابدأ بإضافة صفحة فرعية إلى الصفحة الرئيسية واختيار "صفحة فهرس المؤسسة".

source: ![Organisation page](../../../_static/images/organisation/add_organisation_page.png "Organisation page")
am: ![ድርጅት ገጽ](../../../_static/images/organisation/add_organisation_page.png "የድርጅት ገጽ")
ar: ! [صفحة المؤسسة] (../../../_ static / images / organization / add_organisation_page.png "صفحة المؤسسة")

source: ![Organisation page](../../../_static/images/organisation/select_organisation_page.png "Organisation page")
am: ![ድርጅት ገፅ](../../../_static/images/organisation/select_organisation_page.png "የድርጅት ገጽ")
ar: ! [صفحة المؤسسة] (../../../_ static / images / organization / select_organisation_page.png "صفحة المؤسسة")

source: Populate the form with page title and listing heading as below:
am: ቅጹን ከዚህ በታች ባለው መልኩ በገጽ ርዕስ እና ዝርዝር ርዕስ ይሙሉት።
ar: قم بتعبئة النموذج بعنوان الصفحة وعنوان القائمة على النحو التالي:

source: ![Organisation page](../../../_static/images/organisation/organisation_page.png "Organisation page")
am: ![ድርጅት ገጽ](../../../_static/images/ድርጅት/ድርጅት_ገጽ.png "የድርጅት ገጽ")
ar: ! [صفحة المؤسسة] (../../../_ static / images / Organization / organisation_page.png "صفحة المؤسسة")

source: Note: This option will only appear if an 'Organisation Index Page' does not already exist as only one instance of this page is allowed. If it already exists proceed to prepare the other pages listed above.
am: ማሳሰቢያ፡ ይህ አማራጭ የሚታየው የዚህ ገጽ አንድ ምሳሌ ብቻ ስለተፈቀደ 'የድርጅት መረጃ ጠቋሚ ገጽ' ከሌለ ብቻ ነው። ቀድሞውኑ ካለ ከላይ የተዘረዘሩትን ሌሎች ገጾችን ለማዘጋጀት ይቀጥሉ.
ar: ملاحظة: سيظهر هذا الخيار فقط في حالة عدم وجود "صفحة فهرس المؤسسة" بالفعل حيث يُسمح بنسخة واحدة فقط من هذه الصفحة. إذا كان موجودًا بالفعل ، تابع تجهيز الصفحات الأخرى المذكورة أعلاه.

source: Partners Page
am: የአጋሮች ገጽ
ar: صفحة الشركاء

source: The steps to create a partners page are:
am: የአጋሮች ገጽ ለመፍጠር ደረጃዎች የሚከተሉት ናቸው
ar: خطوات إنشاء صفحة شركاء هي:

source: Create a list of partners
am: የአጋሮች ዝርዝር ይፍጠሩ
ar: أنشئ قائمة بالشركاء

source: Create a partners page
am: የአጋሮች ገጽ ይፍጠሩ
ar: أنشئ صفحة شركاء

source: 1. Create a list of partners
am: 1. የአጋሮች ዝርዝር ይፍጠሩ
ar: 1. إنشاء قائمة الشركاء

source: To list partners begin by accessing the partners menu from snippets as shown below.
am: አጋሮችን ለመዘርዘር ከታች እንደሚታየው የባልደረባዎች ምናሌን ከቅንጣቢዎች በመድረስ ይጀምሩ።
ar: لإدراج الشركاء ، ابدأ بالوصول إلى قائمة الشركاء من المقتطفات كما هو موضح أدناه.

source: ![List Partners](../../../_static/images/partners/partners_explorer.png "List Partners")
am: ![የዝርዝር አጋሮች](../../../_static/images/partners/partners_explorer.png "የዝርዝር አጋሮች")
ar: ! [قائمة الشركاء] (../../../_ static / images / Partners / Partners_explorer.png "قائمة الشركاء")

source: List Partners
am: አጋሮች ዝርዝር
ar: قائمة الشركاء

source: Click on add partners
am: አጋሮችን አክል የሚለውን ጠቅ ያድርጉ
ar: انقر فوق إضافة شركاء

source: ![Add Partners](../../../_static/images/partners/add_partner.png "Add Partners")
am: ![አጋሮችን አክል](../../../_static/images/partners/add_partner.png "አጋሮችን አክል")
ar: ! [إضافة شركاء] (../../../_ static / images / Partners / add_partner.png "إضافة شركاء")

source: Add Partners
am: አጋሮችን ያክሉ
ar: أضف شركاء

source: Provide the partner name, logo, link to website and any other relevant info in the form.
am: በቅጹ ውስጥ የአጋር ስም፣ አርማ፣ የድረ-ገጽ አገናኝ እና ማንኛውንም ተዛማጅ መረጃ ያቅርቡ።
ar: أدخل اسم الشريك والشعار والرابط إلى موقع الويب وأي معلومات أخرى ذات صلة في النموذج.

source: ![Partners](../../../_static/images/partners/partner.png "Partners")
am: ![አጋሮች](../../../_static/images/partners/partner.png "አጋሮች")
ar: ! [الشركاء] (../../../_ static / images / Partners / partner.png "الشركاء")

source: Partners
am: አጋሮች
ar: شركاء

source: Repeat this process to list more partners
am: ተጨማሪ አጋሮችን ለመዘርዘር ይህን ሂደት ይድገሙት
ar: كرر هذه العملية لإدراج المزيد من الشركاء

source: 2. Create a partners page
am: 2. የአጋሮች ገጽ ይፍጠሩ
ar: 2. إنشاء صفحة شركاء

source: To create a partner page, navigate to organisation page and create a child page from it selecting the about page.
am: የአጋር ገጽ ለመፍጠር ወደ ድርጅት ገጽ ይሂዱ እና ስለ ገጹ በመምረጥ የልጅ ገጽ ይፍጠሩ።
ar: لإنشاء صفحة شريك ، انتقل إلى صفحة المؤسسة وأنشئ صفحة فرعية منها باختيار صفحة حول.

source: ![Partner page](../../../_static/images/partners/add_partner_page.png "Partner page")
am: ![የአጋር ገጽ](.././../_static/images/partners/add_partner_page.png "የአጋር ገጽ")
ar: ! [صفحة الشريك] (../../../_ static / images / Partners / add_partner_page.png "صفحة الشريك")

source: Partner page
am: የአጋር ገጽ
ar: صفحة الشريك

source: The Partners page contains the sections below:
am: የአጋሮች ገጽ የሚከተሉትን ክፍሎች ይዟል፡-
ar: تحتوي صفحة الشركاء على الأقسام التالية:

source: ![Partner page](../../../_static/images/partners/partner_sections.png "Partner page")
am: ![የአጋር ገጽ](.././../_static/images/partners/partner_sections.png "የአጋር ገጽ")
ar: ! [صفحة الشريك] (../../../_ static / images / Partners / partner_sections.png "صفحة الشريك")

source: ![Banner Sections](../../../_static/images/partners/banner_section.png "Banner Sections")
am: ![ሰንደቅ ክፍሎች](../../../_static/images/partners/banner_section.png "ሰንደቅ ክፍሎች")
ar: ! [أقسام البانر] (../../../_ static / images / Partners / banner_section.png "أقسام البانر")

source: ![Introduction Sections](../../../_static/images/partners/introduction_section.png "Introduction Sections")
am: ![የመግቢያ ክፍሎች](../../../_static/images/partners/introduction_section.png "የመግቢያ ክፍሎች")
ar: ! [أقسام المقدمة] (../../../_ static / images / Partners / Introduction_section.png "أقسام المقدمة")

source: **Partners Call to Action Section**
am: ** የአጋሮች ጥሪ ወደ ተግባር ክፍል ***
ar: ** قسم دعوة الشركاء للعمل **

source: ![Partner CTA Sections](../../../_static/images/partners/partner_cta.png "Partner CTA Sections")
am: ![የአጋር ሲቲኤ ክፍሎች](.../../../_static/images/partners/partner_cta.png "የአጋር ሲቲኤ ክፍሎች"
ar: ! [أقسام CTA الخاصة بالشريك] (../../../_ static / images / Partners / partner_cta.png "أقسام CTA الخاصة بالشريك")

source: Partner CTA Sections
am: አጋር CTA ክፍሎች
ar: أقسام CTA الشريكة

source: Note: All listed partners in step 1 will be displayed automatically on the partners page.
am: ማሳሰቢያ፡ በደረጃ 1 ሁሉም የተዘረዘሩ አጋሮች በራስ ሰር በአጋሮች ገጽ ላይ ይታያሉ።
ar: ملاحظة: سيتم عرض جميع الشركاء المدرجين في الخطوة 1 تلقائيًا على صفحة الشركاء.

source: Projects
am: ፕሮጀክቶች
ar: المشاريع

source: Tenders
am: ጨረታዎች
ar: المناقصات

source: Vacancies
am: ክፍት የስራ ቦታዎች
ar: الشواغر

source: Workflows
am: የስራ ፍሰቶች
ar: سير العمل

source: About workflows
am: ስለ የስራ ሂደቶች
ar: حول سير العمل

source: Workflows allow you to configure how moderation works on your site. Workflows are sequences of tasks that require approval before completion. A completed workflow usually results in the publication of a page, depending on your website's settings.
am: የስራ ፍሰቶች በጣቢያዎ ላይ ልከኝነት እንዴት እንደሚሰራ እንዲያዋቅሩ ያስችሉዎታል። የስራ ፍሰቶች ከመጠናቀቁ በፊት ማጽደቅ የሚያስፈልጋቸው የተግባር ቅደም ተከተሎች ናቸው። የተጠናቀቀ የስራ ሂደት እንደ ድር ጣቢያዎ ቅንብሮች ላይ በመመስረት አብዛኛውን ጊዜ የገጽ ህትመትን ያስከትላል።
ar: تتيح لك مهام سير العمل تكوين كيفية عمل الإشراف على موقعك. إن مهام سير العمل عبارة عن تسلسلات من المهام التي تتطلب الموافقة قبل الإكمال. عادةً ما ينتج عن سير العمل المكتمل نشر صفحة ، بناءً على إعدادات موقع الويب الخاص بك.

source: To access the Workflow interface, go to **Settings > Workflows** from the left Sidebar.
am: የስራ ፍሰት በይነገጽን ለመድረስ ከግራ የጎን አሞሌ ወደ ** መቼቶች > የስራ ፍሰቶች ** ይሂዱ።
ar: للوصول إلى واجهة سير العمل ، انتقل إلى ** الإعدادات> مهام سير العمل ** من الشريط الجانبي الأيسر.

source: ![Worklow explorer](../../_static/images/workflows/workflow_explorer.png "Worklow explorer")
am: ![Worklow ኤክስፕሎረር](../../_static/images/workflows/workflow_explorer.png "Worklow Explorer")
ar: ! [مستكشف سير العمل] (../../_ static / images / workflows / workflow_explorer.png "Workflow explorer")

source: Worklow explorer
am: Worklow አሳሽ
ar: مستكشف سير العمل

source: From the Workflow interface, you can see all of the workflows on your site and the order of tasks in each. To create a new workflow, click Add a workflow from the Workflow interface.
am: ከስራ ፍሰት በይነገጽ, በጣቢያዎ ላይ ያሉትን ሁሉንም የስራ ፍሰቶች እና በእያንዳንዱ ውስጥ የተግባር ቅደም ተከተል ማየት ይችላሉ. አዲስ የስራ ሂደት ለመፍጠር ከስራ ፍሰት በይነገጽ የስራ ፍሰት አክል የሚለውን ጠቅ ያድርጉ።
ar: من واجهة Workflow ، يمكنك رؤية جميع مهام سير العمل على موقعك وترتيب المهام في كل منها. لإنشاء سير عمل جديد ، انقر فوق إضافة سير عمل من واجهة سير العمل.

source: Furthermore, the Workflow interface shows how many pages each workflow covers. If you click the number of pages, you can see a list of all the pages a workflow applies to.
am: በተጨማሪም የስራ ፍሰት በይነገጽ እያንዳንዱ የስራ ፍሰት ምን ያህል ገጾችን እንደሚሸፍን ያሳያል። የገጾቹን ብዛት ጠቅ ካደረጉ የስራ ፍሰት የሚተገበርባቸውን ሁሉንም ገጾች ዝርዝር ማየት ይችላሉ።
ar: علاوة على ذلك ، توضح واجهة سير العمل عدد الصفحات التي يغطيها كل سير عمل. إذا قمت بالنقر فوق عدد الصفحات ، يمكنك مشاهدة قائمة بجميع الصفحات التي ينطبق عليها سير العمل.

source: ![Worklow interface](../../_static/images/workflows/list_workflows.png "Worklow interface")
am: ![Worklow በይነገጽ](../../_static/images/workflows/list_workflows.png "Worklow በይነገጽ")
ar: ! [واجهة سير العمل] (../../_ static / images / workflows / list_workflows.png "واجهة سير العمل")

source: Worklow interface
am: Worklow በይነገጽ
ar: واجهة سير العمل

source: Edit workflows
am: የስራ ሂደቶችን ያርትዑ
ar: تحرير مهام سير العمل

source: In the Workflow interface, click on the name of a workflow to edit it or to assign it to a part of the page tree.
am: በ Workflow በይነገጽ ውስጥ፣ ለማርትዕ ወይም ለገጹ ዛፍ ክፍል ለመመደብ የስራ ፍሰት ስም ላይ ጠቅ ያድርጉ።
ar: في واجهة سير العمل ، انقر فوق اسم سير العمل لتعديله أو لتعيينه لجزء من شجرة الصفحة.

source: Click **Add task** under **Add tasks to your workflow** to add a task. When adding a task to a workflow, you can create a new task or reuse an existing one.
am: ተግባር ለማከል በ **ተግባርን ወደ የስራ ፍሰትዎ ላይ ጨምር** በሚለው ስር **ተግባር አክል* የሚለውን ይንኩ። አንድን ተግባር ወደ የስራ ሂደት ሲያክሉ አዲስ ስራ መፍጠር ወይም ነባሩን እንደገና መጠቀም ይችላሉ።
ar: انقر فوق ** إضافة مهمة ** ضمن ** إضافة مهام إلى سير العمل ** لإضافة مهمة. عند إضافة مهمة إلى سير عمل ، يمكنك إنشاء مهمة جديدة أو إعادة استخدام مهمة موجودة.

source: To change a task in the workflow, hover over the task under **Add tasks to your workflow** and select **Choose another task** from the pop-up options.
am: በስራ ሂደት ውስጥ አንድን ተግባር ለመቀየር በ **ወደ የስራ ፍሰትዎ ላይ ተግባሮችን ጨምሩ** በሚለው ስር ባለው ተግባር ላይ ያንዣብቡ እና ከተከፈቱ አማራጮች ውስጥ **ሌላ ተግባር ይምረጡ** የሚለውን ይምረጡ።
ar: لتغيير مهمة في سير العمل ، مرر مؤشر الماوس فوق المهمة ضمن ** إضافة مهام إلى سير العمل الخاص بك ** وحدد ** اختر مهمة أخرى ** من الخيارات المنبثقة.

source: You can also reorder tasks in a workflow by hovering over a task under the **Add tasks to your workflow** and then clicking the up and down arrow.
am: በ***በስራ ሂደትዎ ላይ ተግባሮችን ጨምሩ** በሚለው ስር ተግባር ላይ በማንዣበብ እና የላይ እና ታች ቀስቱን በመጫን ስራዎችን በስራ ሂደት ውስጥ እንደገና ማዘዝ ይችላሉ።
ar: يمكنك أيضًا إعادة ترتيب المهام في سير عمل بالمرور فوق مهمة ضمن ** إضافة مهام إلى سير العمل ** ثم النقر فوق السهم لأعلى ولأسفل.

source: Under **Assign your workflow to pages**, you can see a list of the pages assigned to a workflow. All child pages take the same workflow as their parents. So if the root page of your site gets assigned to a workflow, it becomes the default workflow. You may remove a page from the workflow by clicking **Delete** at the right of each entry. Also, you can change the page in an entry to another by clicking **Choose another page.**
am: በ ** የስራ ፍሰትዎን ለገጾች መድቡ**፣ ለስራ ሂደት የተመደቡትን ገፆች ዝርዝር ማየት ይችላሉ። ሁሉም የሕፃን ገጾች ከወላጆቻቸው ጋር አንድ አይነት የስራ ሂደት ይወስዳሉ. ስለዚህ የጣቢያዎ ስርወ ገጽ ለስራ ፍሰት ከተመደበ ነባሪ የስራ ሂደት ይሆናል። በእያንዳንዱ ግቤት በስተቀኝ ያለውን **ሰርዝ** ጠቅ በማድረግ አንድን ገጽ ከስራ ሂደቱ ማስወገድ ይችላሉ። እንዲሁም **ሌላ ገጽ ምረጥ** የሚለውን በመጫን ግቤት ላይ ገጹን መቀየር ትችላለህ።
ar: ضمن ** تعيين سير العمل الخاص بك إلى الصفحات ** ، يمكنك مشاهدة قائمة بالصفحات المخصصة لسير العمل. كل الصفحات الفرعية تأخذ نفس سير العمل مثل آبائهم. لذلك إذا تم تعيين الصفحة الجذر لموقعك لسير عمل ، فسيصبح سير العمل الافتراضي. يمكنك إزالة صفحة من سير العمل بالنقر فوق ** حذف ** على يمين كل إدخال. أيضًا ، يمكنك تغيير الصفحة في إدخال إلى آخر بالنقر فوق ** اختر صفحة أخرى. **

source: The action menu at the bottom allows you to save your changes, or disable the workflow. Disabling a workflow cancels all pages currently in moderation in that workflow, and prevents others from starting it. If the workflow was previously disabled, then you get the option to enable it in the action menu.
am: ከታች ያለው የእርምጃ ምናሌ ለውጦችዎን እንዲያስቀምጡ ወይም የስራ ሂደቱን እንዲያሰናክሉ ያስችልዎታል. የስራ ፍሰትን ማሰናከል በአሁኑ ጊዜ በመጠኑ ላይ ያሉትን ሁሉንም ገፆች ይሰርዛል፣ እና ሌሎች እንዳይጀምሩት ይከለክላል። የስራ ፍሰቱ ቀደም ብሎ ከተሰናከለ በድርጊት ምናሌ ውስጥ እሱን ለማንቃት አማራጩን ያገኛሉ።
ar: تسمح لك قائمة الإجراءات الموجودة في الأسفل بحفظ التغييرات أو تعطيل سير العمل. يؤدي تعطيل سير العمل إلى إلغاء كل الصفحات التي تخضع حاليًا للاعتدال في سير العمل هذا ، ويمنع الآخرين من بدئه. إذا تم تعطيل سير العمل مسبقًا ، فستحصل على خيار تمكينه في قائمة الإجراء.

source: ![Edit Worklow](../../_static/images/workflows/edit_workflow.png "Edit Worklow")
am: ![ ወርክሎውን አርትዕ ](../../_static/images/workflows/edit_workflow.png "Worklow አርትዕ")
ar: ! [تحرير سير العمل] (../../_ static / images / workflows / edit_workflow.png "تحرير سير العمل")

source: Edit Worklow
am: Worklow አርትዕ
ar: تحرير Worklow

source: Create and edit tasks
am: ተግባሮችን ይፍጠሩ እና ያርትዑ
ar: إنشاء المهام وتحريرها

source: To create a task, go to Settings > Workflows tasks from the Sidebar. This takes you to the Tasks interface, where you can see a list of the currently available tasks and which workflows use each task. Similar to workflows, you can click the name of an existing task to edit it. To add a new task, click Add a task.
am: ተግባር ለመፍጠር ከጎን አሞሌው ወደ ቅንብሮች > የስራ ፍሰት ተግባራት ይሂዱ። ይህ ወደ የተግባር በይነገጽ ይወስድዎታል፣ አሁን ያሉትን ተግባራት ዝርዝር ማየት እና የትኛውን የስራ ፍሰቶች እያንዳንዱን ተግባር እንደሚጠቀሙ ማየት ይችላሉ። ከሥራ ፍሰቶች ጋር በሚመሳሰል መልኩ፣ እሱን ለማርትዕ የነባር ተግባርን ስም ጠቅ ማድረግ ይችላሉ። አዲስ ተግባር ለማከል ተግባር ጨምር የሚለውን ጠቅ ያድርጉ።
ar: لإنشاء مهمة ، انتقل إلى الإعدادات> مهام مهام سير العمل من الشريط الجانبي. ينقلك هذا إلى واجهة المهام ، حيث يمكنك رؤية قائمة بالمهام المتاحة حاليًا ومهام سير العمل التي تستخدم كل مهمة. على غرار مهام سير العمل ، يمكنك النقر فوق اسم مهمة موجودة لتحريرها. لإضافة مهمة جديدة ، انقر فوق إضافة مهمة.

source: ![Worklow Task](../../_static/images/workflows/workflow_tasks.png "Worklow Tasks")
am: ![Worklow ተግባር](../../_static/images/workflows/workflow_tasks.png "የስራ ሂደት)"
ar: ! [مهمة سير العمل] (../../_ static / images / workflows / workflow_tasks.png "مهام سير العمل")

source: Worklow Task
am: የስራ ሂደት
ar: مهمة سير العمل

source: When creating a task, if you have multiple task types available, then they are offered to you as options. By default, only group approval tasks are available. By creating a group approval task, you are able to select one or multiple groups. Members of any of these, as well as administrators, will be able to approve or reject moderation for this task.
am: አንድ ተግባር በሚፈጥሩበት ጊዜ, ብዙ የተግባር ዓይነቶች ካሉዎት, እንደ አማራጭ ይቀርቡልዎታል. በነባሪ፣ የቡድን ማጽደቅ ተግባራት ብቻ ይገኛሉ። የቡድን ማጽደቅ ተግባር በመፍጠር አንድ ወይም ብዙ ቡድኖችን መምረጥ ይችላሉ። ከእነዚህ ውስጥ የማንኛቸውም አባላት፣ እንዲሁም አስተዳዳሪዎች፣ ለዚህ ​​ተግባር ልከኝነትን ማጽደቅ ወይም ውድቅ ማድረግ ይችላሉ።
ar: عند إنشاء مهمة ، إذا كان لديك العديد من أنواع المهام المتاحة ، فسيتم تقديمها لك كخيارات. بشكل افتراضي ، تتوفر مهام قبول المجموعة فقط. من خلال إنشاء مهمة موافقة المجموعة ، يمكنك تحديد مجموعة واحدة أو عدة مجموعات. سيتمكن أعضاء أي من هؤلاء ، بالإضافة إلى المسؤولين ، من الموافقة على الإشراف أو رفضه لهذه المهمة.

source: ![Edit Worklow Task](../../_static/images/workflows/edit_workflow_task.png "Edit Worklow Task")
am: ![ Worklow ተግባርን አርትዕ ](../../_static/images/workflows/edit_workflow_task.png "የስራ ሂደት አርትዕ")
ar: ! [تحرير مهمة سير العمل] (../../_ static / images / workflows / edit_workflow_task.png "تحرير مهمة سير العمل")

source: Edit Worklow Task
am: Worklow ተግባርን ያርትዑ
ar: تحرير مهمة سير العمل

source: When editing a task, you may find that some fields, such as the name field, are uneditable. This is to ensure workflow history remains consistent. If you need to change the name of a task, then disable the old task, and create a new one with the name you need. Disabling a task causes any pages currently in moderation on that task to skip to the next task.
am: አንድን ተግባር በሚያርትዑበት ጊዜ፣ እንደ ስም መስክ ያሉ አንዳንድ መስኮች የማይታረሙ ሆነው ሊያገኙ ይችላሉ። ይህ የስራ ሂደት ታሪክ ወጥነት ያለው ሆኖ እንዲቆይ ለማድረግ ነው። የተግባርን ስም መቀየር ከፈለጉ የድሮውን ተግባር ያሰናክሉ እና በሚፈልጉት ስም አዲስ ይፍጠሩ። አንድን ተግባር ማሰናከል በአሁኑ ጊዜ በመጠኑ ላይ ያሉ ማንኛቸውም ገጾች ወደሚቀጥለው ተግባር እንዲዘሉ ያደርጋል።
ar: عند تحرير مهمة ، قد تجد أن بعض الحقول ، مثل حقل الاسم ، غير قابلة للتحرير. هذا لضمان بقاء محفوظات سير العمل متسقة. إذا كنت بحاجة إلى تغيير اسم مهمة ما ، فقم بتعطيل المهمة القديمة ، وأنشئ مهمة جديدة بالاسم الذي تريده. يؤدي تعطيل مهمة إلى تخطي أي صفحات قيد الإشراف حاليًا على هذه المهمة إلى المهمة التالية.

source: Menus
am: ምናሌዎች
ar: القوائم

source: Managing Top Navigation
am: ከፍተኛ ዳሰሳን ማስተዳደር
ar: إدارة التنقل العلوي

source: ![Top Navbar](../../_static/images/menus/top_nav_preview.png "Top Navbar")
am: ![ከፍተኛ ናቭባር](../../_static/images/menus/top_nav_preview.png "ከፍተኛ ናቭባር")

source: Top Navbar
am: ከፍተኛ Navbar
ar: أعلى نافبار

source: The menu items of the top navigation of the website can be added/edited or removed. to access the menu configurations in the CMS, click on the settings and main menu on the left sidebar.
am: የድረ-ገጹ የላይኛው አሰሳ ምናሌ ንጥሎች ሊታከሉ/ማስተካከያዎች ወይም ሊወገዱ ይችላሉ። በሲኤምኤስ ውስጥ ያሉትን የምናሌ አወቃቀሮችን ለማግኘት በግራ የጎን አሞሌው ላይ ያሉትን ቅንብሮች እና ዋና ሜኑ ላይ ጠቅ ያድርጉ።
ar: يمكن إضافة / تحرير أو إزالة عناصر القائمة في الجزء العلوي من الموقع. للوصول إلى تكوينات القائمة في نظام إدارة المحتوى ، انقر فوق الإعدادات والقائمة الرئيسية على الشريط الجانبي الأيسر.

source: ![Top Navbar](../../_static/images/menus/top_nav_explorer.png "Top Navbar")
am: ![ከፍተኛ ናቭባር](../../_static/images/menus/top_nav_explorer.png "ከፍተኛ ናቭባር")

source: Depending on whether a child page allows for sub menu items or not the navbar dropdown will be displayed. Each menu item takes in a:
am: የሕፃን ገጽ ንዑስ ምናሌ ንጥሎችን ይፈቅዳል ወይም አይፈቅድ ላይ በመመስረት የአሳሽ አሞሌ ተቆልቋይ ይታያል። እያንዳንዱ የምናሌ ንጥል ነገር የሚከተሉትን ይይዛል፡-
ar: اعتمادًا على ما إذا كانت الصفحة الفرعية تسمح بعناصر القائمة الفرعية أم لا ، سيتم عرض القائمة المنسدلة لشريط التنقل. يأخذ كل عنصر من عناصر القائمة ما يلي:

source: link to an internal page / link to a custom URL
am: ወደ የውስጥ ገጽ አገናኝ / ወደ ብጁ ዩአርኤል አገናኝ
ar: رابط إلى صفحة داخلية / رابط إلى عنوان URL مخصص

source: Option to append a value to the url
am: በዩአርኤል ላይ እሴትን ለመጨመር አማራጭ
ar: خيار لإلحاق قيمة بعنوان url

source: The link display text
am: የአገናኝ ማሳያ ጽሑፍ
ar: نص عرض الارتباط

source: Handle (Use this field to optionally specify an additional value for each menu item, which you can then reference in custom menu templates.)
am: መያዣ (ለእያንዳንዱ ምናሌ ንጥል ነገር ተጨማሪ እሴትን በአማራጭነት ለመጥቀስ ይህንን መስክ ይጠቀሙ፣ ከዚያ በብጁ ምናሌ አብነቶች ውስጥ መጥቀስ ይችላሉ።)
ar: معالجة (استخدم هذا الحقل لتحديد قيمة إضافية اختياريًا لكل عنصر قائمة ، والتي يمكنك الرجوع إليها بعد ذلك في قوالب القائمة المخصصة.)

source: Submenu visibility option
am: የንዑስ ምናሌ ታይነት አማራጭ
ar: خيار رؤية القائمة الفرعية

source: ![Manage Menu Items](../../_static/images/menus/manage_menu_items.png "Manage Menu Items")
am: ![ምናሌ ንጥሎችን አቀናብር](../../_static/images/menus/menu_items.png "ምናሌ ንጥሎችን አስተዳድር")
ar: ! [إدارة عناصر القائمة] (../../_ static / images / menus / management_menu_items.png "إدارة عناصر القائمة")

source: Manage Menu Items
am: የምናሌ እቃዎችን ያስተዳድሩ
ar: إدارة عناصر القائمة

source: Managing Footer Navigation
am: የግርጌ ዳሰሳን ማስተዳደር
ar: إدارة التنقل في التذييل

source: ![Footer](../../_static/images/menus/footer_preview.png "Footer")
am: ![ግርጌ] (.../../_static/images/menus/footer_preview.png "ግርጌ")
ar: ! [التذييل] (../../_ static / images / menus / footer_preview.png "Footer")

source: Footer
am: ግርጌ
ar: تذييل

source: Similarly, to configure the footer, select settings on the left sidebar and select flat menus instead.
am: በተመሳሳይ፣ ግርጌውን ለማዋቀር በግራ የጎን አሞሌ ላይ ቅንብሮችን ይምረጡ እና በምትኩ ጠፍጣፋ ሜኑዎችን ይምረጡ።
ar: وبالمثل ، لتكوين التذييل ، حدد الإعدادات على الشريط الجانبي الأيسر وحدد القوائم المسطحة بدلاً من ذلك.

source: ![Footer](../../_static/images/menus/footer_explorer.png "Footer")
am: ![ግርጌ] (.../../_static/images/menus/footer_explorer.png "ግርጌ")
ar: ! [التذييل] (../../_ static / images / menus / footer_explorer.png "Footer")

source: Edit footer menu and add menu items. You can group pages by giving them the same handler name. For example, weekly forecast and monthly forecasts can be grouped in 'Products' handler.
am: የግርጌ ምናሌን ያርትዑ እና የምናሌ ንጥሎችን ያክሉ። ተመሳሳይ ተቆጣጣሪ ስም በመስጠት ገጾችን መቧደን ትችላለህ። ለምሳሌ፣ ሳምንታዊ ትንበያ እና ወርሃዊ ትንበያዎች በ'ምርቶች' ተቆጣጣሪ ውስጥ ሊመደቡ ይችላሉ።
ar: تحرير قائمة التذييل وإضافة عناصر القائمة. يمكنك تجميع الصفحات من خلال إعطائها نفس اسم المعالج. على سبيل المثال ، يمكن تجميع التوقعات الأسبوعية والتنبؤات الشهرية في معالج "المنتجات".

source: ![Edit Footer](../../_static/images/menus/edit_footer.png "Edit Footer")
am: ![ግርጌ አርትዕ](../../_static/images/menus/edit_footer.png "ግርጌ አርትዕ")
ar: ! [تحرير التذييل] (../../_ static / images / menus / edit_footer.png "تعديل التذييل")

source: Edit Footer
am: ግርጌ አርትዕ
ar: تحرير التذييل

source: All settings can be found at the settings menu on the left side-bar. *Scroll down if settings menu is not visible*.
am: ሁሉም ቅንብሮች በግራ በኩል ባለው አሞሌ ላይ ባለው የቅንብሮች ምናሌ ውስጥ ይገኛሉ። * የቅንብሮች ሜኑ የማይታይ ከሆነ ወደ ታች ይሸብልሉ*።
ar: يمكن العثور على جميع الإعدادات في قائمة الإعدادات على الشريط الجانبي الأيسر. * قم بالتمرير لأسفل إذا كانت قائمة الإعدادات غير مرئية *.

source: ![Settings explorer](../../_static/images/settings/settings_explorer.png "Settings explorer")
am: ![ቅንጅቶች አሳሽ](.../../_static/images/settings/settings_explorer.png "Settings Explorer)"
ar: ! [مستكشف الإعدادات] (../../_ static / images / settings / settings_explorer.png "مستكشف الإعدادات")

source: Settings explorer
am: የቅንብሮች አሳሽ
ar: مستكشف الإعدادات

source: This section covers:
am: ይህ ክፍል የሚከተሉትን ያጠቃልላል
ar: يغطي هذا القسم:

source: Managing Organisation Settings
am: የድርጅት ቅንብሮችን ማስተዳደር
ar: إدارة إعدادات المؤسسة

source: Managing Themes
am: ገጽታዎችን ማስተዳደር
ar: إدارة المظاهر

source: Managing Integrations
am: ውህደቶችን ማስተዳደር
ar: إدارة عمليات التكامل

source: Managing Languages
am: ቋንቋዎችን ማስተዳደር
ar: إدارة اللغات
