Repository: ACMAD-Niamey/climweb
Catalog: docs/locales/*/LC_MESSAGES/_docs.po
Languages: am, ar

source: You can manage documents such as PDF files from the Documents interface. To access the Documents interface, click Documents in the Sidebar. This interface allows you to add documents to and remove documents from the Admin interface.
am: እንደ ፒዲኤፍ ፋይሎች ያሉ ሰነዶችን ከሰነዶች በይነገጽ ማስተዳደር ይችላሉ። የሰነዶች በይነገጽን ለመድረስ በጎን አሞሌው ውስጥ ሰነዶችን ጠቅ ያድርጉ። ይህ በይነገጽ ሰነዶችን ለመጨመር እና ሰነዶችን ከአስተዳዳሪ በይነገጽ ለማስወገድ ያስችልዎታል።
ar: يمكنك إدارة المستندات مثل ملفات PDF من واجهة المستندات. للوصول إلى واجهة المستندات ، انقر فوق المستندات في الشريط الجانبي. تتيح لك هذه الواجهة إضافة مستندات إلى واجهة المسؤول وإزالتها منها.

source: ![Manage Documents](../../_static/images/documents/manage_documents.png "Manage Documents")
am: ![ሰነዶችን አቀናብር](../../_static/images/documents/manage_documents.png "ሰነዶችን አቀናብር")
ar: ! [إدارة المستندات] (../../_ static / images / documents / management_documents.png "إدارة المستندات")

source: Manage Documents
am: ሰነዶችን ያስተዳድሩ
ar: إدارة المستندات

source: Add documents by clicking Add documents at the top right of the documents interface. Search for previously added documents by entering the title of the document in the search bar. The results automatically update as you type. You can also filter the results by Collection by selecting a collection from the Collection dropdown preceding the documents list.
am: በሰነዶች በይነገጽ በላይኛው ቀኝ ጥግ ላይ ሰነዶችን አክል የሚለውን ጠቅ በማድረግ ሰነዶችን ያክሉ። በፍለጋ አሞሌው ውስጥ የሰነዱን ርዕስ በማስገባት ቀደም ሲል የተጨመሩ ሰነዶችን ይፈልጉ. እርስዎ በሚተይቡበት ጊዜ ውጤቶቹ በራስ-ሰር ይዘምናሉ። እንዲሁም ከሰነዶች ዝርዝር በፊት ካለው የስብስብ ተቆልቋይ ውስጥ ስብስብን በመምረጥ ውጤቱን በስብስብ ማጣራት ይችላሉ።
ar: أضف المستندات بالنقر فوق إضافة مستندات في الجزء العلوي الأيمن من واجهة المستندات. ابحث عن المستندات المضافة مسبقًا عن طريق إدخال عنوان المستند في شريط البحث. يتم تحديث النتائج تلقائيًا أثناء الكتابة. يمكنك أيضًا تصفية النتائج حسب المجموعة بتحديد مجموعة من القائمة المنسدلة المجموعة التي تسبق قائمة المستندات.

source: ![Select Documents](../../_static/images/documents/select_documents.png "Select Documents")
am: ![ሰነዶችን ምረጥ](../../_static/images/documents/select_documents.png "ሰነዶችን ምረጥ")
ar: ! [حدد المستندات] (../../_ static / images / documents / select_documents.png "تحديد المستندات")

source: Select Documents
am: ሰነዶችን ይምረጡ
ar: حدد المستندات

source: Select multiple documents by clicking the checkbox on the left side of each document, then use the bulk actions bar at the bottom to perform an action on all selected documents.
am: በእያንዳንዱ ሰነድ በግራ በኩል ያለውን አመልካች ሳጥን ጠቅ በማድረግ ብዙ ሰነዶችን ይምረጡ እና በሁሉም የተመረጡ ሰነዶች ላይ አንድ እርምጃ ለመስራት ከታች ያለውን የጅምላ ድርጊቶችን ይጠቀሙ።
ar: حدد مستندات متعددة بالنقر فوق مربع الاختيار الموجود على الجانب الأيسر من كل مستند ، ثم استخدم شريط الإجراءات المجمعة في الجزء السفلي لتنفيذ إجراء على جميع المستندات المحددة.

source: If you want to edit a document, click the title of the document. Doing this takes you to the edit screen.
am: ሰነድ ማረም ከፈለጉ የሰነዱን ርዕስ ጠቅ ያድርጉ። ይህን ማድረግ ወደ አርትዕ ማያ ገጽ ይወስደዎታል.
ar: إذا كنت تريد تحرير مستند ، فانقر فوق عنوان المستند. القيام بذلك يأخذك إلى شاشة التحرير.

source: ![Edit Documents](../../_static/images/documents/edit_document.png "Edit Documents")
am: ![ሰነዶችን አርትዕ](../../_static/images/documents/edit_document.png "ሰነዶችን አርትዕ")
ar: ! [تحرير المستندات] (../../_ static / images / documents / edit_document.png "تحرير المستندات")

source: Edit Documents
am: ሰነዶችን ያርትዑ
ar: تحرير المستندات

source: When editing a document, you can replace the file associated with that document record. This means you can update documents without having to update the pages they're on. Changing the file changes it on all pages that use the document. You can also change the collection of the document by clicking on the Collection dropdown on the edit page and selecting a new collection of your choice. Add or remove tags using the Tags field on the edit screen. Once you are done editing a document, save your edits by clicking Save at the bottom of the edit screen.
am: ሰነድ ሲያርትዑ ከዚያ ሰነድ መዝገብ ጋር የተያያዘውን ፋይል መተካት ይችላሉ። ይህ ማለት እነሱ ያሉባቸውን ገጾች ማዘመን ሳያስፈልግ ሰነዶችን ማዘመን ይችላሉ። ፋይሉን መቀየር ሰነዱን በሚጠቀሙ ሁሉም ገጾች ላይ ይለውጠዋል. በአርትዖት ገጹ ላይ ያለውን የስብስብ ተቆልቋይ ላይ ጠቅ በማድረግ እና የመረጡትን አዲስ ስብስብ በመምረጥ የሰነዱን ስብስብ መቀየር ይችላሉ። በአርትዖት ስክሪኑ ላይ ያለውን የመለያ መስኩን በመጠቀም መለያዎችን ያክሉ ወይም ያስወግዱ። አንድ ሰነድ አርትዖት እንደጨረሱ፣ በአርትዖት ስክሪኑ ግርጌ ላይ ያለውን አስቀምጥ የሚለውን ጠቅ በማድረግ አርትዖትዎን ያስቀምጡ።
ar: عند تحرير مستند ، يمكنك استبدال الملف المرتبط بسجل المستند هذا. هذا يعني أنه يمكنك تحديث المستندات دون الحاجة إلى تحديث الصفحات الموجودة عليها. يؤدي تغيير الملف إلى تغييره في جميع الصفحات التي تستخدم المستند. يمكنك أيضًا تغيير مجموعة المستند بالنقر فوق القائمة المنسدلة "المجموعة" في صفحة التعديل وتحديد مجموعة جديدة من اختيارك. قم بإضافة أو إزالة العلامات باستخدام حقل العلامات في شاشة التعديل. بمجرد الانتهاء من تحرير المستند ، احفظ عمليات التحرير الخاصة بك عن طريق النقر فوق حفظ في الجزء السفلي من شاشة التحرير.

source: To completely delete a document and its record, select the document by clicking the checkbox at the left-hand side of the document record row in the Documents interface. Then click Delete from the action bar displayed at the bottom of the Documents interface.
am: ሰነዱን እና መዝገቡን ሙሉ በሙሉ ለመሰረዝ በሰነዶች በይነገጽ ውስጥ ባለው የሰነድ መዝገብ ረድፍ በግራ በኩል ያለውን አመልካች ሳጥኑን ጠቅ በማድረግ ሰነዱን ይምረጡ። ከዚያ በሰነዶች በይነገጽ ግርጌ ላይ ከሚታየው የድርጊት አሞሌ ሰርዝን ጠቅ ያድርጉ።
ar: لحذف مستند وسجله بالكامل ، حدد المستند بالنقر فوق خانة الاختيار الموجودة على الجانب الأيسر من صف سجل المستند في واجهة المستندات. ثم انقر فوق حذف من شريط الإجراءات المعروض أسفل واجهة المستندات.

source: ![Delete Documents](../../_static/images/documents/delete_document.png "Delete Documents")
am: ![ሰነዶችን ሰርዝ](../../_static/images/documents/delete_document.png "ሰነዶችን ሰርዝ")
ar: ! [حذف المستندات] (../../_ static / images / documents / delete_document.png "حذف المستندات")

source: Delete Documents
am: ሰነዶችን ሰርዝ
ar: حذف المستندات

source: You can also delete a document and its record from the edit screen when editing a document by clicking Delete document at the bottom of the edit screen.
am: እንዲሁም ሰነዱን በሚያርትዑበት ጊዜ ከማስተካከያው ግርጌ ላይ ያለውን ሰነድ ሰርዝ የሚለውን ጠቅ በማድረግ ሰነዱን እና መዝገቡን ከኤዲት ስክሪኑ ላይ ማጥፋት ይችላሉ።
ar: يمكنك أيضًا حذف مستند وتسجيله من شاشة التحرير عند تحرير مستند بالنقر فوق حذف مستند أسفل شاشة التحرير.

source: Deleted documents cannot be recovered.
am: የተሰረዙ ሰነዶችን መልሶ ማግኘት አይቻልም.
ar: لا يمكن استرداد المستندات المحذوفة.

source: Forms
am: ቅጾች
ar: نماذج

source: Images
am: ምስሎች
ar: الصور

source: Add, edit, and remove images
am: ምስሎችን ያክሉ፣ ያርትዑ እና ያስወግዱ
ar: إضافة وتحرير وإزالة الصور

source: If you want to edit, add, or remove images from the Admin interface outside of the individual pages, you can do so from the Images interface. To access the Images interface, click Images in the Sidebar.
am: ከአስተዳዳሪ በይነገጽ ምስሎችን ከግለሰቦች ገጾች ውጭ ለማርትዕ ፣ ለማከል ወይም ለማስወገድ ከፈለጉ ከምስሎች በይነገጽ ማድረግ ይችላሉ። የምስሎች በይነገጽን ለመድረስ በጎን አሞሌው ውስጥ ምስሎችን ጠቅ ያድርጉ።
ar: إذا كنت تريد تحرير الصور أو إضافتها أو إزالتها من واجهة المسؤول خارج الصفحات الفردية ، فيمكنك القيام بذلك من واجهة الصور. للوصول إلى واجهة الصور ، انقر فوق الصور في الشريط الجانبي.

source: ![Manage Images](../../_static/images/icons_and_images/manage_images.png "Manage Images")
am: ![ምስሎችን አስተዳድር](../../_static/images/icons_and_images/manaage_images.png "ምስሎችን አስተዳድር")
ar: ! [إدارة الصور] (../../_ static / images / icons_and_images / management_images.png "إدارة الصور")

source: Manage Images
am: ምስሎችን ያስተዳድሩ
ar: إدارة الصور

source: It is possible to select multiple images from the Images interface at once. To do this, select the checkbox on the top left of each image block, then use the bulk actions bar at the bottom to perform an action on all selected images.
am: ከምስሎች በይነገጽ ብዙ ምስሎችን በአንድ ጊዜ መምረጥ ይቻላል. ይህንን ለማድረግ በእያንዳንዱ የምስሎች እገዳ ላይኛው ግራ ላይ ያለውን አመልካች ሳጥን ይምረጡ እና ከዚያ በሁሉም የተመረጡ ምስሎች ላይ አንድ እርምጃ ለመስራት ከታች ያለውን የጅምላ ድርጊቶችን ይጠቀሙ።
ar: من الممكن تحديد صور متعددة من واجهة الصور في وقت واحد. للقيام بذلك ، حدد خانة الاختيار في الجزء العلوي الأيسر من كل كتلة صورة ، ثم استخدم شريط الإجراءات المجمعة في الجزء السفلي لتنفيذ إجراء على جميع الصور المحددة.

source: ![Select Images](../../_static/images/icons_and_images/select_images.png "Select Images")
am: ![ምስሎችን ምረጥ](../../_static/images/icons_and_images/select_images.png "ምስሎችን ምረጥ")
ar: ! [اختر الصور] (../../_ static / images / icons_and_images / select_images.png "حدد الصور")

source: Select Images
am: ምስሎችን ይምረጡ
ar: حدد الصور

source: Also, the CMS allows you to edit the data associated with an image by clicking on the image to access its edit screen. Image data includes the title, the file, the collection associated with it, the associated tags, and the focal area.
am: እንዲሁም፣ ሲኤምኤስ የአርትዖት ስክሪን ለማግኘት ምስሉን ጠቅ በማድረግ ከምስል ጋር የተያያዘውን መረጃ እንዲያርትዑ ይፈቅድልዎታል። የምስል መረጃ ርዕስን፣ ፋይሉን፣ ከእሱ ጋር የተገናኘውን ስብስብ፣ ተያያዥ መለያዎችን እና የትኩረት ቦታን ያካትታል።
ar: كما يسمح لك نظام إدارة المحتوى (CMS) بتحرير البيانات المرتبطة بصورة من خلال النقر على الصورة للوصول إلى شاشة التحرير الخاصة بها. تتضمن بيانات الصورة العنوان والملف والمجموعة المرتبطة به والعلامات المرتبطة والمنطقة البؤرية.

source: Changing the image file when editing an image updates the image without updating the pages on which it appears.
am: ምስልን በሚያርትዑበት ጊዜ የምስሉን ፋይል መቀየር ምስሉን የታየባቸውን ገጾች ሳያዘምን ያዘምናል.
ar: يؤدي تغيير ملف الصورة عند تحرير الصورة إلى تحديث الصورة دون تحديث الصفحات التي تظهر عليها.

source: ![Edit Images](../../_static/images/icons_and_images/edit_image.png "Edit Images")
am: ![ምስሎችን አርትዕ](../../_static/images/icons_and_images/edit_image.png "ምስሎችን አርትዕ")
ar: ! [تحرير الصور] (../../_ static / images / icons_and_images / edit_image.png "تعديل الصور")

source: Edit Images
am: ምስሎችን ያርትዑ
ar: تحرير الصور

source: Changing the file will change it on all pages that use the image.
am: ፋይሉን መቀየር ምስሉን በሚጠቀሙ ሁሉም ገጾች ላይ ይለውጠዋል.
ar: سيؤدي تغيير الملف إلى تغييره في جميع الصفحات التي تستخدم الصورة.

source: Set the focal area of an image
am: የምስሉን የትኩረት ቦታ ያዘጋጁ
ar: عيّن المنطقة البؤرية للصورة

source: The Images interface allows you to set a focal area, which can affect how your image displays to visitors on the front end. If you crop your images in some way to make them fit into a specific shape, then the focal area defines the centre point from which you crop the images.
am: የምስሎች በይነገጹ የትኩረት ቦታ እንዲያዘጋጁ ይፈቅድልዎታል፣ ይህም ምስልዎ በፊት ለፊት በኩል ለጎብኚዎች እንዴት እንደሚታይ ላይ ተጽእኖ ሊያሳድር ይችላል። ምስሎችዎን ወደ አንድ የተወሰነ ቅርፅ እንዲመጥኑ ለማድረግ በሆነ መንገድ ከከረሙ፡ የትኩረት ቦታው ምስሎቹን የሚከርሙበትን መሃል ነጥብ ይገልፃል።
ar: تسمح لك واجهة الصور بتعيين منطقة بؤرية ، والتي يمكن أن تؤثر على كيفية عرض صورتك للزائرين في الواجهة الأمامية. إذا قمت بقص صورك بطريقة ما لجعلها تتناسب مع شكل معين ، فإن المنطقة البؤرية تحدد النقطة المركزية التي تقوم من خلالها بقص الصور.

source: You can set the focal area of an image by clicking the image to access its edit screen. Then drag a marquee around the most significant element of the image, and then click Save to save it. Once you set the focal area of an image and save it, you can see the most significant element of the image on the front end.
am: የአርትዖት ማያ ገጹን ለመድረስ ምስሉን ጠቅ በማድረግ የምስሉን የትኩረት ቦታ ማዘጋጀት ይችላሉ። ከዚያ በምስሉ በጣም አስፈላጊ በሆነው አካል ዙሪያ አንድ ምልክት ይጎትቱ እና ለማስቀመጥ አስቀምጥን ጠቅ ያድርጉ። አንዴ የምስሉን የትኩረት ቦታ ካዘጋጁ እና ካስቀመጡት በኋላ፣ የምስሉ በጣም አስፈላጊ የሆነውን የፊተኛው ጫፍ ላይ ማየት ይችላሉ።
ar: يمكنك تعيين المنطقة البؤرية للصورة بالنقر فوق الصورة للوصول إلى شاشة التحرير الخاصة بها. ثم اسحب إطار تحديد حول العنصر الأكثر أهمية في الصورة ، ثم انقر فوق حفظ لحفظه. بمجرد تعيين المنطقة البؤرية للصورة وحفظها ، يمكنك رؤية العنصر الأكثر أهمية في الصورة على الواجهة الأمامية.

source: To remove the focal area, click Remove focal area in the edit screen.
am: የትኩረት ቦታውን ለማስወገድ በአርትዖት ማያ ገጹ ላይ የትኩረት ቦታን አስወግድ የሚለውን ጠቅ ያድርጉ።
ar: لإزالة المنطقة البؤرية ، انقر فوق إزالة المنطقة البؤرية في شاشة التحرير.

source: Snippets
am: ቅንጥቦች
ar: المقتطفات

source: Using Snippets
am: ቁርጥራጮችን በመጠቀም
ar: استخدام القصاصات

source: Snippets allow you to create elements on a website once and reuse them in multiple places. You only have to change something in a snippet once, and the changes appear in all occurrences.
am: ቅንጥቦች በአንድ ድር ጣቢያ ላይ ክፍሎችን አንድ ጊዜ እንዲፈጥሩ እና በበርካታ ቦታዎች እንደገና እንዲጠቀሙባቸው ያስችሉዎታል። አንድ ነገር በቅንጭብ ውስጥ አንድ ጊዜ ብቻ መቀየር አለብህ፣ እና ለውጦቹ በሁሉም አጋጣሚዎች ይታያሉ።
ar: تتيح لك المقتطفات إنشاء عناصر على موقع ويب مرة واحدة وإعادة استخدامها في أماكن متعددة. ما عليك سوى تغيير شيء ما في المقتطف مرة واحدة ، وستظهر التغييرات في جميع التكرارات.

source: The use of snippets varies between websites. Wagtail developers use snippets for the following purposes:
am: የቅንጥብ አጠቃቀም በድር ጣቢያዎች መካከል ይለያያል። የWagtail ገንቢዎች ለሚከተሉት ዓላማዎች ቅንጣቢዎችን ይጠቀማሉ።
ar: يختلف استخدام المقتطفات بين مواقع الويب. يستخدم مطورو Wagtail المقتطفات للأغراض التالية:

source: For blog post authors. As a result, you can add them to multiple pages and manage them from one place. For adverts. This way, you can apply them site-wide or on individual pages. To manage links in a global area of the site. For example, in the footer. For calls to action, such as newsletter sign-up blocks, that may be consistent across many different pages.
am: ለብሎግ ልጥፍ ደራሲዎች። በውጤቱም, ወደ ብዙ ገፆች ማከል እና ከአንድ ቦታ ማስተዳደር ይችላሉ. ለማስታወቂያዎች። በዚህ መንገድ, በጣቢያ-ሰፊ ወይም በግለሰብ ገጾች ላይ ሊተገብሯቸው ይችላሉ. በአለምአቀፍ የገጹ አካባቢ አገናኞችን ለማስተዳደር። ለምሳሌ, በግርጌው ውስጥ. ለድርጊት ጥሪዎች፣ እንደ ጋዜጣ መመዝገቢያ ብሎኮች፣ በተለያዩ ገፆች ላይ ወጥነት ያለው ሊሆን ይችላል።
ar: لمؤلفي ما بعد المدونة. نتيجة لذلك ، يمكنك إضافتها إلى صفحات متعددة وإدارتها من مكان واحد. للإعلانات. بهذه الطريقة ، يمكنك تطبيقها على مستوى الموقع أو على صفحات فردية. لإدارة الروابط في منطقة عالمية من الموقع. على سبيل المثال ، في التذييل. بالنسبة إلى العبارات التي تحث المستخدم على اتخاذ إجراء ، مثل حظر الاشتراك في الرسائل الإخبارية ، قد يكون ذلك متسقًا عبر العديد من الصفحات المختلفة.

source: The Snippets Menu
am: የቅንጣቢዎች ምናሌ
ar: قائمة المقتطفات

source: You can access the snippets by clicking **Snippets** in the Sidebar. Clicking **Snippets** takes you to the Snippets interface. To add, edit, or delete a snippet, click the snippet type that interests you. Clicking the snippet type takes you to the edit screen, from which you can add, edit, or delete a snippet. Hovering over an individual snippet displays the options to edit or delete that snippet. To add a new snippet to the snippet type, click **Add (snippet type)**.
am: በጎን አሞሌው ውስጥ ** ቅንጥቦችን** ጠቅ በማድረግ ቅንጥቦቹን ማግኘት ይችላሉ። ** ቅንጥቦችን ጠቅ ማድረግ ወደ ቅንጣቢ በይነገጽ ይወስደዎታል። ቅንጣቢ ለማከል፣ ለማርትዕ ወይም ለመሰረዝ፣ እርስዎን የሚስብ ቅንጣቢ አይነትን ጠቅ ያድርጉ። የቅንጣቢውን አይነት ጠቅ ማድረግ ወደ ኤዲት ማያ ገጽ ይወስደዎታል፣ ከእሱም ቅንጣቢ ማከል፣ ማረም ወይም መሰረዝ ይችላሉ። በግለሰብ ቅንጣቢ ላይ ማንዣበብ ቅንጣቢውን ለማስተካከል ወይም ለመሰረዝ አማራጮችን ያሳያል። ወደ ቅንጣቢው አይነት አዲስ ቅንጣቢ ለመጨመር **አክል(የቅንጣቢ አይነት)** የሚለውን ጠቅ ያድርጉ።
ar: يمكنك الوصول إلى المقتطفات بالنقر فوق ** Snippets ** في الشريط الجانبي. يؤدي النقر على ** Snippets ** إلى نقلك إلى واجهة Snippets. لإضافة مقتطف أو تحريره أو حذفه ، انقر فوق نوع المقتطف الذي يثير اهتمامك. يؤدي النقر فوق نوع المقتطف إلى نقلك إلى شاشة التحرير ، والتي يمكنك من خلالها إضافة مقتطف أو تحريره أو حذفه. يؤدي التمرير فوق مقتطف فردي إلى عرض خيارات تحرير هذا المقتطف أو حذفه. لإضافة مقتطف جديد إلى نوع المقتطف ، انقر فوق ** إضافة (نوع المقتطف) **.

source: Snippet Explorer
am: ቅንጣቢ አሳሽ
ar: مستكشف المقتطفات

source: Editing a snippet changes it on all of the pages on which it appears. In the top-right corner of the Snippet edit screen, you can see a label saying how many times you have used the snippet. Clicking this label displays a listing of all of these pages.
am: ቅንጣቢ ማረም በሚታየው በሁሉም ገፆች ላይ ይለውጠዋል። በቅንጣቢ አርትዕ ማያ ገጽ ላይኛው ቀኝ ጥግ ላይ ቅንጣቢውን ስንት ጊዜ እንደተጠቀምክ የሚገልጽ መለያ ማየት ትችላለህ። ይህን መለያ ጠቅ ማድረግ የእነዚህን ሁሉ ገጾች ዝርዝር ያሳያል።
ar: يؤدي تحرير المقتطف إلى تغييره في جميع الصفحات التي يظهر عليها. في الزاوية العلوية اليمنى من شاشة تحرير Snippet ، يمكنك رؤية تسمية توضح عدد المرات التي استخدمت فيها المقتطف. يؤدي النقر فوق هذه التسمية إلى عرض قائمة بكل هذه الصفحات.

source: Add snippets while editing a page
am: ገጽን በሚያርትዑበት ጊዜ ቅንጥቦችን ያክሉ
ar: أضف مقتطفات أثناء تحرير الصفحة

source: Open the Snippets interface in a new tab while editing the page by pressing Ctrl+click in Windows or cmd+click in macOS. You can also open a new tab by right-clicking it and then selecting the Open in new tab option. Add the new snippet from this new tab as you normally would. Then return to your existing tab and reopen the Snippet chooser window by clicking Snippets from the Sidebar.
am: በዊንዶውስ ላይ Ctrl + ክሊክ ወይም cmd + ን በመጫን ገጹን በሚያርትዑበት ጊዜ የ Snippets በይነገጽን በአዲስ ትር ይክፈቱ። በቀኝ ጠቅ በማድረግ እና በአዲስ ትር ክፈት የሚለውን በመምረጥ አዲስ ትር መክፈት ይችላሉ። ከዚህ አዲስ ትር እንደተለመደው አዲሱን ቅንጣቢ ያክሉ። ከዚያ ወደ ነባሩ ትር ይመለሱ እና ቅንጣቢ መራጭ መስኮቱን ከጎን አሞሌው ላይ ያሉትን ቅንጣቢዎች ጠቅ በማድረግ እንደገና ይክፈቱት።
ar: افتح واجهة Snippets في علامة تبويب جديدة أثناء تحرير الصفحة بالضغط على Ctrl + النقر في Windows أو cmd + النقر في macOS. يمكنك أيضًا فتح علامة تبويب جديدة بالنقر بزر الماوس الأيمن عليها ثم تحديد الخيار فتح في علامة تبويب جديدة. أضف المقتطف الجديد من علامة التبويب الجديدة هذه كما تفعل عادةً. ثم ارجع إلى علامة التبويب الحالية وأعد فتح نافذة منتقي المقتطف من خلال النقر على مقتطفات من الشريط الجانبي.

source: Congratulation, you can now see your new snippet, even though you didn’t leave the edit page.
am: እንኳን ደስ አለህ፣ ምንም እንኳን የአርትዖት ገጹን ባትተውም አሁን አዲሱን ቅንጣቢህን ማየት ትችላለህ።
ar: تهانينا ، يمكنك الآن رؤية المقتطف الجديد ، على الرغم من أنك لم تغادر صفحة التعديل.

source: Even though this is possible, it is advisable to save your page as a draft as often as possible. This prevents you from accidentally exiting the edit page and losing your changes.
am: ምንም እንኳን ይህ የሚቻል ቢሆንም በተቻለ መጠን በተቻለ መጠን ገጽዎን እንደ ረቂቅ ማስቀመጥ ይመከራል. ይህ በድንገት ከአርትዖት ገጹ ለመውጣት እና ለውጦችዎን እንዳያጡ ይከለክላል።
ar: على الرغم من أن هذا ممكن ، فمن المستحسن حفظ صفحتك كمسودة قدر الإمكان. يمنعك هذا من الخروج عن طريق الخطأ من صفحة التحرير وفقدان تغييراتك.

source: Surveys
am: የዳሰሳ ጥናቶች
ar: الدراسات الاستقصائية

source: Using Surveys
am: የዳሰሳ ጥናቶችን በመጠቀም
ar: استخدام الاستطلاعات

source: Surveys allow you to create a dynamic survey forms, create/modify survey structure, display and analyse survey results and save as PDF Document. With the survey editor it is possible to define conditional logic and answer validation for form fields.
am: የዳሰሳ ጥናቶች ተለዋዋጭ የዳሰሳ ቅጾችን እንዲፈጥሩ፣ የዳሰሳ ጥናት መዋቅር እንዲፈጥሩ/እንዲያስተካክሉ፣ የዳሰሳ ጥናት ውጤቶችን እንዲያሳዩ እና እንዲተነትኑ እና እንደ ፒዲኤፍ ሰነድ እንዲያስቀምጡ ያስችሉዎታል። በዳሰሳ ጥናት አርታዒው ሁኔታዊ አመክንዮ መግለፅ እና ለቅጽ መስኮች ማረጋገጫ መልስ መስጠት ይቻላል ።
ar: تسمح لك الاستطلاعات بإنشاء نماذج استطلاع ديناميكية ، وإنشاء / تعديل هيكل الاستطلاع ، وعرض نتائج الاستطلاع وتحليلها وحفظها كمستند PDF. باستخدام محرر الاستطلاع ، من الممكن تحديد المنطق الشرطي والتحقق من صحة الإجابة لحقول النموذج.

source: The Survey editor can be accessed from the left side bar under surveys menu.
am: የዳሰሳ ጥናት አርታዒው በግራ በኩል ባለው የዳሰሳ ጥናት ምናሌ ስር ሊገኝ ይችላል።
ar: يمكن الوصول إلى محرر الاستطلاع من الشريط الجانبي الأيسر أسفل قائمة الاستطلاعات.

source: ![Survey Explorer](../../_static/images/surveys/survey_explorer.png "Survey Explorer")
am: ![የዳሰሳ አሳሽ](../../_static/images/surveys/survey_explorer.png "የዳሰሳ አሳሽ")
ar: ! [مستكشف الاستطلاع] (../../_ ثابت / صور / استطلاعات / Survey_explorer.png "Survey Explorer")

source: Survey Explorer
am: የዳሰሳ ጥናት አሳሽ
ar: مستكشف الاستطلاع

source: Create Surveys and Panel Types
am: የዳሰሳ ጥናቶችን እና የፓነል ዓይነቶችን ይፍጠሩ
ar: إنشاء الاستطلاعات وأنواع اللوحات

source: To create a survey, you will need to first add a **survey form page**. You can do this by clicking on the **Add survey from page** button at the top right corner of the of the page.
am: የዳሰሳ ጥናት ለመፍጠር መጀመሪያ **የዳሰሳ ጥናት ቅጽ ገጽ** ማከል ያስፈልግዎታል። በገጹ ላይኛው ቀኝ ጥግ ላይ ያለውን **ከገጽ ዳሰሳ አክል** የሚለውን ቁልፍ ጠቅ በማድረግ ይህንን ማድረግ ይችላሉ።
ar: لإنشاء استطلاع ، ستحتاج أولاً إلى إضافة ** صفحة نموذج الاستبيان **. يمكنك القيام بذلك عن طريق النقر فوق الزر ** إضافة استطلاع من الصفحة ** في الزاوية اليمنى العليا من الصفحة.

source: ![Add Survey](../../_static/images/surveys/add_survey_page.png "Add Survey")
am: ![የዳሰሳ ጥናት አክል](../../_static/images/surveys/add_survey_page.png "ዳሰሳ አክል")
ar: ! [إضافة استبيان] (../../_ static / images / survey / add_survey_page.png "إضافة استبيان")

source: Add Survey
am: የዳሰሳ ጥናት ያክሉ
ar: أضف الاستبيان

source: Select a parent page e.g 'Home' and continue to edit the page and supply a Page title. Publish this page. This page will render the form that will be created in the survey creator.
am: የወላጅ ገጽ ይምረጡ ለምሳሌ 'ቤት' እና ገጹን አርትዕ ማድረግ እና የገጽ ርዕስ ማቅረቡን ይቀጥሉ። ይህን ገጽ ያትሙ። ይህ ገጽ በዳሰሳ ጥናት ፈጣሪ ውስጥ የሚፈጠረውን ቅጽ ያቀርባል።
ar: حدد صفحة رئيسية ، على سبيل المثال "الصفحة الرئيسية" واستمر في تحرير الصفحة وتوفير عنوان الصفحة. انشر هذه الصفحة. ستعرض هذه الصفحة النموذج الذي سيتم إنشاؤه في منشئ الاستطلاع.

source: ![Survey Parent Page](../../_static/images/surveys/survey_parent.png "Survey Parent Page")
am: ![የወላጅ ዳሰሳ ጥናት](../../_static/images/surveys/survey_parent.png "የዳሰሳ የወላጅ ገጽ"
ar: ! [صفحة الاستبيان الرئيسية] (../../_ static / images / updates / survey_parent.png "صفحة الاستبيان الرئيسية")

source: Survey Parent Page
am: የዳሰሳ ጥናት የወላጅ ገጽ
ar: الصفحة الرئيسية للمسح

source: ![Survey Page](../../_static/images/surveys/survey_page.png "Survey Page")
am: ![የዳሰሳ ጥናት ገፅ](../../_static/images/የዳሰሳ ጥናት/የዳሰሳ ጥናት ገጽ.png "የዳሰሳ ጥናት ገጽ")
ar: ! [صفحة الاستبيان] (../../_ static / images / studies / survey_page.png "صفحة الاستبيان")

source: Survey Page
am: የዳሰሳ ጥናት ገጽ
ar: صفحة الاستطلاع

source: Navigate to the Survey creator to create form fields and their logic using the **Survey Creator** button. | ![Surveys](../../_static/images/surveys/surveys.png "Surveys")
am: **የዳሰሳ ፈጣሪ** አዝራርን በመጠቀም የቅጽ መስኮችን እና አመክንዮአቸውን ለመፍጠር ወደ የዳሰሳ ፈጣሪው ይሂዱ። | ![የዳሰሳ ጥናቶች](../../_static/images/የዳሰሳ ጥናቶች/የዳሰሳ ጥናቶች.png "የዳሰሳ ጥናቶች")
ar: انتقل إلى منشئ الاستطلاع لإنشاء حقول النموذج ومنطقها باستخدام زر ** Survey Creator **. | ! [استطلاعات] (../../_ static / images / updates / updates.png "Surveys")

source: The Survey Creator
am: የዳሰሳ ጥናት ፈጣሪ
ar: منشئ الاستطلاع

source: This section describes how to perfom basic tasks in the Survey Creator. There are currently two tabs in the creator i.e Designer and Preview tab.
am: ይህ ክፍል በዳሰሳ ፈጣሪ ውስጥ መሰረታዊ ተግባራትን እንዴት ማከናወን እንደሚቻል ይገልጻል። በአሁኑ ጊዜ በፈጣሪ ውስጥ ሁለት ትሮች አሉ ማለትም ዲዛይነር እና ቅድመ እይታ ትር።
ar: يصف هذا القسم كيفية أداء المهام الأساسية في منشئ الاستبيان. توجد حاليًا علامتا تبويب في المنشئ ، مثل علامة التبويب المصمم والمعاينة.

source: ![Survey Creator](../../_static/images/surveys/survey_creator.png "Survey Creator")
am: ![የዳሰሳ ጥናት ፈጣሪ](../../_static/images/የዳሰሳ ጥናት/የዳሰሳ ጥናት ፈጣሪ.png "የዳሰሳ ፈጣሪ")
ar: ! [أداة إنشاء الاستبيان] (../../_ static / images / updates / survey_creator.png "Survey Creator")

source: Survey Creator
am: የዳሰሳ ጥናት ፈጣሪ
ar: منشئ الاستطلاع

source: Designer Tab
am: ንድፍ አውጪ ትር
ar: علامة تبويب المصمم

source: By using the Designer tab, you have the ability to customize your survey. You can move questions and panels from the **Toolbox** onto the **Design Surface** through drag and drop, and modify the question, panel, and survey settings using the **Property Grid**.
am: የዲዛይነር ትርን በመጠቀም የዳሰሳ ጥናትዎን የማበጀት ችሎታ አለዎት። ጥያቄዎችን እና ፓነሎችን ከ **የመሳሪያ ሳጥኑ** ወደ **ንድፍ ወለል** በመጎተት እና በማውረድ የጥያቄውን፣ ፓነሉን እና የዳሰሳውን መቼት በ **ንብረት ፍርግርግ** ያሻሽሉ።
ar: باستخدام علامة التبويب المصمم ، يمكنك تخصيص الاستطلاع الخاص بك. يمكنك نقل الأسئلة واللوحات من ** Toolbox ** إلى ** Design Surface ** من خلال السحب والإفلات ، وتعديل إعدادات السؤال واللوحة والاستطلاع باستخدام ** شبكة الخصائص **.

source: Question and Panel Types
am: የጥያቄ እና የፓነል ዓይነቶች
ar: أنواع الأسئلة واللوحة

source: Type
am: ዓይነት
ar: يكتب

source: Illustration
am: ምሳሌ
ar: توضيح

source: <div style="width:590px">Image</div>
am: <div style="width:590px">ምስል</div>
ar: <div style = "width: 590px"> صورة </ div>

source: **Single Input**
am: ** ነጠላ ግቤት ***
ar: ** مدخل واحد **

source: For open-ended questions that necessitate brief responses, employ the Single Input type where respondents can input their answers using a single-line text editor.
am: አጫጭር ምላሾችን ለሚፈልጉ ክፍት ክፍት ጥያቄዎች ምላሽ ሰጪዎች ባለአንድ መስመር የጽሑፍ አርታኢን በመጠቀም መልሳቸውን ማስገባት የሚችሉበትን ነጠላ የግቤት አይነት ይጠቀሙ።
ar: بالنسبة للأسئلة المفتوحة التي تتطلب إجابات موجزة ، استخدم نوع الإدخال الفردي حيث يمكن للمستجيبين إدخال إجاباتهم باستخدام محرر نص أحادي السطر.
