Repository: ACMAD-Niamey/climweb
Catalog: docs/locales/*/LC_MESSAGES/_docs.po
Languages: am, ar

source: **8. Is WMO RAF managing or handing over completely?**
am: **8. WMO RAF ሙሉ በሙሉ እያስተዳደረ ነው ወይስ እያስረከበ ነው?**
ar: ** 8. هل يقوم المجال الجوي الإقليمي التابع للمنظمة (WMO) بالإدارة أو التسليم بالكامل؟ **

source: The **NMHSs independently manage all components of the CMS in a decentralized manner** at the departmental level. The CMS includes an administrative role (superuser) that possesses complete privileges to access all components of the system. Further information regarding users and roles can be found at (https://github.com/wmo-raf/nmhs-cms/wiki/Manage-Users-and-Roles). It is important to note that WMO RAF does not have involvement in managing the CMS, as its administration and control lie solely with the NMHSs. While WMO RAF does not directly manage the CMS, it does offer valuable support to NMHSs by **providing training and guidance** on the proper management of the CMS. WMO's role is to assist NMHSs in acquiring the necessary knowledge and skills to effectively handle and maintain the CMS. This training and guidance aim to empower NMHSs in utilizing the CMS to its full potential and ensuring optimal performance and functionality.
am: **NMHSs ሁሉንም የሲኤምኤስ አካላት ባልተማከለ መልኩ በመምሪያ ደረጃ ያስተዳድራሉ:: ሲኤምኤስ ሁሉንም የስርዓቱን ክፍሎች የመድረስ ሙሉ መብቶችን የያዘ አስተዳደራዊ ሚና (ሱፐር ተጠቃሚ)ን ያካትታል። ተጠቃሚዎችን እና ሚናዎችን በተመለከተ ተጨማሪ መረጃ በ (https://github.com/wmo-raf/nmhs-cms/wiki/Manage-Users-and-Roles) ላይ ይገኛል። የ WMO RAF አስተዳደር እና ቁጥጥር ከኤንኤምኤችኤስ ጋር ብቻ ስለሚውል፣ ሲኤምኤስን በማስተዳደር ላይ ምንም ተሳትፎ እንደሌለው ልብ ማለት ያስፈልጋል። WMO RAF CMS ን በቀጥታ የማያስተዳድር ቢሆንም፣ የCMS ትክክለኛ አስተዳደርን በተመለከተ ስልጠና እና መመሪያ በመስጠት ለኤንኤምኤችኤስዎች ጠቃሚ ድጋፍ ይሰጣል። የWMO ሚና NMHSs CMS ን በብቃት ለመያዝ እና ለማቆየት አስፈላጊውን እውቀት እና ክህሎት እንዲያገኙ መርዳት ነው። ይህ ስልጠና እና መመሪያ ኤንኤምኤችኤስኤስ ሲኤምኤስን በሙሉ አቅሙ ለመጠቀም እና ጥሩ አፈጻጸምን እና ተግባራዊነትን ለማረጋገጥ ለማበረታታት ነው።
ar: تدير ** المرافق الوطنية للأرصاد الجوية والهيدرولوجيا (NMHSs) جميع مكونات نظام إدارة المحتوى (CMS) بطريقة لامركزية ** على مستوى الإدارات. يتضمن نظام إدارة المحتوى دورًا إداريًا (مستخدم متميز) يمتلك امتيازات كاملة للوصول إلى جميع مكونات النظام. يمكن العثور على مزيد من المعلومات المتعلقة بالمستخدمين والأدوار على (https://github.com/wmo-raf/nmhs-cms/wiki/Manage-Users-and-Roles). ومن المهم أن نلاحظ أن المجال الجوي الإقليمي التابع للمنظمة (WMO) لا يشارك في إدارة CMS ، حيث إن إدارته ومراقبته تقع فقط على عاتق المرافق NMHSs. في حين أن إطار المكتب الإقليمي التابع للمنظمة (WMO) لا يدير بشكل مباشر نظام إدارة المحتوى (CMS) ، فإنه يقدم دعمًا قيمًا للمرافق NMHSs من خلال ** توفير التدريب والتوجيه ** بشأن الإدارة السليمة لنظام إدارة المحتوى (CMS). يتمثل دور المنظمة (WMO) في مساعدة المرافق NMHSs في اكتساب المعارف والمهارات اللازمة للتعامل الفعال مع نظام إدارة المحتوى (CMS) وصيانته. يهدف هذا التدريب والتوجيه إلى تمكين المرافق NMHSs من استخدام نظام إدارة المحتوى بكامل إمكاناته وضمان الأداء والوظيفة الأمثل.

source: **9. Training and capacity building: how will it be done?**
am: **9. የስልጠና እና የአቅም ግንባታ፡ እንዴት ይደረጋል?**
ar: ** 9. التدريب وبناء القدرات: كيف يتم ذلك؟ **

source: WMO RAF will conduct training sessions for the CMS, which can be arranged in **either face-to-face or online formats**. Comprehensive **training materials**, including user guides (https://github.com/wmo-raf/nmhs-cms/wiki) and developer guides (https://github.com/wmo-raf/nmhs-cms), are also available. The training sessions will be specifically targeted towards designated **departmental focal points **responsible for each component of the CMS. This approach ensures that the training is tailored to meet the specific needs and roles within the NMHS, enabling efficient knowledge transfer and effective utilization of the CMS.
am: WMO RAF ለሲኤምኤስ የስልጠና ክፍለ ጊዜዎችን ያካሂዳል፣ ይህም በ ** ፊት ለፊት ወይም በመስመር ላይ ቅርፀቶች ሊደረደር ይችላል። አጠቃላይ **የሥልጠና ቁሶች**፣ የተጠቃሚ መመሪያዎችን (https://github.com/wmo-raf/nmhs-cms/wiki) እና የገንቢ መመሪያዎችን (https://github.com/wmo-raf/nmhs-cms) ጨምሮ , እንዲሁም ይገኛሉ. የስልጠና ክፍለ ጊዜዎቹ በተለይ ወደተመደቡት **የመምሪያው የትኩረት ነጥቦች **ለእያንዳንዱ የCMS አካል ተጠያቂ ይሆናሉ። ይህ አካሄድ ስልጠናው በNMHS ውስጥ ያሉ ልዩ ልዩ ፍላጎቶችን እና ሚናዎችን ለማሟላት የተዘጋጀ መሆኑን ያረጋግጣል፣ ቀልጣፋ የእውቀት ሽግግር እና የሲኤምኤስን ውጤታማ አጠቃቀም።
ar: سيجري المكتب الإقليمي للأرصاد الجوية التابع للمنظمة (WMO) دورات تدريبية لنظام إدارة المحتوى ، والتي يمكن ترتيبها ** إما وجهًا لوجه أو على الإنترنت **. ** مواد تدريبية شاملة ** ، بما في ذلك أدلة المستخدم (https://github.com/wmo-raf/nmhs-cms/wiki) وأدلة المطور (https://github.com/wmo-raf/nmhs-cms) ، متوفرة أيضًا. وستستهدف الدورات التدريبية على وجه التحديد ** نقاط تنسيق الإدارات ** المعينة المسؤولة عن كل مكون من مكونات نظام إدارة المحتوى. يضمن هذا النهج أن التدريب مصمم لتلبية الاحتياجات والأدوار المحددة داخل المرفق الوطني (NMHS) ، مما يتيح نقل المعرفة بكفاءة والاستخدام الفعال لنظام إدارة المحتوى (CMS).

source: **10. What about NMHS that want to migrate their website? What provision for migration?**
am: **10. ድህረ ገጻቸውን ማዛወር ስለሚፈልጉ ስለ NMHSስ? ለስደት ምን ዝግጅት ነው?**
ar: ** 10. ماذا عن NMHS التي ترغب في ترحيل موقعها على الويب؟ ما الحكم للهجرة؟ **

source: The migration process will commence by initially **identifying the current content of the pages, as well as identifying additional pages that may be relevant and determining any obsolete content**. Moreover, recommendations will be provided regarding optimal practices pertaining to wording, images, colors, and other related aspects. The manual migration of each page will be conducted in collaboration with departmental focal points to ensure efficient coordination.
am: የፍልሰት ሂደቱ የሚጀምረው **የገጾቹን ወቅታዊ ይዘት በመለየት እና እንዲሁም ተዛማጅ ሊሆኑ የሚችሉ ተጨማሪ ገጾችን በመለየት እና ማንኛውንም ጊዜ ያለፈበት ይዘት በመወሰን** ነው። ከዚህም በላይ ከቃላት አወጣጥ፣ ምስሎች፣ ቀለሞች እና ሌሎች ተዛማጅ ገጽታዎች ጋር በተያያዙ ጥሩ ልምዶች ላይ ምክሮች ይሰጣሉ። ቀልጣፋ ቅንጅትን ለማረጋገጥ የእያንዳንዱ ገጽ በእጅ የሚደረግ ሽግግር ከመምሪያው የትኩረት ነጥቦች ጋር በመተባበር ይከናወናል።
ar: ستبدأ عملية الترحيل مبدئيًا من خلال ** تحديد المحتوى الحالي للصفحات ، بالإضافة إلى تحديد الصفحات الإضافية التي قد تكون ذات صلة وتحديد أي محتوى قديم **. علاوة على ذلك ، سيتم تقديم توصيات بشأن الممارسات المثلى المتعلقة بالصياغة والصور والألوان والجوانب الأخرى ذات الصلة. سيتم إجراء الترحيل اليدوي لكل صفحة بالتعاون مع نقاط الاتصال في الإدارات لضمان التنسيق الفعال.

source: **11. What support will be offered by WMO RAF?**
am: **11. በ WMO RAF ምን ድጋፍ ይሰጣል?**
ar: ** 11. ما هو الدعم الذي سيقدمه WMO RAF؟ **

source: Support on the operationalization of the CMS cuts across:
am: በሲኤምኤስ ሥራ ላይ የሚውል ድጋፍ በሚከተሉት ጉዳዮች ላይ
ar: يشمل دعم تفعيل نظام إدارة المحتوى:

source: Assessing Quality and interactivity of existing NMHS website
am: ያለውን የNMHS ድህረ ገጽ ጥራት እና መስተጋብር መገምገም
ar: تقييم جودة وتفاعل موقع NMHS الموجود على الويب

source: Approach and present the CMS to the NMHS. Integrate suggested feedback
am: CMS ን ለኤንኤምኤችኤስ አቅርብ እና አቅርብ። የተጠቆመ ግብረመልስን ያዋህዱ
ar: نهج وتقديم CMS إلى المرافق NMHS. دمج الملاحظات المقترحة

source: Identify departmental focal points for CMS coordination including overall CMS administrator
am: አጠቃላይ የሲኤምኤስ አስተዳዳሪን ጨምሮ ለሲኤምኤስ ማስተባበር የመምሪያ የትኩረት ነጥቦችን ይለዩ
ar: تحديد نقاط الاتصال في الإدارات لتنسيق CMS بما في ذلك مسؤول CMS العام

source: Installation and setup of CMS in-premise servers/cloud servers
am: የCMS ውስጠ-ቤት አገልጋዮች/የደመና አገልጋዮችን መጫን እና ማዋቀር
ar: تثبيت وإعداد خوادم / خوادم سحابية داخلية لنظام إدارة المحتوى

source: Provision one-on-one training and capacity building to departmental focal points on configuration and customization of the CMS and Website
am: በሲኤምኤስ እና ድህረ-ገጽ ውቅር እና ማበጀት ላይ ለመምሪያው የትኩረት ነጥቦች የአንድ ለአንድ ስልጠና እና የአቅም ግንባታ መስጠት።
ar: توفير التدريب الفردي وبناء القدرات لنقاط الاتصال في الإدارات بشأن تكوين وتخصيص نظام إدارة المحتوى والموقع الإلكتروني

source: Provision of learning materials, documentations, and guides of the CMS
am: የCMS የትምህርት ቁሳቁሶችን፣ ሰነዶችን እና መመሪያዎችን ማቅረብ
ar: توفير المواد التعليمية والوثائق والأدلة الخاصة بنظام إدارة المحتوى

source: Follow-up support in troubleshooting and resolving technical bugs
am: ቴክኒካል ሳንካዎችን በመፍታት እና በመፍታት ላይ የክትትል ድጋፍ
ar: متابعة الدعم في استكشاف الأخطاء وإصلاحها وحل الأخطاء التقنية

source: This also includes the implementation of CAP Alerts, Georeferenced data visualization, email marketing, events, surveys, and user analytics integration.
am: ይህ የCAP ማንቂያዎችን፣ የጂኦሬፈርሰንት ዳታ ምስላዊነትን፣ የኢሜል ግብይትን፣ ዝግጅቶችን፣ የዳሰሳ ጥናቶችን እና የተጠቃሚ ትንታኔዎችን መቀላቀልንም ያካትታል።
ar: ويشمل ذلك أيضًا تنفيذ تنبيهات CAP ، وتصور البيانات ذات المرجعية الجغرافية ، والتسويق عبر البريد الإلكتروني ، والأحداث ، والاستطلاعات ، وتكامل تحليلات المستخدم.

source: **12. How does the CMS work in low internet connectivity**
am: **12. ዝቅተኛ የኢንተርኔት ግንኙነት ሲኤምኤስ እንዴት እንደሚሰራ**
ar: ** 12. كيف يعمل نظام إدارة المحتوى في حالة ضعف اتصال الإنترنت **

source: The CMS is optimized for low bandwidth scenarios. This involves the minimisation of the use of large images, videos or heavy media files that might consume a significant amount of bandwidth. The CMS also supports **caching mechanisms** that can help reduce the load on the server and improve the website’s performance. By enabling caching, static content can be stored on the user's device, reducing the need for repeated downloads, and enhancing the experience on low bandwidth connections.
am: CMS ለዝቅተኛ የመተላለፊያ ይዘት ሁኔታዎች የተመቻቸ ነው። ይህ ከፍተኛ መጠን ያለው የመተላለፊያ ይዘት ሊፈጁ የሚችሉ ትልልቅ ምስሎችን፣ ቪዲዮዎችን ወይም ከባድ የሚዲያ ፋይሎችን አጠቃቀም መቀነስን ያካትታል። ሲኤምኤስ በአገልጋዩ ላይ ያለውን ጫና ለመቀነስ እና የድር ጣቢያውን አፈጻጸም ለማሻሻል የሚረዱ ** የመሸጎጫ ዘዴዎችን ይደግፋል። መሸጎጫ በማንቃት የማይለዋወጥ ይዘት በተጠቃሚው መሳሪያ ላይ ሊከማች፣ ተደጋጋሚ ማውረዶችን አስፈላጊነት በመቀነስ እና ዝቅተኛ የመተላለፊያ ይዘት ግንኙነቶችን ልምድ ያሳድጋል።
ar: تم تحسين CMS لسيناريوهات النطاق الترددي المنخفض. يتضمن ذلك تقليل استخدام الصور الكبيرة أو مقاطع الفيديو أو ملفات الوسائط الثقيلة التي قد تستهلك قدرًا كبيرًا من النطاق الترددي. يدعم نظام إدارة المحتوى أيضًا ** آليات التخزين المؤقت ** التي يمكن أن تساعد في تقليل الحمل على الخادم وتحسين أداء موقع الويب. من خلال تمكين التخزين المؤقت ، يمكن تخزين المحتوى الثابت على جهاز المستخدم ، مما يقلل الحاجة إلى التنزيلات المتكررة ، ويعزز التجربة على اتصالات النطاق الترددي المنخفض.

source: **13. Geo-referenced data visualization: What data sources and formats are supported?**
am: **13. ጂኦ-የተጣቀሰ የውሂብ እይታ፡ ምን አይነት የመረጃ ምንጮች እና ቅርፀቶች ይደገፋሉ?**
ar: ** 13. تصور البيانات الجغرافية المرجعية: ما هي مصادر البيانات والتنسيقات المدعومة؟ **

source: An essential feature provided by the CMS is its capability to **facilitate interactive visualization of georeferenced data**. This includes the ability to upload and visualize gridded data in formats such as NetCDF and GeoTIFF, as well as vector data in the form of points and polygons. The CMS also supports the integration of CAP Alerts and enables the inclusion of data from external Web Map Service (WMS) sources for comprehensive data visualization.
am: በሲኤምኤስ የቀረበው አስፈላጊ ባህሪ ** የጂኦግራፊያዊ መረጃን በይነተገናኝ እይታን ማመቻቸት *** ነው። ይህ እንደ ኔትሲዲኤፍ እና ጂኦቲኤፍኤፍ ባሉ ቅርጸቶች እንዲሁም የቬክተር መረጃን በነጥብ እና በፖሊጎን መልክ የመስቀል እና የማሳየት ችሎታን ይጨምራል። ሲኤምኤስ የCAP ማንቂያዎችን ውህደት ይደግፋል እና ከውጪ የድር ካርታ አገልግሎት (WMS) ምንጮች መረጃን ለአጠቃላይ የመረጃ እይታ እንዲካተት ያስችላል።
ar: من الميزات الأساسية التي يوفرها نظام إدارة المحتوى قدرته على ** تسهيل التصور التفاعلي للبيانات التي تم تحديدها جغرافيًا **. يتضمن ذلك القدرة على تحميل وتصور البيانات الشبكية بتنسيقات مثل NetCDF و GeoTIFF ، بالإضافة إلى بيانات المتجه في شكل نقاط ومضلعات. يدعم نظام إدارة المحتوى أيضًا تكامل تنبيهات CAP ويتيح إدراج البيانات من مصادر خدمة خرائط الويب الخارجية (WMS) لتصور البيانات الشامل.

source: **14. Can they use the CAP editor alone?**
am: **14. የ CAP አርታዒን ብቻቸውን መጠቀም ይችላሉ?**
ar: ** 14. هل يمكنهم استخدام محرر CAP وحده؟ **

source: The CAP Editor has been developed to be flexible in its deployment options. It can be run independently as a **standalone application**, which is accessible at https://github.com/wmo-raf/cap-editor. Alternatively, it can be fully **integrated into the CMS**, providing seamless management of CAP Alerts within the CMS environment. More information about the integration and usage can be found at https://github.com/wmo-raf/nmhs-cms/wiki/Manage-CAP-Alerts.
am: የCAP አርታዒው በማሰማራት አማራጮች ውስጥ ተለዋዋጭ እንዲሆን ተዘጋጅቷል። በ https://github.com/wmo-raf/cap-editor ላይ የሚገኝ እንደ ** ራሱን የቻለ መተግበሪያ** ሆኖ ማሄድ ይችላል። በአማራጭ፣ በሲኤምኤስ አካባቢ ውስጥ የCAP ማንቂያዎችን እንከን የለሽ አስተዳደር በማቅረብ ሙሉ በሙሉ ** ወደ ሲኤምኤስ ሊዋሃድ ይችላል። ስለ ውህደቱ እና አጠቃቀሙ ተጨማሪ መረጃ በ https://github.com/wmo-raf/nmhs-cms/wiki/Manage-CAP-Alerts ላይ ይገኛል።
ar: تم تطوير محرر CAP ليكون مرنًا في خيارات النشر الخاصة به. يمكن تشغيله بشكل مستقل ** كتطبيق مستقل ** ، ويمكن الوصول إليه على https://github.com/wmo-raf/cap-editor. بدلاً من ذلك ، يمكن دمجه بالكامل ** في CMS ** ، مما يوفر إدارة سلسة لتنبيهات CAP داخل بيئة CMS. يمكن العثور على مزيد من المعلومات حول التكامل والاستخدام على https://github.com/wmo-raf/nmhs-cms/wiki/Manage-CAP-Alerts.

source: Introduction
am: መግቢያ
ar: مقدمة

source: ![CMS Kit](../_static/images/home/cms_package_kit.jpg "CMS Kit")
am: ![ሲኤምኤስ ኪት](../_static/images/home/cms_package_kit.jpg "CMS Kit)"

source: CMS Kit
am: ሲኤምኤስ ኪት
ar: مجموعة CMS

source: The **template Content Management System** is available for any NMHS wishing to upgrade its website. This initiative was developed as part of targeted support for African NMHSs in their digital transformation journey. The template was presented to technical experts from NMHSs during a [training in early warning communications](https://public.wmo.int/en/resources/meteoworld/building-capacity-africa-achieve-early-warnings-all).
am: **የአብነት ይዘት አስተዳደር ስርዓት** ለማንኛውም ኤንኤምኤችኤስ ድረ-ገጹን ማሻሻል ለሚፈልግ ይገኛል። ይህ ተነሳሽነት የተዘጋጀው ለአፍሪካ ኤንኤምኤችኤስዎች በዲጂታል የለውጥ ጉዟቸው የታለመ ድጋፍ አካል ነው። አብነቱ ከኤንኤምኤችኤስ ለመጡ ቴክኒካል ባለሙያዎች ቀርቧል [በቅድመ ማስጠንቀቂያ ግንኙነቶች ላይ ስልጠና](https://public.wmo.int/en/resources/meteoworld/building-capacity-africa-achieve-early-warnings-all)።
ar: يتوفر ** نظام إدارة المحتوى النموذجي ** لأي مرفق NMHS يرغب في ترقية موقعه على الويب. تم تطوير هذه المبادرة كجزء من الدعم الموجه للمرافق NMHSs الأفريقية في رحلة التحول الرقمي الخاصة بها. تم تقديم النموذج إلى الخبراء التقنيين من المرافق الوطنية للأرصاد الجوية والهيدرولوجيا (NMHSs) أثناء [تدريب على اتصالات الإنذار المبكر] (https://public.wmo.int/en/resources/meteoworld/building-capacity-africa-achieve-early-warnings-all).

source: Stepwise Approach
am: ደረጃ በደረጃ አቀራረብ
ar: نهج متدرج

source: This new template offers:
am: ይህ አዲስ አብነት የሚከተሉትን ያቀርባል፡-
ar: يقدم هذا النموذج الجديد:

source: a customisable and modern design
am: ሊበጅ የሚችል እና ዘመናዊ ንድፍ
ar: تصميم حديث وقابل للتخصيص

source: seamless marketing integrations
am: እንከን የለሽ የግብይት ውህደቶች
ar: تكاملات تسويقية سلسة

source: a user-friendly CAP editor
am: ለተጠቃሚ ምቹ የሆነ CAP አርታዒ
ar: محرر CAP سهل الاستخدام

source: advanced climate data visualization tools for any NMHS seeking to upgrade its website.
am: የላቁ የአየር ንብረት መረጃ ምስላዊ መሳሪያዎች ለማንኛውም ኤንኤምኤችኤስ የድር ጣቢያውን ለማሻሻል ለሚፈልግ።
ar: أدوات متطورة لتصور البيانات المناخية لأي مرفق NMHS يسعى لتحديث موقعه على شبكة الإنترنت.

source: It adopts **best practices in data visualization and hydro meteorological department and climate communications**. All components of the website are built on free and open-source standards allowing for collaboration and contribution.
am: በመረጃ እይታ እና በሃይድሮ ሜትሮሎጂ ክፍል እና በአየር ንብረት ግንኙነቶች ውስጥ ** ምርጥ ልምዶችን ይቀበላል። ሁሉም የድረ-ገጹ አካላት ለትብብር እና አስተዋፅዖ በሚፈቅዱ ነፃ እና ክፍት ምንጭ ደረጃዎች ላይ የተገነቡ ናቸው።
ar: تتبنى ** أفضل الممارسات في تصوير البيانات وقسم الأرصاد الجوية المائية والاتصالات المناخية **. جميع مكونات الموقع مبنية على معايير مجانية ومفتوحة المصدر تسمح بالتعاون والمساهمة.

source: The CAP editor is expected to **increase the adoption of the Common Alerting Protocol in Africa**, key to increasing the reach of alerts, and their connectivity to broadcast, web and mobile networks. Africa remains one of the world's most vulnerable regions to climate change and increasing extremes. Increasing the protection of the population through improved climate and early warning communications is crucial.
am: የCAP አርታዒው **የጋራ ማንቂያ ፕሮቶኮል በአፍሪካ ተቀባይነትን ይጨምራል** ይህም የማንቂያዎችን ተደራሽነት ለመጨመር እና ከብሮድካስት፣ ከድር እና ከሞባይል አውታረ መረቦች ጋር ያላቸውን ግንኙነት ይጨምራል። አፍሪካ ለአየር ንብረት ለውጥ እና ጽንፍ መጨመር በአለም ላይ በጣም ተጋላጭ ከሆኑ ክልሎች አንዷ ሆና ቀጥላለች። በተሻሻለ የአየር ንብረት እና የቅድመ ማስጠንቀቂያ ግንኙነቶች የህዝቡን ጥበቃ ማሳደግ ወሳኝ ነው።
ar: من المتوقع أن يزيد محرر CAP ** من اعتماد بروتوكول التنبيه المشترك في إفريقيا ** ، وهو المفتاح لزيادة مدى وصول التنبيهات وتوصيلها بالبث وشبكات الويب والهاتف المحمول. لا تزال أفريقيا واحدة من أكثر مناطق العالم عرضة لتغير المناخ والظواهر المتطرفة المتزايدة. إن زيادة حماية السكان من خلال تحسين المناخ واتصالات الإنذار المبكر أمر بالغ الأهمية.

source: Considerations during the design & development phase
am: በንድፍ እና በልማት ደረጃ ወቅት ግምት ውስጥ ይገባል
ar: اعتبارات خلال مرحلة التصميم والتطوير

source: During the design and development phase, fundamental factors were taken into consideration to ensure the delivery of a Content Management System that would improve the efficiency of management.
am: በንድፍ እና በልማት ምዕራፍ የአመራር ቅልጥፍናን የሚያሻሽል የይዘት አስተዳደር ስርዓት አቅርቦትን ለማረጋገጥ መሰረታዊ ነገሮች ግምት ውስጥ ገብተዋል።
ar: خلال مرحلة التصميم والتطوير ، تم أخذ العوامل الأساسية بعين الاعتبار لضمان تسليم نظام إدارة المحتوى الذي من شأنه تحسين كفاءة الإدارة.

source: ![CMS Features](../_static/images/home/features.jpg "CMS Features")
am: ![CMS ባህሪያት](../_static/images/home/features.jpg "የሲኤምኤስ ባህሪያት")
ar: ! [ميزات CMS] (../_ static / images / home / features.jpg "ميزات CMS")

source: CMS Features
am: የሲኤምኤስ ባህሪዎች
ar: ميزات CMS

source: It factored in:
am: በሚከተሉት ምክንያቶች ተጠቁሟል፡-
ar: أخذت في الاعتبار:

source: Well **defined content structure** and pages management,
am: በደንብ ** የተገለጸ የይዘት መዋቅር** እና የገጾች አስተዳደር፣
ar: حسنًا ** بنية المحتوى المحددة ** وإدارة الصفحات ،

source: **User-friendly interface** with a modern look and feel
am: ** ለተጠቃሚ ምቹ በይነገጽ *** ከዘመናዊ መልክ እና ስሜት ጋር
ar: ** واجهة سهلة الاستخدام ** بمظهر ومظهر عصريين

source: Great **user experience and ease** in locating content
am: ይዘትን ለማግኘት ታላቅ ** የተጠቃሚ ተሞክሮ እና ቀላልነት
ar: ** تجربة مستخدم رائعة ** وسهولة ** في تحديد موقع المحتوى

source: A **decentralized CMS architecture** was adopted to allow management of departmental sections by different user roles and allow for content moderation and publishing **workflows**. ![centralization](../_static/images/home/centralization.jpg "centralization")
am: የመምሪያ ክፍሎችን በተለያዩ የተጠቃሚ ሚናዎች ለማስተዳደር እና የይዘት ማሻሻያ እና ማተም ** የስራ ፍሰቶች *** ያልተማከለ የሲኤምኤስ አርክቴክቸር** ተቀባይነት አግኝቷል። ![ማማለል](../_static/images/home/centralization.jpg "ማእከላዊነት")
ar: تم اعتماد ** بنية CMS اللامركزية ** للسماح بإدارة أقسام الأقسام من خلال أدوار مستخدم مختلفة والسماح بالإشراف على المحتوى ونشر ** تدفقات العمل **. ! [المركزية] (../_ static / images / home / centralization.jpg "المركزية")

source: centralization
am: ማዕከላዊነት
ar: المركزية

source: Delivery and support
am: አቅርቦት እና ድጋፍ
ar: التسليم والدعم

source: For a smooth and efficient delivery of the CMS and customization of the website template to the NMHS, a step by step process will be adopted. The quality and interactivity of the website is first assessed followed by approaching and presenting the CMS and integrating feedback. Thereafter, willing/potential members for support are identified together with a focal point for coordination. The CMS is then installed and training on the configuration of CMS and customization of the website conducted. Additionally, learning materials, documentations and guides are provided alongside follow-up support in troubleshooting
am: ለስለስ ያለ እና ቀልጣፋ CMS ለማድረስ እና የድህረ ገጹን አብነት ለኤንኤምኤችኤስ ለማበጀት አንድ ደረጃ በደረጃ ሂደት ይወሰዳል። የድረ-ገጹን ጥራት እና መስተጋብር በመጀመሪያ ይገመገማል ከዚያም ወደ ሲኤምኤስ በመቅረብ እና በማቅረብ እና ግብረመልስን በማጣመር። ከዚያ በኋላ፣ ለድጋፍ ፈቃደኛ/ ሊሆኑ የሚችሉ አባላት ከትኩረት ነጥብ ጋር አብረው ተለይተዋል። ሲኤምኤስ ተጭኖ በሲኤምኤስ ውቅር እና በተካሄደው ድህረ ገጽ ማበጀት ላይ ስልጠና ይሰጣል። በተጨማሪም፣ የመማርያ ቁሳቁሶች፣ ሰነዶች እና መመሪያዎች በመላ መፈለጊያ ውስጥ ከክትትል ድጋፍ ጋር ተሰጥተዋል።
ar: من أجل تسليم سلس وفعال لنظام إدارة المحتوى (CMS) وتكييف قالب موقع الويب وفقًا للمرفق الوطني للأرصاد الجوية والهيدرولوجيا (NMHS) ، سيتم اعتماد عملية خطوة بخطوة. يتم أولاً تقييم جودة موقع الويب وتفاعله متبوعًا بالاقتراب من نظام إدارة المحتوى وتقديمه ودمج التعليقات. بعد ذلك ، يتم تحديد الأعضاء الراغبين / المحتملين للحصول على الدعم جنبًا إلى جنب مع نقطة محورية للتنسيق. يتم بعد ذلك تثبيت نظام إدارة المحتوى وإجراء التدريب على تكوين نظام إدارة المحتوى وتخصيص موقع الويب. بالإضافة إلى ذلك ، يتم توفير المواد التعليمية والوثائق والأدلة جنبًا إلى جنب مع دعم المتابعة في استكشاف الأخطاء وإصلاحها

source: ![CMS Support](../_static/images/home/support.jpg "CMS Support")
am: ![CMS ድጋፍ](../_static/images/home/support.jpg "የሲኤምኤስ ድጋፍ")
ar: ! [دعم CMS] (../_ static / images / home / support.jpg "CMS Support")

source: CMS Support
am: የሲኤምኤስ ድጋፍ
ar: دعم CMS

source: Core Components and Integrations
am: ዋና ክፍሎች እና ውህደቶች
ar: المكونات الأساسية والتكاملات

source: **User friendly website Content Management System**
am: ** ለተጠቃሚ ምቹ ድር ጣቢያ የይዘት አስተዳደር ስርዓት ***
ar: ** نظام إدارة محتوى موقع الويب سهل الاستخدام **

source: Modern look and design, mobile friendly.
am: ዘመናዊ መልክ እና ዲዛይን, የሞባይል ተስማሚ.
ar: شكل وتصميم عصري ، سهل الاستخدام للجوّال.

source: Adopts best practices and designs benchmarked for weather and climate information dissemination for NMHSs in Africa.
am: በአፍሪካ ውስጥ ለኤንኤምኤችኤስዎች የአየር ሁኔታ እና የአየር ንብረት መረጃ ስርጭት ምርጥ ተሞክሮዎችን እና ንድፎችን ይቀበላል።
ar: يعتمد أفضل الممارسات والتصاميم المعيارية لنشر معلومات الطقس والمناخ للمرافق الوطنية للأرصاد الجوية والهيدرولوجيا (NMHSs) في إفريقيا.

source: Easy to use and customise without technical skills.
am: ያለ ቴክኒካዊ ችሎታ ለመጠቀም እና ለማበጀት ቀላል።
ar: سهل الاستخدام والتخصيص بدون مهارات فنية.

source: Decentralised content management. Different staff can be assigned and manage different sections of the website.
am: ያልተማከለ የይዘት አስተዳደር። የተለያዩ ሰራተኞች ሊመደቡ እና የተለያዩ የድረ-ገፁን ክፍሎች ማስተዳደር ይችላሉ.
ar: إدارة المحتوى اللامركزية. يمكن تعيين موظفين مختلفين وإدارة أقسام مختلفة من الموقع.

source: Defined content publishing workflows. Editors and moderators can be defined for every section of the website.
am: የተገለጸ የይዘት ማተም የስራ ፍሰቶች። አዘጋጆች እና አወያዮች ለእያንዳንዱ የድረ-ገጽ ክፍል ሊገለጹ ይችላሉ።
ar: تعريف سير عمل نشر المحتوى. يمكن تحديد المحررين والمنسقين لكل قسم من أقسام الموقع.

source: Embedding Multimedia Content - Youtube etc.
am: የመልቲሚዲያ ይዘትን መክተት - Youtube ወዘተ
ar: تضمين محتوى الوسائط المتعددة - Youtube إلخ.

source: **Cap Alerts Publishing**
am: **የካፒታል ማንቂያዎች ማተም**
ar: ** كاب تنبيهات النشر **

source: Modern Cap Editor with simple user friendly and mobile friendly CAP alert creation and management.
am: ዘመናዊ ካፕ አርታዒ ከቀላል ተጠቃሚ እና የሞባይል ተስማሚ CAP ማንቂያ ፈጠራ እና አስተዳደር ጋር።
ar: Modern Cap Editor مع إنشاء وإدارة تنبيه CAP سهل الاستخدام وسهل الاستخدام للهاتف المحمول.

source: Moderated Publishing Workflow from CAP composer to approver, including commenting and email notification support.
am: የአስተያየት እና የኢሜይል ማሳወቂያ ድጋፍን ጨምሮ ከካፕ አቀናባሪ ወደ አጽዳቂ የአወያይ የህትመት የስራ ፍሰት።
ar: سير عمل النشر الخاضع للإشراف من مؤلف CAP إلى الموافق ، بما في ذلك التعليق ودعم إعلام البريد الإلكتروني.

source: Conforms to CAP Version 1.2 Standards.
am: ከ CAP ስሪት 1.2 ደረጃዎች ጋር ይስማማል።
ar: يتوافق مع معايير CAP الإصدار 1.2.

source: Search Engine Optimisation support to increase visibility and attract targeted traffic to an alert.
am: ታይነትን ለመጨመር እና የታለመ ትራፊክን ወደ ማንቂያ ለመሳብ የፍለጋ ሞተር ማሻሻያ ድጋፍ።
ar: دعم تحسين محرك البحث لزيادة الرؤية وجذب حركة المرور المستهدفة إلى تنبيه.

source: Support for Approval Workflow from composer to approver, including commenting and email notification support.
am: የአስተያየት እና የኢሜይል ማሳወቂያ ድጋፍን ጨምሮ ከአቀናባሪ ወደ አጽዳቂ የስራ ፍሰት ድጋፍ።
ar: دعم سير عمل الموافقة من الملحن إلى الموافق ، بما في ذلك التعليق ودعم إعلام البريد الإلكتروني.

source: Interoperable XML API of Alert List and Detail for integration with CAP Aggregators
am: በይነተገናኝ የኤክስኤምኤል ኤፒአይ የማንቂያ ዝርዝር እና ዝርዝር ከካፕ ሰብሳቢዎች ጋር ለመዋሃድ
ar: واجهة برمجة تطبيقات XML قابلة للتشغيل البيني لقائمة التنبيه وتفاصيل للتكامل مع CAP Aggregators

source: Live CAP creation and editing preview.
am: የቀጥታ CAP መፍጠር እና ቅድመ እይታን ማስተካከል።
ar: معاينة إنشاء وتحرير CAP المباشر.

source: Draw / Upload Polygon Functionality for Alert Area/Areas.
am: የፖሊጎን ተግባርን ይሳሉ / ይስቀሉ ለማስጠንቀቂያ አካባቢ/አካባቢ።
ar: رسم / تحميل وظيفة المضلع لمنطقة / مناطق التنبيه.

source: Alert to Alert/Alerts Reference Linkage.
am: ማንቂያ ወደ ማንቂያ/ማንቂያዎች ዋቢ ትስስር።
ar: تنبيه لتنبيهات / تنبيهات الارتباط المرجعي.
