Repository: ACMAD-Niamey/climweb
Catalog: docs/locales/*/LC_MESSAGES/_docs.po
Languages: am, ar

source: Creation of Publications
am: የሕትመቶች መፈጠር
ar: إنشاء المطبوعات

source: The creation of publications follows the steps below:
am: ህትመቶችን መፍጠር የሚከተሉትን ደረጃዎች ይከተላል.
ar: يتبع إنشاء المنشورات الخطوات التالية:

source: Create a publication type
am: የሕትመት ዓይነት ይፍጠሩ
ar: قم بإنشاء نوع منشور

source: Create a publication listing page
am: የሕትመት ዝርዝር ገጽ ይፍጠሩ
ar: قم بإنشاء صفحة قائمة منشورات

source: Create a publication page
am: የሕትመት ገጽ ይፍጠሩ
ar: قم بإنشاء صفحة منشور

source: Publication Creation Example Scenario
am: የሕትመት ፈጠራ ምሳሌ ሁኔታ
ar: سيناريو مثال إنشاء المنشورات

source: Assume you would like to have publication relating to Agrometeorology on the website, the practical way to do it using the steps above would be:
am: በድረ-ገጹ ላይ ከአግሮሜትቶሮሎጂ ጋር የተያያዘ ህትመት እንዲኖርዎት እንደሚፈልጉ ያስቡ፣ ከዚህ በላይ ያሉትን ደረጃዎች በመጠቀም ይህንን ለማድረግ ተግባራዊ የሆነው መንገድ፡-
ar: لنفترض أنك ترغب في الحصول على منشور متعلق بالأرصاد الجوية الزراعية على موقع الويب ، فإن الطريقة العملية للقيام بذلك باستخدام الخطوات المذكورة أعلاه ستكون:

source: Step 1: Create an publication type
am: ደረጃ 1፡ የህትመት አይነት ይፍጠሩ
ar: الخطوة 1: إنشاء نوع منشور

source: To create a publication type, navigate to the 'Snippets' section on the explorer menu and select 'Publication Types' as below:
am: የሕትመት አይነት ለመፍጠር በአሳሽ ሜኑ ላይ ወደሚገኘው 'Snippets' ክፍል ይሂዱ እና 'የህትመት አይነቶች'ን ከዚህ በታች እንደሚታየው ይምረጡ፡
ar: لإنشاء نوع منشور ، انتقل إلى قسم "المقتطفات" في قائمة المستكشف وحدد "أنواع المنشورات" على النحو التالي:

source: ![Publications Explorer](../../_static/images/publications/publications_explorer.png "Publications Explorer")
am: ![ህትመቶች አሳሽ](../../_static/images/publications/publications_explorer.png "Publications Explorer")
ar: ! [مستكشف المنشورات] (../../_ static / images / articles / updates_explorer.png "Publications Explorer")

source: Publications Explorer
am: የህትመት አሳሽ
ar: مستكشف المنشورات

source: Click on 'Add Publication Type' to create a new publication type.
am: አዲስ የህትመት አይነት ለመፍጠር 'የህትመት አይነት አክል' ላይ ጠቅ ያድርጉ።
ar: انقر فوق "إضافة نوع المنشور" لإنشاء نوع منشور جديد.

source: ![Publications Type](../../_static/images/publications/add_publication_type.png "Publications Type")
am: ![የህትመቶች አይነት](../../_static/images/publications/add_publication_type.png "የህትመቶች አይነት")
ar: ! [نوع المنشورات] (../../_ ثابت / صور / منشورات / add_publication_type.png "نوع المنشورات")

source: Publications Type
am: የሕትመቶች ዓይነት
ar: نوع المنشورات

source: Provide publication type name and choose an icon and save.
am: የህትመት አይነት ስም ያቅርቡ እና አዶ ይምረጡ እና ያስቀምጡ።
ar: أدخل اسم نوع المنشور واختر رمزًا واحفظه.

source: ![Publications Type](../../_static/images/publications/publication_type.png "Publications Type")
am: ![የህትመቶች አይነት](../../_static/images/publications/publication_type.png "የህትመቶች አይነት")
ar: ! [نوع المنشورات] (../../_ ثابت / صور / منشورات / publish_type.png "نوع المنشورات")

source: Step 2: Create a publication listing page
am: ደረጃ 2፡ የሕትመት ዝርዝር ገጽ ይፍጠሩ
ar: الخطوة 2: إنشاء صفحة قائمة المنشورات

source: A listing page is a page that holds a list of pages. For example, a Publication Listing page would hold one or more publications. It lists the banner, latest 3 featured publications and all other publications.
am: የዝርዝር ገጽ የገጾችን ዝርዝር የያዘ ገጽ ነው። ለምሳሌ፣ የሕትመት ዝርዝር ገጽ አንድ ወይም ከዚያ በላይ ህትመቶችን ይይዛል። ባነር፣ የቅርብ ጊዜ 3 ተለይተው የቀረቡ ህትመቶችን እና ሁሉንም ሌሎች ህትመቶችን ይዘረዝራል።
ar: صفحة القائمة هي صفحة تحتوي على قائمة من الصفحات. على سبيل المثال ، قد تحتوي صفحة قائمة المنشورات على منشور واحد أو أكثر. يسرد اللافتة وأحدث 3 منشورات مميزة وجميع المنشورات الأخرى.

source: ![Publication List Preview](../../_static/images/publications/publication_list_preview.png "Publication List Preview")
am: ![የህትመት ዝርዝር ቅድመ እይታ](../../_static/images/publications/publication_list_preview.png "የህትመት ዝርዝር ቅድመ እይታ")
ar: ! [معاينة قائمة المنشورات] (../../_ ثابت / صور / منشورات / publish_list_preview.png "معاينة قائمة المنشورات")

source: Publication List Preview
am: የሕትመት ዝርዝር ቅድመ እይታ
ar: معاينة قائمة المنشورات

source: Note: This option will only appear if no publication listing page already exists as there can only be on instance/occurrrence of a publication listing page.
am: ማሳሰቢያ፡ ይህ አማራጭ የሚታየው የሕትመት ዝርዝር ገጽ ላይ ለምሳሌ/መከሰት ብቻ ስለሆነ ምንም የሕትመት ዝርዝር ገጽ ከሌለ ብቻ ነው።
ar: ملاحظة: سيظهر هذا الخيار فقط في حالة عدم وجود صفحة قائمة منشورات بالفعل حيث لا يمكن أن يكون هناك سوى مثيل / تكرار لصفحة سرد المنشورات.

source: Select Publication List Page from the type of pages provided.
am: ከቀረቡት ገጾች ዓይነት የሕትመት ዝርዝር ገጽን ይምረጡ።
ar: حدد صفحة قائمة المنشورات من نوع الصفحات المقدمة.

source: ![Add Publication List Page](../../_static/images/publications/add_publication_list.png "Add Publication List Page")
am: ![የሕትመት ዝርዝር ገጽን አክል](../../_static/images/publications/add_publication_list.png "የሕትመት ዝርዝር ገጽ አክል")
ar: ! [إضافة صفحة قائمة المنشورات] (../../_ static / images / articles / add_publication_list.png "إضافة صفحة قائمة منشورات")

source: Add Publication List Page
am: የሕትመት ዝርዝር ገጽን ያክሉ
ar: أضف صفحة قائمة المنشورات

source: ![Add Publication List Page](../../_static/images/publications/publication_list_page.png "Add Publication List Page")
am: ![የሕትመት ዝርዝር ገጽን አክል](../../_static/images/publications/publication_list_page.png "የሕትመት ዝርዝር ገጽ አክል")
ar: ! [إضافة صفحة قائمة المنشورات] (../../_ static / images / articles / publish_list_page.png "إضافة صفحة قائمة المنشورات")

source: Step 3: Create a publication page
am: ደረጃ 3፡ የሕትመት ገጽ ይፍጠሩ
ar: الخطوة 3: إنشاء صفحة منشور

source: This will navigate to the list of pages under the home page including the publication list page you just created. Hover over the the publication listing page and click on 'add child page'.
am: ይህ አሁን የፈጠርከውን የሕትመት ዝርዝር ገጽን ጨምሮ በመነሻ ገጹ ስር ወዳለው የገጾች ዝርዝር ይሄዳል። የሕትመት ዝርዝር ገጹ ላይ አንዣብብ እና 'የልጅ ገፅ አክል' ላይ ጠቅ አድርግ።
ar: سينتقل هذا إلى قائمة الصفحات الموجودة أسفل الصفحة الرئيسية بما في ذلك صفحة قائمة المنشورات التي أنشأتها للتو. مرر مؤشر الماوس فوق صفحة سرد المنشور وانقر فوق "إضافة صفحة فرعية".

source: ![Add Publication Page](../../_static/images/publications/add_publication.png "Add Publication Page")
am: ![የሕትመት ገጽ አክል](../../_static/images/publications/add_publication.png "የሕትመት ገጽ አክል")
ar: ! [إضافة صفحة مطبوعة] (../../_ static / images / articles / add_publication.png "إضافة صفحة منشور")

source: Add Publication Page
am: የሕትመት ገጽ ያክሉ
ar: أضف صفحة المنشور

source: ![Publication Page Sections](../../_static/images/publications/publication_sections.png "Publication Page Sections")
am: ![የሕትመት ገጽ ክፍሎች](../../_static/images/publications/publication_sections.png "የሕትመት ገጽ ክፍሎች")
ar: ! [أقسام صفحة النشر] (../../_ ثابت / صور / منشورات / publish_sections.png "أقسام صفحة النشر")

source: Publication Page Sections
am: የሕትመት ገጽ ክፍሎች
ar: أقسام صفحة النشر

source: **Publication Type** - selected from previously prepared service category in step 1
am: **የህትመት አይነት** - ከዚህ ቀደም ከተዘጋጀው የአገልግሎት ምድብ በደረጃ 1 ተመርጧል
ar: ** نوع المنشور ** - محدد من فئة الخدمة المعدة مسبقًا في الخطوة 1

source: **Service Category** - selected from previously prepared service category. Refer to [Create Services Categories Section](./Manage-Services#step-1-create-an-agromet-service-category) to create service categories.
am: ** የአገልግሎት ምድብ *** - ቀደም ሲል ከተዘጋጀው የአገልግሎት ምድብ ተመርጧል. የአገልግሎት ምድቦችን ለመፍጠር [የአገልግሎቶችን ምድቦች ፍጠር](./Services#step-1-create-an-agromet-service-category) የሚለውን ይመልከቱ።
ar: ** فئة الخدمة ** - تم اختيارها من فئة الخدمة المعدة مسبقًا. راجع [إنشاء قسم فئات الخدمات] (./ إدارة الخدمات # الخطوة 1-إنشاء فئة خدمة agromet) لإنشاء فئات الخدمة.

source: **Projects Section** - select from previously prepared projects. Please refer [Manage Projects](./Manage-Projects) to guide on creation of projects.
am: ** የፕሮጀክቶች ክፍል *** - ከዚህ ቀደም ከተዘጋጁ ፕሮጀክቶች ውስጥ ይምረጡ። እባክዎን የፕሮጀክቶችን አፈጣጠር ለመምራት [ፕሮጀክቶችን ያስተዳድሩ](./Projects) ይመልከቱ።
ar: ** قسم المشاريع ** - اختر من المشاريع المعدة مسبقًا. يرجى الرجوع إلى [إدارة المشاريع] (./ إدارة المشاريع) للإرشاد بشأن إنشاء المشاريع.

source: **Publication Image** - This can be a screenshot of the front page of the publication
am: ** የሕትመት ምስል *** - ይህ የሕትመቱ የፊት ገጽ ቅጽበታዊ ገጽ እይታ ሊሆን ይችላል።
ar: ** صورة النشر ** - يمكن أن تكون لقطة شاشة للصفحة الأولى من المنشور

source: **Date of Publish** - the date the publication was published
am: ** የታተመበት ቀን *** - ህትመቱ የታተመበት ቀን
ar: ** تاريخ النشر ** - تاريخ نشر النشر

source: **Document or File** - Here you can upload pdfs, word documents, powerpoints, zip files or any other file of the publication
am: ** ሰነድ ወይም ፋይል *** - እዚህ ፒዲኤፍ ፣ የቃላት ሰነዶች ፣ የኃይል ነጥቦች ፣ ዚፕ ፋይሎች ወይም ሌላ ማንኛውንም የሕትመት ፋይል መስቀል ይችላሉ
ar: ** مستند أو ملف ** - يمكنك هنا تحميل ملفات pdf أو مستندات Word أو PowerPoint أو ملفات مضغوطة أو أي ملف آخر للمنشور

source: **External Url** - Only If published/hosted somewhere else, provide a link to published resource if external
am: ** ውጫዊ ዩአርኤል *** - ሌላ ቦታ ከታተመ/የተስተናገደ ብቻ፣ ውጫዊ ከሆነ ወደታተመ ግብአት አገናኝ ያቅርቡ
ar: ** عنوان Url الخارجي ** - فقط إذا تم نشره / استضافته في مكان آخر ، قم بتوفير رابط لمورد منشور إذا كان خارجيًا

source: **Summary** - Brief Summary of the publication
am: ** ማጠቃለያ *** - የሕትመት አጭር ማጠቃለያ
ar: ** ملخص ** - ملخص موجز للنشر

source: **Mark as featured** - If enabled, the publication will appear as Featured publications on the publications listing page
am: ** ተለይቶ እንደቀረበ ምልክት አድርግ *** - ከነቃ ህትመቱ በህትመቶች ዝርዝር ገጽ ላይ እንደ ተለይተው የቀረቡ ህትመቶች ሆኖ ይታያል።
ar: ** وضع علامة مميزة ** - في حالة التمكين ، سيظهر المنشور كمطبوعات مميزة على صفحة قائمة المطبوعات

source: **Is visible on homepage** - If enabled, the publication will appear in the homepage as an alert/latest update
am: **በመነሻ ገጽ ላይ ይታያል** - ከነቃ ህትመቱ በመነሻ ገጹ ላይ እንደ ማንቂያ/የቅርብ ጊዜ ዝማኔ ይታያል።
ar: ** مرئي على الصفحة الرئيسية ** - في حالة التمكين ، سيظهر المنشور في الصفحة الرئيسية كتنبيه / آخر تحديث

source: **Peer reviewed** - enable this option if the publication has been peer reviewed
am: ** አቻ ተገምግሟል *** - ህትመቱ በአቻ የተገመገመ ከሆነ ይህን አማራጭ ያንቁት
ar: ** مراجعة النظراء ** - قم بتمكين هذا الخيار إذا كان المنشور قد تمت مراجعته من قبل الأقران

source: **Additional Details** - this include an optional start and end date for which the publication is considered relevant.
am: **ተጨማሪ ዝርዝሮች** - ይህ ህትመቱ ተገቢ ነው ተብሎ የሚታሰበውን አማራጭ መጀመሪያ እና ማብቂያ ቀን ያካትታል።
ar: ** تفاصيل إضافية ** - يتضمن ذلك تاريخ بدء وتاريخ انتهاء اختياريين يعتبر المنشور مناسبًا لهما.

source: Note: To create additional publications in the future you would need to begin from [Step 3: Create a publication page](./Manage-Publications#step-3-create-a-publication-page).
am: ማሳሰቢያ፡ ለወደፊት ተጨማሪ ህትመቶችን ለመፍጠር ከ[ደረጃ 3፡ የሕትመት ገጽ ይፍጠሩ](./Manage-Publications#step-3-create-a-publication-page) መጀመር ያስፈልግዎታል።
ar: ملاحظة: لإنشاء منشورات إضافية في المستقبل ، يجب أن تبدأ من [الخطوة 3: إنشاء صفحة منشور] (./ Manage-Publications # step-3-create-a-publish-page).

source: Services
am: አገልግሎቶች
ar: خدمات

source: Creation of Services
am: የአገልግሎቶች መፈጠር
ar: إنشاء الخدمات

source: The creation of services follows the steps below:
am: የአገልግሎቶች መፈጠር የሚከተሉትን ደረጃዎች ይከተላል.
ar: يتبع إنشاء الخدمات الخطوات التالية:

source: Create a service category
am: የአገልግሎት ምድብ ይፍጠሩ
ar: قم بإنشاء فئة خدمة

source: Create a service listing page
am: የአገልግሎት ዝርዝር ገጽ ይፍጠሩ
ar: قم بإنشاء صفحة قائمة الخدمة

source: Create a service page
am: የአገልግሎት ገጽ ይፍጠሩ
ar: قم بإنشاء صفحة خدمة

source: Service Creation Example Scenario
am: የአገልግሎት ፍጥረት ምሳሌ ሁኔታ
ar: سيناريو مثال إنشاء الخدمة

source: Assume you would like to have Agrometeorology Service on the website, the practical way to do it using the steps above would be:
am: በድረ-ገጹ ላይ የአግሮሜትቶሮሎጂ አገልግሎት እንዲኖርዎት እንደሚፈልጉ ያስቡ፣ ከዚህ በላይ ያሉትን ደረጃዎች በመጠቀም ይህንን ለማድረግ ተግባራዊ የሆነው መንገድ፡-
ar: لنفترض أنك ترغب في الحصول على خدمة الأرصاد الجوية الزراعية على موقع الويب ، فإن الطريقة العملية للقيام بذلك باستخدام الخطوات المذكورة أعلاه ستكون:

source: Step 1: Create an 'Agromet Service Category'
am: ደረጃ 1፡ 'Agromet Service Category' ይፍጠሩ
ar: الخطوة 1: إنشاء "فئة خدمة Agromet"

source: To create a service, navigate to the 'Snippets' section on the explorer menu and select 'Servies Categories' as below:
am: አገልግሎት ለመፍጠር በአሳሽ ሜኑ ላይ ወደሚገኘው 'Snippets' ክፍል ይሂዱ እና 'የአገልግሎት ምድቦች'ን ከዚህ በታች እንደሚታየው ይምረጡ።
ar: لإنشاء خدمة ، انتقل إلى قسم "المقتطفات" في قائمة المستكشف وحدد "فئات الخدمات" على النحو التالي:

source: Click on 'Add service category' to create a new service.
am: አዲስ አገልግሎት ለመፍጠር 'የአገልግሎት ምድብ አክል' ላይ ጠቅ ያድርጉ።
ar: انقر فوق "إضافة فئة خدمة" لإنشاء خدمة جديدة.

source: Step 2: Create a Service Listing page
am: ደረጃ 2፡ የአገልግሎት ዝርዝር ገጽ ይፍጠሩ
ar: الخطوة 2: إنشاء صفحة قائمة الخدمات

source: A listing page is a page that holds a list of pages. For example, a Service Listing page would hold an agrometeorology service page, weather forecasting page, etc.
am: የዝርዝር ገጽ የገጾችን ዝርዝር የያዘ ገጽ ነው። ለምሳሌ፣ የአገልግሎት ዝርዝር ገጽ የአግሮሜትኦሮሎጂ አገልግሎት ገጽን፣ የአየር ሁኔታ ትንበያ ገጽን፣ ወዘተ ይይዛል።
ar: صفحة القائمة هي صفحة تحتوي على قائمة من الصفحات. على سبيل المثال ، قد تحتوي صفحة قائمة الخدمات على صفحة خدمة الأرصاد الجوية الزراعية وصفحة التنبؤ بالطقس وما إلى ذلك.

source: ![Services List Preview](../../_static/images/services/service_list_preview.png "Services List Preview")
am: ![የአገልግሎቶች ዝርዝር ቅድመ እይታ](../../_static/images/services/service_list_preview.png "የአገልግሎቶች ዝርዝር ቅድመ እይታ")
ar: ! [معاينة قائمة الخدمات] (../../_ static / images / services / service_list_preview.png "معاينة قائمة الخدمات")

source: Services List Preview
am: የአገልግሎቶች ዝርዝር ቅድመ እይታ
ar: معاينة قائمة الخدمات

source: Note: This option will only appear if no service listing page already exists as there can only be on instance/occurrrence of a service listing page.
am: ማሳሰቢያ፡ ይህ አማራጭ የሚታየው የአገልግሎት ዝርዝር ገፅ ከሌለ ብቻ ነው ምክንያቱም የአገልግሎት ዝርዝር ገፅ ላይ ብቻ ሊኖር ስለሚችል።
ar: ملاحظة: سيظهر هذا الخيار فقط في حالة عدم وجود صفحة قائمة خدمة بالفعل حيث لا يمكن أن يكون هناك سوى مثيل / تكرار لصفحة قائمة الخدمة.

source: Select Service List Page from the type of pages provided.
am: ከቀረቡት ገጾች አይነት የአገልግሎት ዝርዝር ገጽን ይምረጡ።
ar: حدد صفحة قائمة الخدمات من نوع الصفحات المقدمة.

source: ![Add Service List Page](../../_static/images/services/add_service_list.png "Add Service List Page")
am: ![የአገልግሎት ዝርዝር ገጽን አክል](../../_static/images/services/add_service_list.png "የአገልግሎት ዝርዝር ገፅ አክል")
ar: ! [إضافة صفحة قائمة الخدمات] (../../_ static / images / services / add_service_list.png "إضافة صفحة قائمة الخدمات")

source: Add Service List Page
am: የአገልግሎት ዝርዝር ገጽ ያክሉ
ar: أضف صفحة قائمة الخدمات

source: Provide a the page title and Heading and either save draft, publish or submit to moderation depending on your previlleges.
am: የገጹን ርዕስ እና ርዕስ ያቅርቡ እና ረቂቅ ያስቀምጡ፣ ያትሙ ወይም በቅድመ-ቪሌጅዎ ላይ በመመስረት ለሽምግልና ያስገቡ።
ar: قم بتوفير عنوان الصفحة والعنوان وقم إما بحفظ المسودة أو النشر أو الإرسال للمراجعة بناءً على الأمور السائدة لديك.

source: ![Add Service List Page](../../_static/images/services/service_list_page.png "Add Service List Page")
am: ![የአገልግሎት ዝርዝር ገጽን አክል](../../_static/images/services/service_list_page.png "የአገልግሎት ዝርዝር ገጽ አክል")
ar: ! [إضافة صفحة قائمة الخدمات] (../../_ static / images / services / service_list_page.png "إضافة صفحة قائمة الخدمات")

source: Step 3: Create a service page
am: ደረጃ 3፡ የአገልግሎት ገጽ ይፍጠሩ
ar: الخطوة 3: إنشاء صفحة خدمة

source: This will navigate to the list of pages under the home page including the service list page you just created. Hover over the the services listing page and click on 'add child page'.
am: ይህ አሁን የፈጠርከውን የአገልግሎት ዝርዝር ገጽ ጨምሮ በመነሻ ገጹ ስር ወዳለው የገጾች ዝርዝር ይሄዳል። በአገልግሎቶቹ ዝርዝር ገጽ ላይ ያንዣብቡ እና 'የልጅ ገጽ አክል' ላይ ጠቅ ያድርጉ።
ar: سينتقل هذا إلى قائمة الصفحات الموجودة أسفل الصفحة الرئيسية بما في ذلك صفحة قائمة الخدمات التي أنشأتها للتو. قم بالمرور فوق صفحة قائمة الخدمات وانقر فوق "إضافة صفحة فرعية".

source: ![Add Service Page](../../_static/images/services/add_service.png "Add Service Page")
am: ![የአገልግሎት ገጽ አክል](../../_static/images/services/add_service.png "የአገልግሎት ገጽ አክል")
ar: ! [إضافة صفحة خدمة] (../../_ static / images / services / add_service.png "إضافة صفحة خدمة")

source: Add Service Page
am: የአገልግሎት ገጽ ያክሉ
ar: أضف صفحة الخدمة

source: ![Service Page Sections](../../_static/images/services/service_page_sections.png "Service Page Sections")
am: ![የአገልግሎት ገጽ ክፍሎች](../../_static/images/services/አገልግሎት_ገጽ_sections.png "የአገልግሎት ገጽ ክፍሎች")
ar: ! [أقسام صفحة الخدمة] (../../_ static / images / services / service_page_sections.png "أقسام صفحة الخدمة")

source: Service Page Sections
am: የአገልግሎት ገጽ ክፍሎች
ar: أقسام صفحة الخدمة

source: **Service Category** - selected from previously prepared service category in step 2.
am: **የአገልግሎት ምድብ** - ከዚህ ቀደም ከተዘጋጀው የአገልግሎት ምድብ በደረጃ 2 ተመርጧል።
ar: ** فئة الخدمة ** - تم اختيارها من فئة الخدمة المعدة مسبقًا في الخطوة 2.

source: **Banner Section** - this contains the banner image, title, subtitle and call to action button.
am: ** ሰንደቅ ክፍል *** - ይህ የሰንደቅ ምስል ፣ ርዕስ ፣ ንዑስ ርዕስ እና ወደ ተግባር ጥሪ ቁልፍ ይይዛል ።
ar: ** قسم البانر ** - يحتوي على صورة البانر والعنوان والعنوان الفرعي وزر الحث على اتخاذ إجراء.

source: ![Banner Sections](../../_static/images/services/banner_section.png "Banner Sections")
am: ![ሰንደቅ ክፍሎች](../../_static/images/services/banner_section.png "የባነር ክፍሎች"
ar: ! [أقسام البانر] (../../_ static / images / services / banner_section.png "أقسام البانر")

source: Banner Sections
am: ባነር ክፍሎች
ar: أقسام البانر

source: **Introduction Section** - this contains the introduction title, introduction image, introduction text and button.
am: ** የመግቢያ ክፍል *** - ይህ የመግቢያ ርዕስ ፣ የመግቢያ ምስል ፣ የመግቢያ ጽሑፍ እና ቁልፍ ይይዛል።
ar: ** قسم المقدمة ** - يحتوي على عنوان المقدمة وصورة المقدمة ونص المقدمة والزر.

source: ![Introduction Sections](../../_static/images/services/introduction_section.png "Introduction Sections")
am: ![የመግቢያ ክፍሎች](../../_static/images/services/introduction_section.png "የመግቢያ ክፍሎች")
ar: ! [أقسام المقدمة] (../../_ static / images / services / Introduction_section.png "أقسام المقدمة")

source: Introduction Sections
am: የመግቢያ ክፍሎች
ar: أقسام المقدمة

source: **What we do in this Service section** - entails the 'what we do' items and what we do button.
am: **በዚህ የአገልግሎት ክፍል ውስጥ የምንሰራው *** - 'ምን እንደምናደርግ' እቃዎች እና የምንሰራውን ቁልፍ ያካትታል።
ar: ** ما نقوم به في قسم الخدمة هذا ** - يستلزم عناصر "ماذا نفعل" وزر ما نفعله.

source: ![What we do Sections](../../_static/images/services/what_we_do_section.png "What we do Sections")
am: ![የምንሰራው ክፍል](../../_static/images/አገልግሎት/የምንሰራው_ክፍል.png "የምንሰራው ክፍል)"
ar: ! [أقسام ماذا نفعل] (../../_ static / images / services / what_we_do_section.png "أقسام ما نفعل")

source: What we do Sections
am: እኛ የምንሰራው ክፍሎች
ar: أقسام ما نقوم به

source: **Projects Section** - This contains a description of the projects linked to the service being edited. Please refer [Manage Projects](./Manage-Projects) to guide on creation of projects and linking them to services.
am: ** የፕሮጀክቶች ክፍል *** - ይህ በመስተካከል ላይ ካለው አገልግሎት ጋር የተገናኙትን ፕሮጀክቶች መግለጫ ይዟል. እባክዎን የፕሮጀክቶችን አፈጣጠር እና ከአገልግሎቶች ጋር ለማገናኘት መመሪያ ለመስጠት [ፕሮጀክቶችን ያስተዳድሩ](./Projects) ይመልከቱ።
ar: ** قسم المشاريع ** - يحتوي على وصف للمشاريع المرتبطة بالخدمة الجاري تحريرها. يرجى الرجوع إلى [إدارة المشاريع] (./ إدارة المشاريع) للإرشاد حول إنشاء المشاريع وربطها بالخدمات.

source: ![Projects Sections](../../_static/images/services/projects_section.png "Projects Sections")
am: ![የፕሮጀክቶች ክፍሎች](../../_static/images/services/projects_section.png "የፕሮጀክቶች ክፍሎች")
ar: ! [أقسام المشاريع] (../../_ static / images / services / projects_section.png "أقسام المشاريع")

source: Projects Sections
am: የፕሮጀክቶች ክፍሎች
ar: اقسام المشاريع

source: **Feature Block Items** - this section allows addition of a series of alternating blocks containing an image, title, description and call to action button.
am: ** የባህሪ ማገጃ ዕቃዎች *** - ይህ ክፍል ምስል ፣ ርዕስ ፣ መግለጫ እና ወደ ተግባር ጥሪ የያዙ ተከታታይ ተለዋጭ ብሎኮችን ለመጨመር ያስችላል።
ar: ** عناصر حظر الميزات ** - يسمح هذا القسم بإضافة سلسلة من الكتل البديلة التي تحتوي على صورة وعنوان ووصف وزر الحث على اتخاذ إجراء.

source: ![Feature Block Sections](../../_static/images/services/feature_block_section.png "Projects Sections")
am: ![የባህሪ እገዳ ክፍሎች](../../_static/images/services/feature_block_section.png "የፕሮጀክቶች ክፍሎች")
ar: ! [أقسام كتلة الميزات] (../../_ static / images / services / feature_block_section.png "أقسام المشاريع")

source: Feature Block Sections
am: የባህሪ ማገጃ ክፍሎች
ar: أقسام كتلة الميزات

source: **Youtube playlist** - this section enables selection of an existing youtube playlist with videos related to this service.
am: **የዩቲዩብ አጫዋች ዝርዝር** - ይህ ክፍል ከዚህ አገልግሎት ጋር በተያያዙ ቪዲዮዎች ያለ የዩቲዩብ አጫዋች ዝርዝር እንዲመረጥ ያስችላል።
ar: ** قائمة تشغيل Youtube ** - يتيح هذا القسم اختيار قائمة تشغيل youtube حالية مع مقاطع فيديو متعلقة بهذه الخدمة.

source: **Applications** - this section enables selection of an existing system applications related to this service.
am: ** አፕሊኬሽኖች *** - ይህ ክፍል ከዚህ አገልግሎት ጋር የተያያዙ ነባር የስርዓት መተግበሪያዎችን መምረጥ ያስችላል።
ar: ** التطبيقات ** - يتيح هذا القسم اختيار تطبيقات النظام الحالية المتعلقة بهذه الخدمة.

source: note: Projects, Events, News and Publications are linked to the service in their respective pages.
am: ማስታወሻ፡ ፕሮጀክቶች፣ ዝግጅቶች፣ ዜናዎች እና ህትመቶች በየገጾቻቸው ከአገልግሎቱ ጋር የተገናኙ ናቸው።
ar: ملاحظة: المشاريع والأحداث والأخبار والمنشورات مرتبطة بالخدمة في صفحاتها الخاصة.

source: Pages
am: ገፆች
ar: الصفحات

source: ![Creating pages](../../_static/images/pages/page_hierarchy.png "Creating pages")
am: ![ገጾችን በመፍጠር ላይ](../../_static/images/pages/page_hierarchy.png "ገጾችን መፍጠር")
ar: ! [إنشاء الصفحات] (../../_ static / images / pages / page_hierarchy.png "إنشاء الصفحات")

source: Creating pages
am: ገጾችን መፍጠር
ar: إنشاء الصفحات

source: The section below gives an overall guide on the concept of a page and managing pages together with their elements. However, if you would prefer a guide to manage specific pages refer to sections listed below.
am: ከዚህ በታች ያለው ክፍል ስለ ገጽ ፅንሰ-ሀሳብ እና ገጾችን ከአካሎቻቸው ጋር በማቀናጀት አጠቃላይ መመሪያ ይሰጣል። ሆኖም፣ የተወሰኑ ገጾችን ለማስተዳደር መመሪያን ከመረጡ ከታች የተዘረዘሩትን ክፍሎች ይመልከቱ።
ar: يقدم القسم أدناه دليلًا شاملاً حول مفهوم الصفحة وإدارة الصفحات جنبًا إلى جنب مع عناصرها. ومع ذلك ، إذا كنت تفضل دليلًا لإدارة صفحات معينة ، فارجع إلى الأقسام المدرجة أدناه.

source: Creating new pages
am: አዲስ ገጾችን መፍጠር
ar: إنشاء صفحات جديدة

source: To create a new page, click … Actions and select the Add child page option. This creates a child page of the section you are currently in. In this case, a child page of the Breads page. The **Home Page** is the top most page in the hierarchy.
am: አዲስ ገጽ ለመፍጠር … Actions የሚለውን ጠቅ ያድርጉ እና የልጅ ገፅ አክል የሚለውን አማራጭ ይምረጡ። ይህ አሁን ያሉበት ክፍል የሕፃን ገጽ ይፈጥራል። በዚህ አጋጣሚ የዳቦዎች ገጽ የሕፃን ገጽ። **የመነሻ ገጽ** በተዋረድ ውስጥ ከፍተኛው ገጽ ነው።
ar: لإنشاء صفحة جديدة ، انقر فوق… إجراءات وحدد خيار إضافة صفحة فرعية. يؤدي هذا إلى إنشاء صفحة فرعية للقسم الذي تتواجد فيه حاليًا. في هذه الحالة ، صفحة فرعية من صفحة الخبز. ** الصفحة الرئيسية ** هي أعلى صفحة في التسلسل الهرمي.

source: ![Creating pages](../../_static/images/pages/create_page.png "Creating pages")
am: ![ገጾችን በመፍጠር ላይ](../../_static/images/pages/create_page.png "ገጾችን መፍጠር")
ar: ! [إنشاء الصفحات] (../../_ static / images / pages / create_page.png "إنشاء الصفحات")

source: Edit Existing pages
am: ነባር ገጾችን ያርትዑ
ar: تحرير الصفحات الموجودة

source: You can access an existing page's edit screen in three ways.
am: ነባር ገጽ የአርትዖት ስክሪን በሶስት መንገዶች መድረስ ይችላሉ።
ar: يمكنك الوصول إلى شاشة تحرير صفحة موجودة بثلاث طرق.

source: First, by clicking … **Actions** and then select the Edit option from the dropdown.
am: በመጀመሪያ … **Actions** ን ጠቅ በማድረግ እና ከዚያ ከተቆልቋዩ ውስጥ የአርትዕ ምርጫን ይምረጡ።
ar: أولاً ، بالنقر فوق ... ** إجراءات ** ثم تحديد خيار تحرير من القائمة المنسدلة.

source: Second, by clicking the page's title if you are accessing the page from its **parent's Explorer page** or in search results.
am: ሁለተኛ፡ ገጹን ከ **የወላጅ አሳሽ ገጽ** ወይም በፍለጋ ውጤቶቹ ላይ እየደረስክ ከሆነ የገጹን ርዕስ ጠቅ በማድረግ።
ar: ثانيًا ، بالنقر فوق عنوان الصفحة إذا كنت تقوم بالوصول إلى الصفحة من ** صفحة المستكشف الخاصة بها ** أو في نتائج البحث.
