Repository: ACMAD-Niamey/climweb
Catalog: docs/locales/*/LC_MESSAGES/_docs.po
Languages: am, ar

source: Alert Area geocode
am: የማንቂያ አካባቢ ጂኦኮድ
ar: رمز جغرافي لمنطقة التنبيه

source: D. Alert Resource
am: መ. የማንቂያ ምንጭ
ar: D. تنبيه الموارد

source: Multiple instances of this section are allowed. It contains the **Description (resourceDesc), MIME Type (mimeType), File Size (size), URI (uri), Dereferenced URI (derefUri) and Digest (digest)**
am: የዚህ ክፍል በርካታ አጋጣሚዎች ተፈቅደዋል። የ**መግለጫ(resourceDesc)፣ MIME አይነት (mimeType)፣ የፋይል መጠን (መጠን)፣ URI (uri)፣ Dereferenced URI (derefUri) እና Digest (digest)** ይዟል።
ar: يُسمح بمثيلات متعددة من هذا القسم. يحتوي على ** الوصف (ResourceDesc) ، ونوع MIME (mimeType) ، وحجم الملف (الحجم) ، و URI (uri) ، و URI (derefUri) ، و Digest (Digest) **

source: File resource (takes in a file and description)
am: የፋይል ምንጭ (በፋይል እና መግለጫ ውስጥ ይወሰዳል)
ar: مورد الملف (يأخذ ملفًا ووصفًا)

source: ![Alert Resource](../_static/images/cap/alert_resource_file.png "Alert Resource section")
am: ![የማንቂያ ምንጭ](../_static/images/cap/alert_resource_file.png "የማንቂያ ምንጭ ክፍል")
ar: ! [مورد التنبيه] (../_ static / images / cap / alert_resource_file.png "قسم موارد التنبيه")

source: Alert Resource
am: የማንቂያ ምንጭ
ar: مصدر التنبيه

source: External resource
am: የውጭ መገልገያ
ar: مورد خارجي

source: ![Alert Resource](../_static/images/cap/alert_resource_external.png "Alert Resource section")
am: ![የማንቂያ ምንጭ](../_static/images/cap/alert_resource_external.png "የማንቂያ ምንጭ ክፍል")
ar: ! [مصدر التنبيه] (../_ static / images / cap / alert_resource_external.png "قسم موارد التنبيه")

source: E. Additional CAP Inputs
am: ኢ ተጨማሪ የ CAP ግብዓቶች
ar: E. مدخلات CAP إضافية

source: Addition alert information elements include parameters and event codes
am: የመደመር ማንቂያ መረጃ ክፍሎች ግቤቶችን እና የክስተት ኮዶችን ያካትታሉ
ar: تتضمن عناصر معلومات التنبيه الإضافية المعلمات ورموز الأحداث

source: F. Incidents
am: ረ. ክስተቶች
ar: و. الحوادث

source: This defines the reference incident to the current alert, if any.
am: ይህ ካለ አሁን ላለው ማንቂያ የማጣቀሻ ክስተትን ይገልጻል።
ar: يحدد هذا الحادث المرجعي للتنبيه الحالي ، إن وجد.

source: ![Alert Incidents](../_static/images/cap/alert_incidents.png "Alert Incidents section")
am: ![የማንቂያ ክስተቶች](../_static/images/cap/alert_incidents.png "የማንቂያ ክስተቶች ክፍል")
ar: ! [حوادث التنبيه] (../_ static / images / cap / alert_incidents.png "قسم حوادث التنبيه")

source: Alert Incidents
am: የማንቂያ ክስተቶች
ar: حوادث التنبيه

source: CAP Settings
am: CAP ቅንብሮች
ar: إعدادات CAP

source: CAP Settings include sender name, sender identifier, contact details, hazard types and audience types.
am: የ CAP ቅንጅቶች የላኪ ስም፣ የላኪ ለዪ፣ የአድራሻ ዝርዝሮች፣ የአደጋ አይነቶች እና የታዳሚ አይነቶች ያካትታሉ።
ar: تتضمن إعدادات CAP اسم المرسل ومعرف المرسل وتفاصيل الاتصال وأنواع المخاطر وأنواع الجمهور.

source: Note: The creation of Hazard types will change the event input under alert information to a dropdown.
am: ማሳሰቢያ፡ የአደጋ አይነቶች መፈጠር የክስተት ግብአት በማንቂያ መረጃ ስር ወደ ተቆልቋይ ይለውጠዋል።
ar: ملاحظة: سيؤدي إنشاء أنواع المخاطر إلى تغيير إدخال الحدث تحت معلومات التنبيه إلى قائمة منسدلة.

source: Setting up boundaries
am: ድንበሮችን በማዘጋጀት ላይ
ar: وضع الحدود

source: The boundary manager allows for the addition of boundaries to be used in the creation of an alert area using the admin boundary option.
am: የድንበር አስተዳዳሪው የአስተዳዳሪ ወሰን አማራጩን በመጠቀም የማንቂያ ቦታን ለመፍጠር ድንበሮችን ለመጨመር ይፈቅዳል።
ar: يسمح مدير الحدود بإضافة حدود لاستخدامها في إنشاء منطقة تنبيه باستخدام خيار حدود المسؤول.

source: To access it, click on the boundary manager in the explorer menu as below and select Admin boundary settings to select the boundary data source and country/countries of interest. You will then need to add boundary data for the countries selected:
am: እሱን ለማግኘት ከዚህ በታች ባለው አሳሽ ሜኑ ውስጥ ያለውን የድንበር አስተዳዳሪን ጠቅ ያድርጉ እና የድንበር ዳታ ምንጭን እና የፍላጎት ሀገር/ሀገሮችን ለመምረጥ የአስተዳዳሪ ድንበር ቅንብሮችን ይምረጡ። ከዚያ ለተመረጡት አገሮች የድንበር ውሂብ ማከል ያስፈልግዎታል፡-
ar: للوصول إليه ، انقر فوق مدير الحدود في قائمة المستكشف على النحو التالي وحدد إعدادات حدود المسؤول لتحديد مصدر بيانات الحدود والبلد / البلدان محل الاهتمام. ستحتاج بعد ذلك إلى إضافة بيانات الحدود للبلدان المحددة:

source: ![Boundary Settings](../_static/images/cap/boundary_settings_menu.png "Boundary Settings")
am: ![የድንበር ቅንጅቶች](../_static/images/cap/boundary_settings_menu.png "Boundary Settings)"
ar: ! [إعدادات الحدود] (../_ static / images / cap / borderary_settings_menu.png "إعدادات الحدود")

source: Boundary Settings
am: የድንበር ቅንጅቶች
ar: إعدادات الحدود

source: Select the 'boundary data source' where you will download the boundaries. The current options are:
am: ወሰኖቹን የሚያወርዱበትን 'የወሰን መረጃ ምንጭ' ይምረጡ። አሁን ያሉት አማራጮች፡-
ar: حدد "مصدر بيانات الحدود" حيث سيتم تنزيل الحدود. الخيارات الحالية هي:

source: OCHA Administrative Boundary common Operational Datasets (COD-ABS) (*default*) https://data.humdata.org/
am: OCHA የአስተዳደር ወሰን የጋራ ኦፕሬሽናል ዳታሴቶች (COD-ABS) (*ነባሪ*) https://data.humdata.org/
ar: مجموعات البيانات التشغيلية المشتركة للحدود الإدارية لمكتب تنسيق الشؤون الإنسانية (COD-ABS) (* افتراضي *) https://data.humdata.org/

source: Global Administrative Areas 4.1 (GADM) https://gadm.org/download_country.html
am: የአለምአቀፍ አስተዳደር ቦታዎች 4.1 (GADM) https://gadm.org/download_country.html
ar: المناطق الإدارية العالمية 4.1 (GADM) https://gadm.org/download_country.html

source: Add one or more countries
am: አንድ ወይም ከዚያ በላይ አገሮችን ያክሉ
ar: أضف دولة واحدة أو أكثر

source: To add boundary data, access the menu as below and click on 'Add Boundary' button:
am: የድንበር ውሂብን ለመጨመር ከዚህ በታች ያለውን ምናሌ ይድረሱ እና 'ወሰን አክል' ቁልፍን ጠቅ ያድርጉ።
ar: لإضافة بيانات الحدود ، قم بالوصول إلى القائمة على النحو التالي وانقر على زر "إضافة حدود":

source: ![Boundary Data](../_static/images/cap/add_boundary.png "Boundary Data")
am: ![የድንበር መረጃ](../_static/images/cap/add_boundary.png "የድንበር ውሂብ")

source: Boundary Data
am: የድንበር ውሂብ
ar: بيانات الحدود

source: Load country boundaries at each of different levels (level 0 to 4) in zipped shapefile format
am: የሀገር ድንበሮችን በእያንዳንዱ የተለያዩ ደረጃዎች (ከደረጃ 0 እስከ 4) በዚፕ ቅርጸት ጫን
ar: قم بتحميل حدود البلد على كل مستوى من المستويات المختلفة (المستوى 0 إلى 4) بتنسيق ملف شكل مضغوط

source: ![Boundary Loader](../_static/images/cap/boundary_loader.png "Boundary Loader")
am: ![የድንበር ጫኚ](../_static/images/cap/boundary_loader.png "Boundary Loader")

source: Boundary Loader
am: የድንበር ጫኝ
ar: محمل الحدود

source: note: Zip shapefiles seperately by Admin level before upload.
am: ማስታወሻ፡ ከመጫንዎ በፊት የዚፕ ፋይሎችን በተለየ በአስተዳዳሪ ደረጃ።
ar: ملاحظة: Zip shapefiles بشكل منفصل حسب مستوى المسؤول قبل التحميل.

source: City Forecasts
am: የከተማ ትንበያዎች
ar: توقعات المدينة

source: ![Preview Home](../_static/images/city_forecasts/preview_home.png "Preview Home")
am: ![መነሻ ቅድመ እይታ](../_static/images/city_forecasts/preview_home.png "የቅድመ እይታ መነሻ")
ar: ! [الصفحة الرئيسية للمعاينة] (../_ static / images / city_forecasts / preview_home.png "صفحة المعاينة الرئيسية")

source: Preview Home
am: መነሻን አስቀድመው ይመልከቱ
ar: معاينة الصفحة الرئيسية

source: City forecasts displayed on the homepage, and forecasts page can be added through the CMS in two ways:
am: የከተማ ትንበያዎች በመነሻ ገጽ ላይ ይታያሉ፣ እና የትንበያ ገጽ በሲኤምኤስ በኩል በሁለት መንገዶች መጨመር ይቻላል፡
ar: يتم عرض توقعات المدينة على الصفحة الرئيسية ، ويمكن إضافة صفحة التنبؤات من خلال نظام إدارة المحتوى بطريقتين:

source: Manually adding daily forecasts
am: ዕለታዊ ትንበያዎችን በእጅ ማከል
ar: إضافة التوقعات اليومية يدويًا

source: Fetching city forecasts from an external source i.e YR Meteo Norway's location forecast API https://developer.yr.no/featured-products/forecast/
am: የከተማ ትንበያዎችን ከውጭ ምንጭ ማምጣት ማለትም YR Meteo ኖርዌይ የሚገኝበት ቦታ ትንበያ API https://developer.yr.no/featured-products/forecast/
ar: جلب تنبؤات المدينة من مصدر خارجي ، مثل واجهة برمجة تطبيقات توقعات موقع YR Meteo Norway https://developer.yr.no/featured-products/forecast/

source: Note: The forecast manager comes with predefined weather conditions and icons. Please refer to YR Weather symbols documentation for guidance on icons and naming convention. https://api.met.no/weatherapi/weathericon/2.0/documentation
am: ማስታወሻ፡ የትንበያ አስተዳዳሪው አስቀድሞ ከተገለጹ የአየር ሁኔታዎች እና አዶዎች ጋር አብሮ ይመጣል። እባክዎን አዶዎችን እና የስም አሰጣጥን በተመለከተ መመሪያ ለማግኘት የYR የአየር ሁኔታ ምልክቶችን ይመልከቱ። https://api.met.no/weatherapi/weathericon/2.0/documentation
ar: ملاحظة: يأتي مدير التوقعات مصحوبًا بظروف الطقس والرموز المحددة مسبقًا. يرجى الرجوع إلى وثائق رموز الطقس YR للحصول على إرشادات حول الرموز واصطلاح التسمية. https://api.met.no/weatherapi/weathericon/2.0/documentation

source: Manually Adding Forecasts
am: ትንበያዎችን በእጅ መጨመር
ar: إضافة التوقعات يدويًا

source: The city forecast explorer menu can be accessed on the left sidebar.
am: የከተማ ትንበያ አሳሽ ምናሌ በግራ የጎን አሞሌ ላይ ሊደረስበት ይችላል።
ar: يمكن الوصول إلى قائمة مستكشف توقعات المدينة على الشريط الجانبي الأيسر.

source: ![Forecast explorer](../_static/images/city_forecasts/forecast_explorer.png "Forecast explorer")
am: ![ትንበያ አሳሽ](../_static/images/city_forecasts/forecast_explorer.png "ትንበያ አሳሽ")
ar: ! [مستكشف التوقعات] (../_ static / images / city_forecasts / Forecast_explorer.png "مستكشف التوقعات")

source: Forecast explorer
am: ትንበያ አሳሽ
ar: مستكشف التوقعات

source: Here you have the ability to:
am: እዚህ የሚከተሉትን የማድረግ ችሎታ አለዎት-
ar: هنا لديك القدرة على:

source: Add/Edit/Delete a city (city name and location)
am: ከተማን አክል/አርትዕ/ሰርዝ (የከተማ ስም እና አካባቢ)
ar: إضافة / تحرير / حذف مدينة (اسم المدينة والموقع)

source: ![Add city](../_static/images/city_forecasts/add_city.png "Add city")
am: ![ከተማ አክል](../_static/images/city_forecasts/add_city.png "ከተማ አክል")
ar: ! [أضف مدينة] (../_ static / images / city_forecasts / add_city.png "أضف مدينة")

source: Add city
am: ከተማ ጨምር
ar: أضف مدينة

source: Import city forecasts in CSV format.
am: የከተማ ትንበያዎችን በCSV ቅርጸት አስመጣ።
ar: استيراد تنبؤات المدينة بصيغة CSV.

source: ![Add Forecast Explorer](../_static/images/city_forecasts/add_forecast_explorer.png "Add Forecast Explorer")
am: ![ትንበያ አሳሽ አክል](../_static/images/city_forecasts/add_forecast_explorer.png "ትንበያ አሳሽ አክል"
ar: ! [إضافة مستكشف التوقعات] (../_ static / images / city_forecasts / add_forecast_explorer.png "إضافة مستكشف التوقعات")

source: Add Forecast Explorer
am: ትንበያ ኤክስፕሎረር አክል
ar: أضف مستكشف التوقعات

source: Using the forecast manager, it is possible to load city forecasts in CSV format created offline or alternatively populate the table on the right with data. A template of the standard CSV structure is provided prepopulated with a list of all cities listed in the database. However, the forecast manager can accept a different structure and allow for correct matching of each of the columns. A forecast date must be provided for the data being uploaded before publishing.
am: የትንበያ ሥራ አስኪያጁን በመጠቀም፣ ከመስመር ውጭ በተፈጠረው የCSV ቅርጸት የከተማ ትንበያዎችን መጫን ወይም በአማራጭ በቀኝ በኩል ያለውን ጠረጴዛ በውሂብ መሙላት ይቻላል። የመደበኛ CSV መዋቅር አብነት በመረጃ ቋቱ ውስጥ ከተዘረዘሩት የሁሉም ከተሞች ዝርዝር ጋር ቀድሞ ተሞልቶ ቀርቧል። ነገር ግን፣ የትንበያ ስራ አስኪያጁ የተለየ መዋቅር መቀበል እና የእያንዳንዱን አምዶች ትክክለኛ ማዛመድን ይፈቅዳል። ከመታተሙ በፊት ለሚሰቀለው ውሂብ የትንበያ ቀን መቅረብ አለበት።
ar: باستخدام مدير التوقعات ، من الممكن تحميل تنبؤات المدينة بتنسيق CSV الذي تم إنشاؤه في وضع عدم الاتصال أو بدلاً من ذلك ملء الجدول على اليمين بالبيانات. يتم توفير نموذج لهيكل CSV القياسي معبأ مسبقًا بقائمة بجميع المدن المدرجة في قاعدة البيانات. ومع ذلك ، يمكن لمدير التنبؤ قبول بنية مختلفة والسماح بالمطابقة الصحيحة لكل عمود من الأعمدة. يجب تقديم تاريخ توقع للبيانات التي يتم تحميلها قبل النشر.

source: ![Add Forecast](../_static/images/city_forecasts/add_forecast.png "Add Forecast")
am: ![ትንበያ አክል](../_static/images/city_forecasts/add_forecast.png "ትንበያ አክል")
ar: ! [إضافة توقعات] (../_ static / images / city_forecasts / add_forecast.png "إضافة توقعات")

source: Add Forecast
am: ትንበያ ጨምር
ar: إضافة توقعات

source: Preview previously added city forecasts (last 7 days)
am: ከዚህ ቀደም የታከሉ የከተማ ትንበያዎችን (ያለፉት 7 ቀናት) አስቀድመው ይመልከቱ
ar: معاينة تنبؤات المدينة المضافة سابقًا (آخر 7 أيام)

source: ![Load Forecast Explorer](../_static/images/city_forecasts/load_forecast_explorer.png "Load Forecast Explorer")
am: ![የጭነት ትንበያ ኤክስፕሎረር](../_static/images/city_forecasts/load_forecast_explorer.png "የጭነት ትንበያ አሳሽ")
ar: ! [تحميل مستكشف التوقعات] (../_ static / images / city_forecasts / load_forecast_explorer.png "تحميل مستكشف التوقعات")

source: Load Forecast Explorer
am: ጫን ትንበያ ኤክስፕሎረር
ar: تحميل مستكشف التوقعات

source: It is also possible to fetch and preview the last 7 day city forecasts. The forecast manager allows for switching between each of the avilable dates and preview both in tabular and georeferenced formats.
am: እንዲሁም ያለፉትን 7 ቀናት የከተማ ትንበያዎችን ማምጣት እና አስቀድመው ማየት ይቻላል። የትንበያ ስራ አስኪያጁ በእያንዳንዱ ሊገኙ በሚችሉት ቀናት መካከል መቀያየር እና ሁለቱንም በሰንጠረዥ እና በጂኦግራፊያዊ ቅርጸቶች ቅድመ እይታ ይፈቅዳል።
ar: من الممكن أيضًا جلب ومعاينة آخر 7 أيام من تنبؤات المدينة. يسمح مدير التوقعات بالتبديل بين كل من التواريخ المتاحة ومعاينة كل من التنسيقات المجدولة والمحددة جغرافيًا.

source: ![Load Forecast](../_static/images/city_forecasts/load_forecast.png "Load Forecast")
am: ![የጭነት ትንበያ](../_static/images/city_forecasts/load_forecast.png "የጭነት ትንበያ")
ar: ! [تحميل التوقعات] (../_ static / images / city_forecasts / load_forecast.png "توقعات التحميل")

source: Load Forecast
am: የጭነት ትንበያ
ar: توقعات الحمل

source: Add Daily Weather Summary
am: ዕለታዊ የአየር ሁኔታ ማጠቃለያ ያክሉ
ar: إضافة ملخص الطقس اليومي

source: Daily Weather Explorer
am: ዕለታዊ የአየር ሁኔታ አሳሽ
ar: مستكشف الطقس اليومي

source: ![Daily Weather](../_static/images/city_forecasts/daily_weather.png "Daily Weather")
am: ![ዕለታዊ የአየር ሁኔታ](../_static/images/city_forecasts/daily_weather.png "ዕለታዊ የአየር ሁኔታ")
ar: ! [الطقس اليومي] (../_ static / images / city_forecasts / daily_weather.png "Daily Weather")

source: Daily Weather
am: ዕለታዊ የአየር ሁኔታ
ar: الطقس اليومي

source: Additionally, a daily weather summary containing descriptive information about the observed conditions, weather forecast and extreme station readings is also provided. A preview of this information would appear as below on the website:
am: በተጨማሪም፣ ስለተስተዋሉ ሁኔታዎች፣ የአየር ሁኔታ ትንበያ እና ከፍተኛ የጣቢያ ንባቦች ገላጭ መረጃን የያዘ ዕለታዊ የአየር ሁኔታ ማጠቃለያም ቀርቧል። የዚህ መረጃ ቅድመ እይታ በድህረ ገጹ ላይ እንደሚከተለው ይታያል፡-
ar: بالإضافة إلى ذلك ، يتم توفير ملخص يومي للطقس يحتوي على معلومات وصفية حول الظروف المرصودة وتوقعات الطقس وقراءات المحطة المتطرفة. ستظهر معاينة لهذه المعلومات على النحو التالي على الموقع الإلكتروني:

source: ![Daily Weather Preview](../_static/images/city_forecasts/daily_weather_preview.png "Daily Weather Preview")
am: ![ዕለታዊ የአየር ሁኔታ ቅድመ እይታ](../_static/images/city_forecasts/daily_weather_preview.png "ዕለታዊ የአየር ሁኔታ ቅድመ እይታ")
ar: ! [معاينة الطقس اليومية] (../_ static / images / city_forecasts / daily_weather_preview.png "معاينة الطقس اليومية")

source: Daily Weather Preview
am: ዕለታዊ የአየር ሁኔታ ቅድመ እይታ
ar: معاينة الطقس اليومية

source: Fetching from an external source
am: ከውጭ ምንጭ ማምጣት
ar: الجلب من مصدر خارجي

source: To enable automated fetching of city forecasts from an external source i.e YR Meteo Norway's location forecast API https://developer.yr.no/featured-products/forecast/, this option needs to be set to true.
am: የከተማ ትንበያዎችን ከውጪ ምንጭ በራስ ሰር ማምጣትን ለማስቻል ማለትም YR Meteo ኖርዌይ የሚገኝበትን ቦታ ትንበያ API https://developer.yr.no/featured-products/forecast/፣ ይህ አማራጭ ወደ እውነት መቀናበር አለበት።
ar: لتمكين الجلب الآلي لتوقعات المدينة من مصدر خارجي ، مثل واجهة برمجة تطبيقات توقعات موقع YR Meteo Norway https://developer.yr.no/featured-products/forecast/ ، يجب ضبط هذا الخيار على "صحيح".

source: The forecast will be fetched every three hours and get updated accordingly.
am: ትንበያው በየሶስት ሰዓቱ ይመጣል እና በዚሁ መሰረት ይዘምናል።
ar: سيتم جلب التوقعات كل ثلاث ساعات وسيتم تحديثها وفقًا لذلك.

source: AutoForecast
am: ራስ-ትንበያ

source: Mapviewer
am: ካርታ መመልከቻ

source: ![Organisation page](../_static/images/mapviewer/mapviewer.png "Organisation page")
am: ![ድርጅት ገጽ](../_static/images/mapviewer/mapviewer.png "የድርጅት ገጽ")
ar: ! [صفحة المؤسسة] (../_ static / images / mapviewer / mapviewer.png "صفحة المؤسسة")

source: Organisation page
am: የድርጅት ገጽ
ar: صفحة التنظيم

source: Collections
am: ስብስቦች
ar: المجموعات

source: You can control access to specific sets of images and documents by setting up collections. By default, all images and documents belong to the root collection, but users with appropriate permissions can create new collections from the Collections interface. Go to Settings > Collections from the Wagtail Sidebar to access the Collections interface.
am: ስብስቦችን በማዘጋጀት የተወሰኑ የምስሎች እና የሰነድ ስብስቦች መዳረሻን መቆጣጠር ይችላሉ። በነባሪ፣ ሁሉም ምስሎች እና ሰነዶች የስር ስብስብ ናቸው፣ ነገር ግን ተገቢ ፈቃድ ያላቸው ተጠቃሚዎች ከስብስብ በይነገጽ አዲስ ስብስቦችን መፍጠር ይችላሉ። የስብስብ በይነገጽን ለመድረስ ከWagtail Sidebar ወደ ቅንብሮች> ስብስቦች ይሂዱ።
ar: يمكنك التحكم في الوصول إلى مجموعات محددة من الصور والمستندات من خلال إعداد المجموعات. بشكل افتراضي ، تنتمي جميع الصور والمستندات إلى المجموعة الجذر ، ولكن يمكن للمستخدمين الذين لديهم أذونات مناسبة إنشاء مجموعات جديدة من واجهة المجموعات. انتقل إلى الإعدادات> المجموعات من شريط الذعرة الجانبي للوصول إلى واجهة المجموعات.

source: ![Collections Explorer](../../_static/images/collections/collections_explorer.png "Collections Explorer")
am: ![ክምችቶች አሳሽ](../../_static/images/collections/collections_explorer.png "Collections Explorer")
ar: ! [مستكشف المجموعات] (../../_ static / images / collections / collections_explorer.png "Collections Explorer")

source: Collections Explorer
am: ስብስቦች አሳሽ
ar: مستكشف المجموعات

source: ![Collections](../../_static/images/collections/collections.png "Collections")
am: ![ክምችቶች](../../_static/images/collections/collections.png "ስብስቦች")
ar: ! [المجموعات] (../../_ static / images / collections / collections.png "Collections")

source: Add a collection
am: ስብስብ ያክሉ
ar: أضف مجموعة

source: To create a collection, click **Add a collection** from the Collections interface. Then enter a name in the **Name** field and select a parent. Click **Create** to complete the creation process.
am: ስብስብ ለመፍጠር ከስብስብ በይነገጽ **ስብስብ አክል** የሚለውን ጠቅ ያድርጉ። ከዚያ በ ** ስም** መስክ ውስጥ ስም ያስገቡ እና ወላጅ ይምረጡ። የመፍጠር ሂደቱን ለማጠናቀቅ ** ፍጠር ** ን ጠቅ ያድርጉ።
ar: لإنشاء مجموعة ، انقر على ** إضافة مجموعة ** من واجهة المجموعات. ثم أدخل اسمًا في حقل ** الاسم ** وحدد أحد الوالدين. انقر فوق ** إنشاء ** لإكمال عملية الإنشاء.

source: ![Add Collections](../../_static/images/collections/add_collection.png "Add Collections")
am: ![ክምችቶችን አክል](../../_static/images/collections/add_collection.png "ስብስብ አክል")
ar: ! [إضافة مجموعات] (../../_ ثابت / صور / مجموعات / add_collection.png "إضافة مجموعات")

source: Add Collections
am: ስብስቦችን ያክሉ
ar: أضف مجموعات

source: Add images or documents to a collection
am: ምስሎችን ወይም ሰነዶችን ወደ ስብስብ ያክሉ
ar: أضف صورًا أو مستندات إلى مجموعة

source: To add images to a collection, click Images from the Wagtail sidebar and select a collection from the Collections dropdown. Then click Add an image and follow the instructions on the screen.
am: ምስሎችን ወደ ስብስብ ለማከል ከWagtail የጎን አሞሌ ላይ ምስሎችን ጠቅ ያድርጉ እና ከስብስብ ተቆልቋይ ውስጥ ስብስብን ይምረጡ። ከዚያ ምስል አክል የሚለውን ጠቅ ያድርጉ እና በስክሪኑ ላይ ያሉትን መመሪያዎች ይከተሉ።
ar: لإضافة صور إلى مجموعة ، انقر فوق الصور من الشريط الجانبي Wagtail وحدد مجموعة من قائمة Collections المنسدلة. ثم انقر فوق إضافة صورة واتبع التعليمات التي تظهر على الشاشة.

source: ![Image to Collections](../../_static/images/collections/image_to_collection.png "Image to Collections")
am: ![ሥዕል ወደ ስብስቦች](.../../_static/images/collections/image_to_collection.png "ምስል ወደ ስብስቦች")
ar: ! [صورة للمجموعات] (../../_ ثابت / صور / مجموعات / image_to_collection.png "صورة للمجموعات")

source: Image to Collections
am: ምስል ወደ ስብስቦች
ar: صورة للمجموعات

source: The process of adding documents to a collection is similar to that of images. Click Documents from the Sidebar and select a collection from the Collections dropdown. Then click Add a document and follow the instructions on the screen.
am: ሰነዶችን ወደ ክምችት የመጨመር ሂደት ከምስሎች ጋር ተመሳሳይ ነው. ከጎን አሞሌው ላይ ሰነዶችን ጠቅ ያድርጉ እና ከተቆልቋዩ ስብስቦች ውስጥ ስብስብ ይምረጡ። ከዚያ ሰነድ አክል የሚለውን ጠቅ ያድርጉ እና በስክሪኑ ላይ ያሉትን መመሪያዎች ይከተሉ።
ar: تشبه عملية إضافة المستندات إلى مجموعة تلك الخاصة بالصور. انقر فوق المستندات من الشريط الجانبي وحدد مجموعة من القائمة المنسدلة المجموعات. ثم انقر فوق إضافة مستند واتبع التعليمات التي تظهر على الشاشة.

source: It's possible to add an image or document to a collection while editing them. To do this, click Images or Documents from the Sidebar and select the image or document you want to add to a collection by clicking it. Then choose a collection from the Collection dropdown in the edit screen.
am: እነሱን በሚያስተካክሉበት ጊዜ ምስልን ወይም ሰነድን ወደ ስብስብ ማከል ይቻላል። ይህንን ለማድረግ ከጎን አሞሌው ላይ ምስሎችን ወይም ሰነዶችን ጠቅ ያድርጉ እና እሱን ጠቅ በማድረግ ወደ ክምችት ማከል የሚፈልጉትን ምስል ወይም ሰነድ ይምረጡ። ከዚያ በአርትዖት ማያ ገጹ ላይ ካለው የስብስብ ተቆልቋይ ውስጥ ስብስብ ይምረጡ።
ar: من الممكن إضافة صورة أو مستند إلى مجموعة أثناء تحريرها. للقيام بذلك ، انقر فوق الصور أو المستندات من الشريط الجانبي وحدد الصورة أو المستند الذي تريد إضافته إلى مجموعة بالنقر فوقه. ثم اختر مجموعة من قائمة المجموعة المنسدلة في شاشة التعديل.

source: ![Image to Collections](../../_static/images/collections/image_to_collection2.png "Image to Collections")
am: ![ሥዕል ወደ ስብስቦች](../../_static/images/collections/image_to_collection2.png "ምስል ወደ ስብስቦች")
ar: ! [صورة للمجموعات] (../../_ ثابت / صور / مجموعات / image_to_collection2.png "صورة للمجموعات")

source: You can also select a collection as part of uploading multiple images or documents.
am: እንዲሁም ብዙ ምስሎችን ወይም ሰነዶችን እንደ መስቀል አካል ስብስብ መምረጥ ይችላሉ።
ar: يمكنك أيضًا تحديد مجموعة كجزء من تحميل صور أو مستندات متعددة.

source: Privacy settings
am: የግላዊነት ቅንብሮች
ar: إعدادات الخصوصية

source: To set permissions to determine who is able to view documents within a collection, go to **Settings > Collections** and select a collection. Then click **Privacy** preceding the collection name.
am: በክምችት ውስጥ ሰነዶችን ማን ማየት እንደሚችል ለመወሰን ፈቃዶችን ለማዘጋጀት ወደ ** መቼቶች > ስብስቦች ** ይሂዱ እና ስብስብ ይምረጡ። ከዚያ ከስብስቡ ስም በፊት **ግላዊነት** የሚለውን ይጫኑ።
ar: لتعيين أذونات لتحديد من يمكنه عرض المستندات داخل مجموعة ، انتقل إلى ** الإعدادات> المجموعات ** وحدد مجموعة. ثم انقر فوق ** الخصوصية ** التي تسبق اسم المجموعة.

source: ![Collection Privacy](../../_static/images/collections/collection_privacy.png "Collection Privacy")
am: ![የስብስብ ግላዊነት](../../_static/images/collections/collection_privacy.png "የስብስብ ግላዊነት")
ar: ! [خصوصية المجموعة] (../../_ static / images / collections / collection_privacy.png "خصوصية المجموعة")

source: Collection Privacy
am: የስብስብ ግላዊነት
ar: خصوصية المجموعة

source: Clicking Privacy gives you a pop-up modal from which you can select the level of privacy for the collection.
am: ግላዊነትን ጠቅ ማድረግ ለስብስቡ የግላዊነት ደረጃን መምረጥ የሚችሉበት ብቅ ባይ ሞዳል ይሰጥዎታል።
ar: يمنحك النقر فوق الخصوصية نموذجًا منبثقًا يمكنك من خلاله تحديد مستوى الخصوصية للمجموعة.

source: ![Collection Privacy Options](../../_static/images/collections/collection_privacy_options.png "Collection Privacy Options")
am: ![የስብስብ ግላዊነት አማራጮች](../../_static/images/collections/collection_privacy_options.png "የስብስብ ግላዊነት አማራጮች"
ar: ! [خيارات خصوصية المجموعة] (../../_ static / images / collections / collection_privacy_options.png "خيارات خصوصية المجموعة")

source: Collection Privacy Options
am: የስብስብ ግላዊነት አማራጮች
ar: مجموعة خيارات الخصوصية

source: The permissions set on a collection apply to that collection and all collections below it in the hierarchy. Therefore, if you make the root collection private, all documents on the site become private. Permissions set in other collections only apply to those collections.
am: በክምችት ላይ የተቀመጡት ፈቃዶች ለዚያ ስብስብ እና ከሱ በታች ያሉ ሁሉም ስብስቦች በተዋረድ ላይ ተፈጻሚ ይሆናሉ። ስለዚህ, የስር ስብስብን የግል ካደረጉት, በጣቢያው ላይ ያሉ ሁሉም ሰነዶች የግል ይሆናሉ. በሌሎች ስብስቦች ውስጥ የተቀመጡ ፈቃዶች የሚተገበሩት በእነዚያ ስብስቦች ላይ ብቻ ነው።
ar: تنطبق الأذونات التي تم تعيينها على مجموعة على تلك المجموعة وجميع المجموعات الموجودة أسفلها في التسلسل الهرمي. لذلك ، إذا جعلت مجموعة الجذر خاصة ، فستصبح جميع المستندات الموجودة على الموقع خاصة. تنطبق الأذونات المعينة في المجموعات الأخرى على تلك المجموعات فقط.

source: Privacy settings added to a collection are only enforced for documents within the collection. Privacy settings do not apply to images.
am: ወደ ስብስብ የታከሉ የግላዊነት ቅንጅቶች በክምችቱ ውስጥ ላሉ ሰነዶች ብቻ ተፈጻሚ ይሆናሉ። የግላዊነት ቅንጅቶች በምስሎች ላይ አይተገበሩም።
ar: يتم فرض إعدادات الخصوصية المضافة إلى مجموعة فقط للمستندات داخل المجموعة. لا تنطبق إعدادات الخصوصية على الصور.

source: Documents
am: ሰነዶች
ar: وثائق
