Repository: ACMAD-Niamey/climweb
Catalog: docs/locales/*/LC_MESSAGES/_docs.po
Languages: am, ar

source: Assume you would like to have news on the website, the practical way to do it using the steps above would be:
am: በድረ-ገጹ ላይ ዜና እንዲኖርዎት ከፈለጉ ከዚህ በላይ ያሉትን ደረጃዎች በመጠቀም ይህንን ለማድረግ ተግባራዊ የሆነው መንገድ የሚከተለው ነው-
ar: لنفترض أنك ترغب في الحصول على أخبار على موقع الويب ، فإن الطريقة العملية للقيام بذلك باستخدام الخطوات المذكورة أعلاه ستكون:

source: Step 1: Create an news type
am: ደረጃ 1፡ የዜና አይነት ይፍጠሩ
ar: الخطوة 1: إنشاء نوع الأخبار

source: To create a news type, navigate to the 'Snippets' section on the explorer menu and select 'News Types' as below:
am: የዜና አይነት ለመፍጠር በአሳሽ ሜኑ ላይ ወደሚገኘው 'Snippets' ክፍል ይሂዱ እና 'የዜና አይነቶች'ን ከዚህ በታች ያለውን ይምረጡ፡-
ar: لإنشاء نوع أخبار ، انتقل إلى قسم "المقتطفات" في قائمة المستكشف وحدد "أنواع الأخبار" على النحو التالي:

source: News Explorer
am: ዜና አሳሽ
ar: مستكشف الأخبار

source: Click on 'Add news Type' to create a new news type.
am: አዲስ የዜና ዓይነት ለመፍጠር 'የዜና ዓይነት አክል' ላይ ጠቅ ያድርጉ።
ar: انقر فوق "إضافة نوع الأخبار" لإنشاء نوع أخبار جديد.

source: ![News Type](../../_static/images/news/add_news_type.png "News Type")
am: ![የዜና ዓይነት](.../../_static/images/news/add_news_type.png "የዜና ዓይነት")
ar: ! [نوع الأخبار] (../../_ static / images / news / add_news_type.png "نوع الأخبار")

source: News Type
am: የዜና ዓይነት
ar: نوع الأخبار

source: Provide news type name and choose an icon and save.
am: የዜና ዓይነት ስም ያቅርቡ እና አዶ ይምረጡ እና ያስቀምጡ።
ar: أدخل اسم نوع الأخبار واختر رمزًا واحفظه.

source: ![News Type](../../_static/images/news/news_type.png "News Type")
am: ![የዜና ዓይነት](.../../_static/images/news/news_type.png "የዜና ዓይነት")
ar: ! [نوع الأخبار] (../../_ static / images / news / news_type.png "نوع الأخبار")

source: Step 2: Create a news listing page
am: ደረጃ 2፡ የዜና ዝርዝር ገጽ ይፍጠሩ
ar: الخطوة 2: إنشاء صفحة قائمة الأخبار

source: A listing page is a page that holds a list of pages. For example, a news Listing page would hold one or more news. It lists the banner, latest featured news and all other news.
am: የዝርዝር ገጽ የገጾችን ዝርዝር የያዘ ገጽ ነው። ለምሳሌ፣ የዜና ዝርዝር ገጽ አንድ ወይም ከዚያ በላይ ዜናዎችን ይይዛል። ባነር፣ የቅርብ ጊዜ የቀረቡ ዜናዎችና ሌሎች ዜናዎችን ይዘረዝራል።
ar: صفحة القائمة هي صفحة تحتوي على قائمة من الصفحات. على سبيل المثال ، قد تحتوي صفحة قائمة الأخبار على خبر واحد أو أكثر. يسرد اللافتة وآخر الأخبار المميزة وجميع الأخبار الأخرى.

source: ![News List Preview](../../_static/images/news/news_list_preview.png "News List Preview")
am: ![የዜና ዝርዝር ቅድመ እይታ](../../_static/images/news/news_list_preview.png "የዜና ዝርዝር ቅድመ እይታ")
ar: ! [معاينة قائمة الأخبار] (../../_ static / images / news / news_list_preview.png "معاينة قائمة الأخبار")

source: News List Preview
am: የዜና ዝርዝር ቅድመ እይታ
ar: معاينة قائمة الأخبار

source: Note: This option will only appear if no news listing page already exists as there can only be on instance/occurrrence of a news listing page.
am: ማሳሰቢያ፡ ይህ አማራጭ የዜና ዝርዝር ገፅ ከሌለ ብቻ ነው ምክንያቱም የዜና ዝርዝር ገፅ ላይ ብቻ ሊከሰት ይችላል።
ar: ملاحظة: سيظهر هذا الخيار فقط في حالة عدم وجود صفحة قائمة أخبار بالفعل حيث لا يمكن أن يكون هناك سوى مثيل / حدوث صفحة قائمة أخبار.

source: Select news List Page from the type of pages provided.
am: ከቀረቡት ገጾች ዓይነት የዜና ዝርዝር ገጽን ይምረጡ።
ar: حدد صفحة قائمة الأخبار من نوع الصفحات المقدمة.

source: ![Add News List Page](../../_static/images/news/add_news_list.png "Add News List Page")
am: ![የዜና ዝርዝር ገፅ አክል](../../_static/images/news/add_news_list.png "የዜና ዝርዝር ገፅ አክል")
ar: ! [إضافة صفحة قائمة الأخبار] (../../_ static / images / news / add_news_list.png "إضافة صفحة قائمة الأخبار")

source: Add News List Page
am: የዜና ዝርዝር ገጽ ያክሉ
ar: أضف صفحة قائمة الأخبار

source: Provide a the page title, banner image, title, subtitle and call to action and either save draft, publish or submit to moderation depending on your previlleges.
am: የገጹን ርዕስ፣ የሰንደቅ ምስል፣ ርዕስ፣ የትርጉም ጽሑፍ እና የድርጊት ጥሪ ያቅርቡ እና ረቂቅ ያስቀምጡ፣ ያትሙ ወይም በቅድመ-ቪሌጅዎ ላይ በመመስረት ለሽምግልና ያስገቡ።
ar: قم بتوفير عنوان الصفحة ، وصورة الشعار ، والعنوان ، والعنوان الفرعي ، وعبارة تحث المستخدم على اتخاذ إجراء وإما حفظ المسودة أو النشر أو الإرسال للمراجعة بناءً على ما لديك.

source: ![Add News List Page](../../_static/images/news/news_list_page.png "Add News List Page")
am: ![የዜና ዝርዝር ገፅ አክል](../../_static/images/news/news_list_page.png "የዜና ዝርዝር ገፅ አክል")
ar: ! [إضافة صفحة قائمة الأخبار] (../../_ static / images / news / news_list_page.png "إضافة صفحة قائمة الأخبار")

source: Step 3: Create a news page
am: ደረጃ 3፡ የዜና ገጽ ይፍጠሩ
ar: الخطوة 3: قم بإنشاء صفحة أخبار

source: This will navigate to the list of pages under the home page including the news list page you just created. Hover over the the news listing page and click on 'add child page'.
am: ይህ አሁን የፈጠርከውን የዜና ዝርዝር ገፅ ጨምሮ በመነሻ ገጹ ስር ወዳለው የገጾች ዝርዝር ይሄዳል። በዜና ዝርዝር ገጹ ላይ ያንዣብቡ እና 'የልጅ ገጽ ያክሉ' ላይ ጠቅ ያድርጉ።
ar: سينتقل هذا إلى قائمة الصفحات الموجودة أسفل الصفحة الرئيسية بما في ذلك صفحة قائمة الأخبار التي أنشأتها للتو. قم بالمرور فوق صفحة قائمة الأخبار وانقر فوق "إضافة صفحة فرعية".

source: ![Add news Page](../../_static/images/news/add_news.png "Add news Page")
am: ![የዜና ገፅ አክል](../../_static/images/news/add_news.png "የዜና ገፅ አክል")
ar: ! [إضافة صفحة أخبار] (../../_ ثابت / صور / أخبار / add_news.png "إضافة صفحة أخبار")

source: Add news Page
am: የዜና ገጽ ያክሉ
ar: أضف صفحة أخبار

source: ![News Page Sections](../../_static/images/news/news_sections.png "News Page Sections")
am: ![የዜና ገፅ ክፍሎች](../../_static/images/news/news_sections.png "የዜና ገፅ ክፍሎች")
ar: ! [أقسام صفحة الأخبار] (../../_ static / images / news / news_sections.png "أقسام صفحة الأخبار")

source: News Page Sections
am: የዜና ገጽ ክፍሎች
ar: أقسام صفحة الأخبار

source: The sections of a service page include:
am: የአገልግሎት ገጽ ክፍሎች የሚከተሉትን ያካትታሉ:
ar: تشمل أقسام صفحة الخدمة ما يلي:

source: **News Type** - selected from previously prepared news type in step 1
am: **የዜና ዓይነት** - ከዚህ ቀደም ከተዘጋጀው የዜና ዓይነት በደረጃ 1 ተመርጧል
ar: ** نوع الأخبار ** - محدد من نوع الأخبار المعدة مسبقًا في الخطوة 1

source: **Relevant Service** - selected from previously prepared service categories. Refer to [Create Services Categories Section](./Manage-Services#step-1-create-an-agromet-service-category) to create service categories.
am: ** አግባብነት ያለው አገልግሎት *** - ከዚህ ቀደም ከተዘጋጁ የአገልግሎት ምድቦች የተመረጠ። የአገልግሎት ምድቦችን ለመፍጠር [የአገልግሎቶችን ምድቦች ፍጠር](./Services#step-1-create-an-agromet-service-category) የሚለውን ይመልከቱ።
ar: ** الخدمة ذات الصلة ** - مختارة من فئات الخدمة المعدة مسبقًا. راجع [إنشاء قسم فئات الخدمات] (./ إدارة الخدمات # الخطوة 1-إنشاء فئة خدمة agromet) لإنشاء فئات الخدمة.

source: **Relevant Projects** - select from previously prepared projects. Please refer [Manage Projects](./Manage-Projects) to guide on creation of projects.
am: ** ተዛማጅ ፕሮጀክቶች *** - ከዚህ ቀደም ከተዘጋጁ ፕሮጀክቶች ውስጥ ይምረጡ። እባክዎን የፕሮጀክቶችን አፈጣጠር ለመምራት [ፕሮጀክቶችን ያስተዳድሩ](./Projects) ይመልከቱ።
ar: ** المشاريع ذات الصلة ** - اختر من المشاريع المعدة مسبقًا. يرجى الرجوع إلى [إدارة المشاريع] (./ إدارة المشاريع) للإرشاد بشأن إنشاء المشاريع.

source: **Post date** - the date the news was published
am: **የድህረ ቀን** - ዜናው የታተመበት ቀን
ar: ** تاريخ النشر ** - تاريخ نشر الخبر

source: **Subtitle** - optional subtitle
am: ** ንዑስ ርዕስ *** - አማራጭ ንዑስ ርዕስ
ar: ** الترجمة ** - الترجمة الاختيارية

source: **Body** - the body of the news
am: ** አካል *** - የዜና አካል
ar: ** الهيئة ** - متن الخبر

source: **Tags** - tags related to the news
am: ** መለያዎች *** - ከዜና ጋር የተያያዙ መለያዎች
ar: ** العلامات ** - العلامات المتعلقة بالأخبار

source: **Extra Links** - additional links
am: ** ተጨማሪ ማገናኛዎች *** - ተጨማሪ ማገናኛዎች
ar: ** روابط إضافية ** - روابط إضافية

source: **Is featured** - If enabled, the news will appear as Featured news on the news listing page
am: ** ተለይቶ የቀረበ *** - ከነቃ ዜናው በዜና ዝርዝር ገጽ ላይ እንደ ተለይቶ የቀረበ ዜና ሆኖ ይታያል
ar: ** مميز ** - في حالة التمكين ، ستظهر الأخبار كأخبار مميزة في صفحة قائمة الأخبار

source: **Is visible on homepage** - If enabled, the news will appear in the homepage as an alert/latest update
am: **በመነሻ ገጽ ላይ ይታያል** - ከነቃ ዜናው በመነሻ ገጹ ላይ እንደ ማንቂያ/የቅርብ ጊዜ ማሻሻያ ሆኖ ይታያል።
ar: ** مرئي على الصفحة الرئيسية ** - في حالة التمكين ، ستظهر الأخبار في الصفحة الرئيسية كتنبيه / آخر تحديث

source: Note: To create additional news in the future you would need to begin from [Step 3: Create a news page](./Manage-news#step-3-create-a-news-page) if the desired news type is already defined.
am: ማሳሰቢያ፡ ለወደፊት ተጨማሪ ዜናዎችን ለመፍጠር የሚፈለገው የዜና አይነት ከሆነ ከ[ደረጃ 3፡ የዜና ገጽ ይፍጠሩ](./Manage-news#step-3-create-a-news-page) መጀመር ያስፈልግዎታል። ተገልጿል.
ar: ملاحظة: لإنشاء أخبار إضافية في المستقبل ، يجب أن تبدأ من [الخطوة 3: إنشاء صفحة أخبار] (./ Manage-news # step-3-create-a-news-page) إذا كان نوع الخبر المطلوب بالفعل مُعرف.

source: Products
am: ምርቶች
ar: منتجات

source: The creation of products follows the steps below:
am: የምርት መፍጠሪያው የሚከተሉትን ደረጃዎች ይከተላል.
ar: يتبع إنشاء المنتجات الخطوات التالية:

source: Creation of a product and a service category
am: የምርት እና የአገልግሎት ምድብ መፍጠር
ar: إنشاء منتج وفئة خدمة

source: Creation of one or more product categories for each of the products
am: ለእያንዳንዱ ምርቶች አንድ ወይም ከዚያ በላይ የምርት ምድቦች መፍጠር
ar: إنشاء فئة منتجات واحدة أو أكثر لكل منتج

source: Creation of one or more product item types for each of the product categories
am: ለእያንዳንዱ የምርት ምድቦች አንድ ወይም ከዚያ በላይ የምርት ንጥል ዓይነቶች መፍጠር
ar: إنشاء نوع أو أكثر من أنواع عناصر المنتجات لكل فئة من فئات المنتجات

source: Creation of a product page that will serve all products for a specific category
am: ሁሉንም ምርቶች ለተወሰነ ምድብ የሚያገለግል የምርት ገጽ መፍጠር
ar: إنشاء صفحة منتج تخدم جميع المنتجات لفئة معينة

source: Creation of one or more product items for a product page
am: ለአንድ ምርት ገጽ አንድ ወይም ከዚያ በላይ የምርት እቃዎች መፍጠር
ar: إنشاء عنصر منتج واحد أو أكثر لصفحة منتج

source: Product Creation Example Scenario
am: የምርት መፈጠር ምሳሌ ሁኔታ
ar: سيناريو مثال إنشاء المنتج

source: Assume you would like to have Dekadal Agromet Bulletin Products on the website, the practical way to do it using the steps above would be:
am: Dekadal Agromet Bulletin Products በድረ-ገጹ ላይ እንዲኖርዎት እንደሚፈልጉ ያስቡ፣ ከላይ ያሉትን ደረጃዎች በመጠቀም ይህንን ለማድረግ ተግባራዊ የሆነው መንገድ፡-
ar: لنفترض أنك ترغب في الحصول على منتجات Dekadal Agromet Bulletin على موقع الويب ، فإن الطريقة العملية للقيام بذلك باستخدام الخطوات المذكورة أعلاه ستكون:

source: Step 1: Create an 'Agromet Service Category' and a 'Dekadal Agromet Bulletin' Product
am: ደረጃ 1፡ 'Agromet Service Category' እና 'Dekadal Agromet Bulletin' ምርት ይፍጠሩ
ar: الخطوة 1: قم بإنشاء "فئة خدمة Agromet" ومنتج "Dekadal Agromet Bulletin"

source: To create a service, navigate to the 'Snippets' section on the explorer menu and select 'Servies' as below:
am: አገልግሎት ለመፍጠር በአሳሽ ሜኑ ላይ ወደሚገኘው 'Snippets' ክፍል ይሂዱ እና 'አገልግሎት'ን ከዚህ በታች ያለውን ይምረጡ፡-
ar: لإنشاء خدمة ، انتقل إلى قسم "المقتطفات" في قائمة المستكشف وحدد "الخدمات" على النحو التالي:

source: Services Explorer
am: አገልግሎቶች አሳሽ
ar: مستكشف الخدمات

source: Click on 'Add service' to create a new service.
am: አዲስ አገልግሎት ለመፍጠር 'አገልግሎት አክል' ላይ ጠቅ ያድርጉ።
ar: انقر فوق "إضافة خدمة" لإنشاء خدمة جديدة.

source: ![Services Category](../../_static/images/products/add_service_category.png "Services Category")
am: ![የአገልግሎቶች ምድብ](../../_static/images/products/add_service_category.png "የአገልግሎቶች ምድብ")
ar: ! [فئة الخدمات] (../../_ static / images / products / add_service_category.png "فئة الخدمات")

source: Services Category
am: የአገልግሎት ምድብ
ar: فئة الخدمات

source: Provide service category name and choose an icon and save.
am: የአገልግሎት ምድብ ስም ያቅርቡ እና አዶ ይምረጡ እና ያስቀምጡ።
ar: أدخل اسم فئة الخدمة واختر رمزًا واحفظه.

source: ![Services Category](../../_static/images/products/service_category.png "Services Category")
am: ![የአገልግሎቶች ምድብ](../../_static/images/products/service_category.png "የአገልግሎቶች ምድብ")
ar: ! [فئة الخدمات] (../../_ ثابت / صور / منتجات / service_category.png "فئة الخدمات")

source: To create a product, navigate to the 'Snippets' section on the explorer menu and select 'Products' as below:
am: አንድ ምርት ለመፍጠር በአሳሽ ምናሌው ላይ ወደ 'Snippets' ክፍል ይሂዱ እና 'ምርቶች'ን ከዚህ በታች ይምረጡ፡-
ar: لإنشاء منتج ، انتقل إلى قسم "المقتطفات" في قائمة المستكشف وحدد "المنتجات" على النحو التالي:

source: ![Products Explorer](../../_static/images/products/products_explorer.png "Products Explorer")
am: ![ምርቶች አሳሽ](../../_static/images/products/products_explorer.png "ምርቶች አሳሽ")
ar: ! [مستكشف المنتجات] (../../_ static / images / products / products_explorer.png "مستكشف المنتجات")

source: Products Explorer
am: ምርቶች አሳሽ
ar: مستكشف المنتجات

source: Click on 'Add product' to create a new product.
am: አዲስ ምርት ለመፍጠር 'ምርት አክል' ላይ ጠቅ ያድርጉ።
ar: انقر فوق "إضافة منتج" لإنشاء منتج جديد.

source: ![Add Product](../../_static/images/products/add_product.png "Add Product")
am: ![ምርት አክል](../../_static/images/products/add_product.png "ምርት አክል")
ar: ! [إضافة منتج] (../../_ static / images / products / add_product.png "إضافة منتج")

source: Add Product
am: ምርት አክል
ar: أضف منتج

source: Fill in the form providing the name of the product e.g Dekadal Agromet Bulletin
am: የምርቱን ስም የሚያቀርብ ቅጹን ይሙሉ ለምሳሌ Dekadal Agromet Bulletin
ar: املأ النموذج الذي يوضح اسم المنتج ، على سبيل المثال Dekadal Agromet Bulletin

source: ![Add Product](../../_static/images/products/add_product_name.png "Add Product")
am: ![ምርት አክል](../../_static/images/products/add_product_name.png "ምርት አክል")
ar: ! [إضافة منتج] (../../_ static / images / products / add_product_name.png "إضافة منتج")

source: Step 2: Creation of one or more product categories for each of the products
am: ደረጃ 2፡ ለእያንዳንዱ ምርቶች አንድ ወይም ከዚያ በላይ የምርት ምድቦች መፍጠር
ar: الخطوة 2: إنشاء فئة منتج واحدة أو أكثر لكل منتج

source: Create a product category based on sections measured and reported in Dekadal Agrometeorology providing the name and icon e.g
am: በDekadal Agrometeorology ውስጥ በተለካው እና በተዘገበባቸው ክፍሎች ላይ በመመስረት የምርት ምድብ ስም እና አዶን በማቅረብ የምርት ምድብ ይፍጠሩ ለምሳሌ
ar: قم بإنشاء فئة منتج بناءً على الأقسام التي تم قياسها والإبلاغ عنها في Dekadal Agrometeorology مع توفير الاسم والرمز على سبيل المثال

source: Category 1 - Weather Assessment
am: ምድብ 1 - የአየር ሁኔታ ግምገማ
ar: الفئة 1 - تقييم الطقس

source: Category 2 - Agrometeorological conditions and impact on agriculture
am: ምድብ 2 - አግሮሜትሪ ሁኔታዎች እና በግብርና ላይ ተጽእኖ
ar: الفئة 2 - ظروف الأرصاد الجوية الزراعية وتأثيرها على الزراعة

source: Category 3 - Bulletin
am: ምድብ 3 - ቡለቲን
ar: الفئة 3 - النشرة

source: ![Add Product](../../_static/images/products/add_product_categories.png "Add Product")
am: ![ምርት አክል](.../../_static/images/products/add_product_categories.png "ምርት አክል")
ar: ! [إضافة منتج] (../../_ ثابت / صور / منتجات / add_product_categories.png "إضافة منتج")

source: Category 1 and 2 can contain text and images and allows you to break down your bulletin into sharable sections while category 3 can hold the bulletin file/document for download by users. A preview of these categories to the public would appear as below on the website.
am: ምድብ 1 እና 2 ጽሑፍ እና ምስሎችን ሊይዝ ይችላል እና ማስታወቂያዎን ወደ ሊጋሩ የሚችሉ ክፍሎች እንዲከፋፍሉ ያስችልዎታል ፣ ምድብ 3 ደግሞ በተጠቃሚዎች ለማውረድ የማስታወቂያ ፋይሉን/ሰነዱን ይይዛል። የእነዚህ ምድቦች ቅድመ-እይታ ለህዝብ ከዚህ በታች በድረ-ገጹ ላይ ይታያል።
ar: يمكن أن تحتوي الفئة 1 و 2 على نصوص وصور وتسمح لك بتقسيم النشرة إلى أقسام قابلة للمشاركة بينما يمكن للفئة 3 الاحتفاظ بملف / وثيقة النشرة لتنزيلها من قبل المستخدمين. ستظهر معاينة هذه الفئات للجمهور على النحو التالي على موقع الويب.

source: ![Add Product](../../_static/images/products/product_preview.png "Add Product")
am: ![ምርት አክል](.../../_static/images/products/product_preview.png "ምርት አክል")
ar: ! [إضافة منتج] (../../_ static / images / products / product_preview.png "إضافة منتج")

source: Step 3: Creation of one or more product item types for each of the product categories
am: ደረጃ 3፡ ለእያንዳንዱ የምርት ምድቦች አንድ ወይም ከዚያ በላይ የምርት ንጥል ዓይነቶች መፍጠር
ar: الخطوة 3: إنشاء نوع أو أكثر من أنواع عناصر المنتجات لكل فئة من فئات المنتجات

source: For each of the three categories above, you can now add product item types e.g
am: ከላይ ላለው ለእያንዳንዱ ሶስት ምድቦች አሁን የምርት ንጥል ዓይነቶችን ማከል ይችላሉ ለምሳሌ
ar: لكل فئة من الفئات الثلاث المذكورة أعلاه ، يمكنك الآن إضافة أنواع عناصر المنتج ، على سبيل المثال

source: **Category 1** - Weather Assessment
am: ** ምድብ 1 *** - የአየር ሁኔታ ግምገማ
ar: ** الفئة 1 ** - تقييم الطقس

source: |_ Rainfall Amount
am: | የዝናብ መጠን
ar: | _ كمية الأمطار

source: |_ Rainfall Anomaly
am: | _ የዝናብ አኖማሊ
ar: | _ شذوذ هطول الأمطار

source: |_ Moisture Condition
am: | _ የእርጥበት ሁኔታ
ar: | _ حالة الرطوبة

source: **Category 2** - Agrometeorological conditions and impact on agriculture
am: ** ምድብ 2 *** - አግሮሜትሪ ሁኔታዎች እና በግብርና ላይ ተጽእኖ
ar: ** الفئة 2 ** - ظروف الأرصاد الجوية الزراعية وتأثيرها على الزراعة

source: |_ Vegetation Condition & Impact on Agriculture
am: | _ የእፅዋት ሁኔታ እና በእርሻ ላይ ያለው ተጽእኖ
ar: | _ حالة الغطاء النباتي وتأثيره على الزراعة

source: **Category 3** - Bulletin
am: ** ምድብ 3 *** - ማስታወቂያ
ar: ** الفئة 3 ** - النشرة

source: |_ Document
am: |__ ሰነድ
ar: | _ المستند

source: ![Add Product Item](../../_static/images/products/add_product_item_types.png "Add Product Item")
am: ![የምርት ንጥል ነገር አክል](../../_static/images/products/add_product_item_types.png "የምርት ንጥል ነገር አክል")
ar: ! [إضافة عنصر منتج] (../../_ ثابت / صور / منتجات / add_product_item_types.png "إضافة عنصر منتج")

source: Add Product Item
am: የምርት ንጥል ያክሉ
ar: أضف عنصر المنتج

source: A preview of these product item types to the public would appear as below on the website.
am: የእነዚህ የምርት ንጥል ዓይነቶች ቅድመ-ዕይታ ለሕዝብ ከዚህ በታች በድር ጣቢያው ላይ ይታያል።
ar: ستظهر معاينة لأنواع عناصر المنتجات هذه للجمهور على النحو التالي على موقع الويب.

source: Step 4: Creation of a product page that will serve all products for a specific category
am: ደረጃ 4፡ ሁሉንም ምርቶች ለተወሰነ ምድብ የሚያገለግል የምርት ገጽ መፍጠር
ar: الخطوة 4: إنشاء صفحة منتج تخدم جميع المنتجات لفئة معينة

source: Once a product, its categories and items have been defined, a product page can be created to hold all products linked to it. To create this, navigate to 'pages' in the explorer menu and click on products.
am: አንድ ምርት፣ ምድቦቹ እና እቃዎቹ ከተገለጹ፣ ከእሱ ጋር የተገናኙትን ሁሉንም ምርቶች ለመያዝ የምርት ገጽ ሊፈጠር ይችላል። ይህንን ለመፍጠር በአሳሽ ሜኑ ውስጥ ወደ 'ገጾች' ይሂዱ እና ምርቶች ላይ ጠቅ ያድርጉ።
ar: بمجرد تحديد المنتج وفئاته وعناصره ، يمكن إنشاء صفحة منتج للاحتفاظ بجميع المنتجات المرتبطة به. لإنشاء هذا ، انتقل إلى "الصفحات" في قائمة المستكشف وانقر على المنتجات.

source: ![Add Product Page](../../_static/images/products/add_product_page.png "Add Product Page")
am: ![የምርት ገጽ አክል](../../_static/images/products/add_product_page.png "የምርት ገጽ አክል")
ar: ! [إضافة صفحة منتج] (../../_ static / images / products / add_product_page.png "إضافة صفحة منتج")

source: Add Product Page
am: የምርት ገጽ ያክሉ
ar: أضف صفحة المنتج

source: Click on the three dots and select 'Add child pages'
am: በሶስት ነጥቦች ላይ ጠቅ ያድርጉ እና 'የልጅ ገጾችን ያክሉ' የሚለውን ይምረጡ
ar: انقر على النقاط الثلاث وحدد "إضافة صفحات فرعية"

source: ![Add Product Child Page](../../_static/images/products/add_product_child_page.png "Add Product Child Page")
am: ![የምርት የልጅ ገጽ አክል](../../_static/images/products/add_product_child_page.png "የምርት የልጅ ገጽ አክል")
ar: ! [إضافة صفحة فرعية للمنتج] (../../_ static / images / products / add_product_child_page.png "إضافة صفحة فرعية للمنتج")

source: Add Product Child Page
am: የምርት የልጅ ገጽን ያክሉ
ar: أضف صفحة فرعية للمنتج

source: Choose the relevant service category and product as below. Fill in another necessary and optional inputs including an introduction section, introduction image and text that will appear at the top of the Dekadal Agromet Bulletin Page.
am: ከዚህ በታች እንደሚታየው ተገቢውን የአገልግሎት ምድብ እና ምርት ይምረጡ። በDekadal Agromet Bulletin Page አናት ላይ የሚታየውን የመግቢያ ክፍል፣ የመግቢያ ምስል እና ጽሑፍን ጨምሮ ሌላ አስፈላጊ እና አማራጭ ግብአቶችን ይሙሉ።
ar: اختر فئة الخدمة والمنتج المناسبين على النحو التالي. املأ المدخلات الضرورية والاختيارية الأخرى بما في ذلك قسم المقدمة وصورة المقدمة والنص الذي سيظهر في أعلى صفحة نشرة Dekadal Agromet.

source: ![Add Product Child Page](../../_static/images/products/product_child_page.png "Add Product Child Page")
am: ![የምርት የልጅ ገጽ አክል](../../_static/images/products/product_child_page.png "የምርት የልጅ ገጽ አክል")
ar: ! [إضافة صفحة فرعية للمنتج] (../../_ static / images / products / product_child_page.png "إضافة صفحة فرعية للمنتج")

source: Save draft / Publish page.
am: ረቂቅ አስቀምጥ/ገጽ አትም
ar: حفظ المسودة / نشر الصفحة.

source: Step 5: Creation of one or more product items for a product page
am: ደረጃ 5፡ ለአንድ ምርት ገጽ አንድ ወይም ከዚያ በላይ የምርት እቃዎችን መፍጠር
ar: الخطوة 5: إنشاء عنصر منتج واحد أو أكثر لصفحة منتج

source: Add a product item by hovering over Dekadal Agromet Bulletin and selecting 'add child page'.
am: በDekadal Agromet Bulletin ላይ በማንዣበብ እና 'የልጅን ገፅ አክል' የሚለውን በመምረጥ የምርት ንጥል ያክሉ።
ar: أضف عنصر منتج عن طريق تمرير مؤشر الماوس فوق نشرة Dekadal Agromet واختيار "إضافة صفحة فرعية".

source: ![Add Product Item](../../_static/images/products/product_item.png "Add Product Item")
am: ![የምርት ንጥል ነገር አክል](../../_static/images/products/product_item.png "የምርት ንጥል ነገር አክል")
ar: ! [إضافة عنصر منتج] (../../_ static / images / products / product_item.png "إضافة عنصر منتج")

source: For example, you can add a product item for **1 - 10 June 2023** , by specifying the date, valid until and products.
am: ለምሳሌ ለ **1 - 10 ሰኔ 2023** ቀኑን በመግለጽ የምርት እቃ ማከል ይችላሉ እስከ እና ምርቶች።
ar: على سبيل المثال ، يمكنك إضافة عنصر منتج لـ ** 1-10 يونيو 2023 ** ، من خلال تحديد التاريخ ، وصالح حتى والمنتجات.

source: ![Add Product Item Page](../../_static/images/products/product_item_page.png "Add Product Item Page")
am: ![የምርት ንጥል ነገር ገጽ አክል](../../_static/images/products/product_item_page.png "የምርት ንጥል ነገር ገጽ አክል")
ar: ! [إضافة صفحة عنصر المنتج] (../../_ static / images / products / product_item_page.png "إضافة صفحة عنصر المنتج")

source: Add Product Item Page
am: የምርት ንጥል ገጽ ያክሉ
ar: إضافة صفحة عنصر المنتج

source: The 'products' input accepts two options:
am: የ'ምርቶች' ግቤት ሁለት አማራጮችን ይቀበላል፡-
ar: يقبل إدخال "المنتجات" خيارين:

source: Map/Image Product
am: የካርታ/የምስል ምርት
ar: خريطة / صورة المنتج

source: Document/Bulletin Product
am: ሰነድ/ማስታወቂያ ምርት
ar: منتج الوثيقة / النشرة

source: ![Add Product Options](../../_static/images/products/product_options.png "Add Product Options")
am: ![የምርት አማራጮችን አክል](../../_static/images/products/product_options.png "የምርት አማራጮችን አክል")
ar: ! [إضافة خيارات المنتج] (../../_ static / images / products / product_options.png "إضافة خيارات المنتج")

source: Add Product Options
am: የምርት አማራጮችን ያክሉ
ar: إضافة خيارات المنتج

source: An example of a product based on Map/Image product would be the type 'Rainfall Amount'
am: በካርታ/ምስል ምርት ላይ የተመሰረተ የምርት ምሳሌ 'የዝናብ መጠን' አይነት ሊሆን ይችላል።
ar: مثال على منتج يعتمد على منتج Map / Image سيكون من النوع "Rainfall Amount"

source: ![Add Product Options](../../_static/images/products/product_options_map_image.png "Add Product Options")
am: ![የምርት አማራጮችን አክል](../../_static/images/products/product_options_map_image.png "የምርት አማራጮችን አክል")
ar: ! [إضافة خيارات المنتج] (../../_ static / images / products / product_options_map_image.png "إضافة خيارات المنتج")

source: An example of a product based on Document/Bulletin product would be the type 'Document'
am: በሰነድ/ማስታወቂያ ምርት ላይ የተመሰረተ የምርት ምሳሌ እንደ 'ሰነድ' ይሆናል
ar: مثال على منتج يعتمد على منتج Document / Bulletin سيكون من النوع "Document"

source: ![Add Product Options](../../_static/images/products/product_options_document.png "Add Product Options")
am: ![የምርት አማራጮችን አክል](../../_static/images/products/product_options_document.png "የምርት አማራጮችን አክል")
ar: ! [إضافة خيارات المنتج] (../../_ static / images / products / product_options_document.png "إضافة خيارات المنتج")

source: Note: When adding a new bulletin, you will only need to begin from Step 5: [Creation of one or more product items for a product page](Manage-Products#step-5-creation-of-one-or-more-product-items-for-a-product-page) section above to upload the document or any related text and images about a new period.
am: ማሳሰቢያ፡ አዲስ ማስታወቂያ ሲያክሉ ከደረጃ 5 ጀምሮ መጀመር ብቻ ያስፈልግዎታል፡ [ለአንድ ምርት ገጽ አንድ ወይም ከዚያ በላይ የሆኑ የምርት እቃዎችን መፍጠር](ምርቶችን ያስተዳድሩ#ደረጃ-5-የአንድ-ወይም ተጨማሪ-መፍጠር) ምርት-ንጥሎች-ለአንድ-ምርት-ገጽ) ከላይ ያለውን ክፍል ሰነዱን ወይም ማንኛውንም ተዛማጅ ጽሑፍ እና ምስሎችን ለመስቀል።
ar: ملاحظة: عند إضافة نشرة جديدة ، ستحتاج فقط إلى البدء من الخطوة 5: [إنشاء عنصر منتج واحد أو أكثر لصفحة منتج] (إدارة المنتجات # الخطوة 5-إنشاء واحد أو أكثر- product-items-for-a-product-page) أعلاه لتحميل المستند أو أي نصوص وصور ذات صلة حول فترة جديدة.

source: Publications
am: ህትመቶች
ar: المنشورات
