Repository: ACMAD-Niamey/climweb
Catalog: docs/locales/*/LC_MESSAGES/_docs.po
Languages: am, ar

source: Find Your Way Around
am: መንገድህን ፈልግ
ar: جد طريقك بالقرب من هنا

source: This section describes the different pages that you are going to see as you navigate around the NMHS Content Management System Admin interface.
am: ይህ ክፍል በኤንኤምኤችኤስ የይዘት አስተዳደር ስርዓት አስተዳዳሪ በይነገጽ ዙሪያ ሲሄዱ የሚያዩዋቸውን የተለያዩ ገፆች ይገልጻል።
ar: يصف هذا القسم الصفحات المختلفة التي ستراها وأنت تتنقل حول واجهة إدارة نظام إدارة المحتوى في NMHS.

source: How to reach the Dashboard
am: ወደ ዳሽቦርዱ እንዴት እንደሚደርሱ
ar: كيف تصل إلى لوحة القيادة

source: The CMS login button can be found at the top left corner of the website.
am: የCMS መግቢያ ቁልፍ በድረ-ገጹ ላይኛው ግራ ጥግ ላይ ይገኛል።
ar: يمكن العثور على زر تسجيل الدخول إلى CMS في الزاوية اليسرى العليا من الموقع.

source: ![Access Dashboard](../_static/images/navigating/access_dashboard.png "Access Dashboard")
am: ![ዳሽቦርድ ይድረሱ](../_static/images/navigating/access_dashboard.png "ዳሽቦርድ ይድረሱ")
ar: ! [لوحة التحكم في الوصول] (../_ static / images / navigating / access_dashboard.png "الوصول إلى لوحة التحكم")

source: Access Dashboard
am: ዳሽቦርድ ይድረሱ
ar: الوصول إلى لوحة القيادة

source: Logging into the CMS automatically takes you to the Dashboard. If you navigate away from the dashboard, you can return to it at any time by clicking on the NMHS logo in the top-left section of your screen.
am: ወደ ሲኤምኤስ መግባት በራስ ሰር ወደ ዳሽቦርድ ይወስደዎታል። ከዳሽቦርዱ ርቀው ከሄዱ፣ በማያ ገጹ ላይኛው ግራ ክፍል ላይ ያለውን የNMHS አርማ ጠቅ በማድረግ በማንኛውም ጊዜ ወደ እሱ መመለስ ይችላሉ።
ar: ينقلك تسجيل الدخول إلى نظام إدارة المحتوى تلقائيًا إلى لوحة التحكم. إذا انتقلت بعيدًا عن لوحة القيادة ، فيمكنك العودة إليها في أي وقت بالنقر فوق شعار NMHS في القسم العلوي الأيسر من شاشتك.

source: The Dashboard
am: ዳሽቦርዱ
ar: لوحة القيادة

source: The Dashboard is the main hub of the website. From the dashboard, you can access all of the content you create in the CMS as well as reports, settings, and other content management features.
am: ዳሽቦርዱ የድረ-ገጹ ዋና ማዕከል ነው። ከዳሽቦርዱ ሆነው በሲኤምኤስ ውስጥ የሚፈጥሯቸውን ሁሉንም ይዘቶች እንዲሁም ሪፖርቶችን፣ ቅንብሮችን እና ሌሎች የይዘት አስተዳደር ባህሪያትን ማግኘት ይችላሉ።
ar: لوحة القيادة هي المحور الرئيسي للموقع. من لوحة التحكم ، يمكنك الوصول إلى كل المحتوى الذي تقوم بإنشائه في نظام إدارة المحتوى بالإضافة إلى التقارير والإعدادات وميزات إدارة المحتوى الأخرى.

source: ![Dashboard](../_static/images/navigating/dashboard.png "Dashboard")
am: ![ዳሽቦርድ](../_static/images/navigating/dashboard.png "ዳሽቦርድ")
ar: ! [Dashboard] (../_ static / images / navigating / dashboard.png "لوحة التحكم")

source: Dashboard
am: ዳሽቦርድ
ar: لوحة القيادة

source: What you see in your Dashboard depends on your user role. Common user roles include editors, moderators, composers, approvers, forecasters and administrators.
am: በእርስዎ ዳሽቦርድ ውስጥ የሚያዩት ነገር በእርስዎ የተጠቃሚ ሚና ላይ የተመሰረተ ነው። የተለመዱ የተጠቃሚ ሚናዎች አርታዒዎች፣ አወያዮች፣ አቀናባሪዎች፣ አጽዳቂዎች፣ ትንበያ ሰጪዎች እና አስተዳዳሪዎች ያካትታሉ።
ar: يعتمد ما تراه في لوحة التحكم على دور المستخدم الخاص بك. تشمل أدوار المستخدم الشائعة المحررين والمنسقين والملحنين والمعتمدين والمتوقعين والمسؤولين.

source: The following are some of the tools that you can find within the Dashboard:
am: የሚከተሉት በዳሽቦርድ ውስጥ ሊያገኟቸው ከሚችሏቸው መሳሪያዎች ውስጥ ጥቂቶቹ ናቸው።
ar: فيما يلي بعض الأدوات التي يمكنك العثور عليها داخل لوحة التحكم الرئيسية:

source: The Dashboard Panels
am: የዳሽቦርድ ፓነሎች
ar: لوحات لوحة القيادة

source: The dashboard panels provide you with an overview of the various states of your pages.
am: የዳሽቦርዱ ፓነሎች የገጾችዎን የተለያዩ ሁኔታዎች አጠቃላይ እይታ ይሰጡዎታል።
ar: توفر لك لوحات لوحة المعلومات نظرة عامة على الحالات المختلفة لصفحاتك.

source: The different panels on your dashboard are as follows:
am: በዳሽቦርድዎ ላይ ያሉት የተለያዩ ፓነሎች የሚከተሉት ናቸው።
ar: اللوحات المختلفة على لوحة القيادة الخاصة بك هي كما يلي:

source: **1. Your pages in a workflow**
am: **1. ገጾችዎ በስራ ሂደት ውስጥ ናቸው ***
ar: ** 1. صفحاتك في سير العمل **

source: The Your pages in a workflow panel shows you any pages in moderation that you own or have submitted for moderation yourself. It also shows the moderation tasks that are pending and how long the tasks have been open.
am: በስራ ፍሰት ፓኔል ውስጥ ያሉት የእርስዎ ገጾች እርስዎ በባለቤትነት የያዙትን ወይም እራስዎ ለሽምግልና ያስገቡትን ማንኛውንም ገጾች በመጠኑ ያሳየዎታል። በተጨማሪም በመጠባበቅ ላይ ያሉትን የአወያይነት ስራዎች እና ተግባሮቹ ለምን ያህል ጊዜ ክፍት እንደሆኑ ያሳያል.
ar: تعرض لك صفحاتك في لوحة سير العمل أية صفحات تحت الإشراف تمتلكها أو قمت بإرسالها للمراجعة بنفسك. كما يعرض أيضًا مهام الإشراف المعلقة ومدة فتح المهام.

source: **2. Awaiting your review**
am: **2. የእርስዎን ግምገማ በመጠበቅ ላይ ***
ar: ** 2. في انتظار مراجعتك **

source: If your webmaster or web developer gives you permission to perform moderation actions, your Wagtail dashboard displays the Awaiting your review panel. This panel shows content that's ready for you to review.
am: የድር አስተዳዳሪዎ ወይም የድር ገንቢዎ የማካካሻ እርምጃዎችን እንዲፈጽሙ ፍቃድ ከሰጡዎት፣ የWagtail ዳሽቦርድዎ በመጠባበቅ ላይ ያለውን የግምገማ ፓነል ያሳያል። ይህ ፓነል እርስዎ ለመገምገም ዝግጁ የሆነ ይዘት ያሳያል።
ar: إذا منحك مشرف الموقع أو مطور الويب الإذن بتنفيذ إجراءات الإشراف ، فإن لوحة معلومات Wagtail تعرض لوحة انتظار المراجعة. تعرض هذه اللوحة المحتوى الجاهز للمراجعة.

source: From the panel, you can perform the following actions:
am: ከፓነሉ ውስጥ የሚከተሉትን ተግባራት ማከናወን ይችላሉ:
ar: من اللوحة ، يمكنك تنفيذ الإجراءات التالية:

source: Click the name of a page to edit that page. Use the buttons to move the page to the next stage in your workflow by requesting changes to a page, approving the page, or approving the page with a comment. Get a quick view of the page status by hovering over the indicator circles to get more information about the pending task. The indicator circles show a tick for a completed task or an empty circle for an incomplete one. See how long a page has been waiting for review. Your most recent edits The Your most recent edits panel displays the five pages you last edited.
am: ያንን ገጽ ለማርትዕ የገጽ ስም ጠቅ ያድርጉ። በገጽ ላይ ለውጦችን በመጠየቅ፣ ገጹን በማጽደቅ ወይም ገጹን በአስተያየት በማጽደቅ ገጹን ወደ የስራ ሂደትዎ ወደሚቀጥለው ደረጃ ለማንቀሳቀስ አዝራሮቹን ይጠቀሙ። በመጠባበቅ ላይ ስላለው ተግባር የበለጠ መረጃ ለማግኘት በጠቋሚ ክበቦች ላይ በማንዣበብ የገጹን ሁኔታ ፈጣን እይታ ያግኙ። የጠቋሚዎቹ ክበቦች ለተጠናቀቀ ሥራ ምልክት ወይም ላልተጠናቀቀ ባዶ ክበብ ያሳያሉ. አንድ ገጽ ለምን ያህል ጊዜ ግምገማን እንደጠበቀ ይመልከቱ። በጣም የቅርብ ጊዜ አርትዖቶችህ የቅርብ ጊዜ የአርትዖት ፓነልህ ለመጨረሻ ጊዜ አርትዕ ያደረግካቸውን አምስት ገጾች ያሳያል።
ar: انقر فوق اسم الصفحة لتحرير تلك الصفحة. استخدم الأزرار لنقل الصفحة إلى المرحلة التالية في سير العمل عن طريق طلب تغييرات على الصفحة أو الموافقة على الصفحة أو الموافقة على الصفحة التي تحتوي على تعليق. احصل على عرض سريع لحالة الصفحة من خلال التمرير فوق دوائر المؤشر للحصول على مزيد من المعلومات حول المهمة المعلقة. تعرض دوائر المؤشر علامة اختيار لمهمة مكتملة أو دائرة فارغة لمهمة غير مكتملة. انظر كم من الوقت تنتظر الصفحة للمراجعة. أحدث عمليات التحرير التي قمت بإجرائها تعرض لوحة أحدث عمليات التحرير الخمس صفحات التي قمت بتحريرها مؤخرًا.

source: The panel also shows the date that you last edited the pages as well as the current status of the pages.
am: ፓነሉ ገጾቹን ለመጨረሻ ጊዜ ያረሙበትን ቀን እና እንዲሁም የገጾቹን ወቅታዊ ሁኔታ ያሳያል።
ar: تعرض اللوحة أيضًا تاريخ آخر تعديل للصفحات بالإضافة إلى الحالة الحالية للصفحات.

source: **3. Your locked pages**
am: **3. የእርስዎ የተቆለፉ ገጾች ***
ar: ** 3. صفحاتك المقفلة **

source: The Your locked pages panel shows all of the pages you've locked so that only you can edit them. From this panel, you can quickly view the date you locked a page. To edit a locked page, click the name.
am: የተቆለፉት ገፆችህ ፓኔል የቆለፏቸውን ገፆች በሙሉ ያሳያቸዋል ስለዚህም አንተ ብቻ አርትዕ ማድረግ እንድትችል። ከዚህ ፓነል ላይ አንድ ገጽ የቆለፉበትን ቀን በፍጥነት ማየት ይችላሉ። የተቆለፈውን ገጽ ለማርትዕ ስሙን ጠቅ ያድርጉ።
ar: تعرض لوحة الصفحات المقفلة جميع الصفحات التي قمت بقفلها بحيث يمكنك أنت فقط تحريرها. من هذه اللوحة ، يمكنك عرض تاريخ قفل الصفحة بسرعة. لتحرير صفحة مقفلة ، انقر فوق الاسم.

source: The Sidebar
am: የጎን አሞሌ
ar: الشريط الجانبي

source: On the left-hand side of the dashboard and throughout the CMS is a menu called the Sidebar. You can use the Sidebar to navigate to different parts of the CMS.
am: በዳሽቦርዱ በግራ በኩል እና በመላው ሲኤምኤስ የጎን አሞሌ የሚባል ምናሌ አለ። ወደ የተለያዩ የሲኤምኤስ ክፍሎች ለማሰስ የጎን አሞሌውን መጠቀም ይችላሉ።
ar: على الجانب الأيسر من لوحة القيادة وفي جميع أنحاء نظام إدارة المحتوى توجد قائمة تسمى الشريط الجانبي. يمكنك استخدام الشريط الجانبي للتنقل إلى أجزاء مختلفة من نظام إدارة المحتوى.

source: The Sidebar helps you quickly access your content as well as CMS features and settings. The items on the Sidebar can vary depending on what you have access to. These features include Search, Documents, Snippets, Forms, Reports, Settings, and Help.
am: የጎን አሞሌው የእርስዎን ይዘት እንዲሁም የሲኤምኤስ ባህሪያትን እና ቅንብሮችን በፍጥነት እንዲደርሱ ያግዝዎታል። በጎን አሞሌው ላይ ያሉት እቃዎች እርስዎ ባሉዎት ላይ በመመስረት ሊለያዩ ይችላሉ። እነዚህ ባህሪያት ፍለጋን፣ ሰነዶችን፣ ቅንጥቦችን፣ ቅጾችን፣ ሪፖርቶችን፣ ቅንብሮችን እና እገዛን ያካትታሉ።
ar: يساعدك الشريط الجانبي في الوصول بسرعة إلى المحتوى الخاص بك بالإضافة إلى ميزات وإعدادات CMS. يمكن أن تختلف العناصر الموجودة على الشريط الجانبي بناءً على ما يمكنك الوصول إليه. تتضمن هذه الميزات البحث والمستندات والمقتطفات والنماذج والتقارير والإعدادات والمساعدة.

source: If you want the Sidebar to take up less space, you can click the white arrow near the top of the Sidebar to switch it into slim mode and give yourself more space for writing.
am: የጎን አሞሌው ትንሽ ቦታ እንዲይዝ ከፈለጉ፣ ወደ ቀጠን ሁነታ ለመቀየር እና ለእራስዎ ተጨማሪ ቦታ ለመፃፍ ከጎን አሞሌው አናት አጠገብ ያለውን ነጭ ቀስት ጠቅ ማድረግ ይችላሉ።
ar: إذا كنت تريد أن يشغل الشريط الجانبي مساحة أقل ، فيمكنك النقر فوق السهم الأبيض بالقرب من أعلى الشريط الجانبي لتحويله إلى الوضع النحيف وإعطاء نفسك مساحة أكبر للكتابة.

source: The Explorer Page
am: የአሳሽ ገጽ
ar: صفحة المستكشف

source: The Explorer page allows you to view a page’s children and perform actions on them. On the Explorer page, you can publish and unpublish pages. You can also move the pages to other sections, drill down into the content tree, or reorder child pages within a parent.
am: የአሳሽ ገጽ የገጽ ልጆችን እንዲመለከቱ እና በእነሱ ላይ እርምጃዎችን እንዲፈጽሙ ይፈቅድልዎታል። በ Explorer ገጽ ላይ ገጾችን ማተም እና ማላቀቅ ይችላሉ። እንዲሁም ገጾቹን ወደ ሌሎች ክፍሎች መውሰድ፣ በይዘት ዛፉ ላይ መቆፈር ወይም በወላጅ ውስጥ የልጅ ገጾችን እንደገና ማዘዝ ይችላሉ።
ar: تتيح لك صفحة المستكشف عرض العناصر الفرعية للصفحة وتنفيذ الإجراءات عليهم. في صفحة Explorer ، يمكنك نشر الصفحات وإلغاء نشرها. يمكنك أيضًا نقل الصفحات إلى أقسام أخرى ، أو التنقل لأسفل في شجرة المحتوى ، أو إعادة ترتيب الصفحات الفرعية داخل أحد الأبوين.

source: You can see the name of the page whose Explorer page you are on as a heading at the top of the screen. If the page has child pages within it, then you can see a list displaying the child pages below the heading. Clicking the title of a child page takes you to the edit screen, from which you can edit that child page.
am: በስክሪኑ ላይኛው ክፍል ላይ እንደ አርእስት ሆነው በኤክስፕሎረር ገጹ ላይ ያሉበትን ገጽ ስም ማየት ይችላሉ። ገጹ በውስጡ የሕፃን ገጾች ካሉት፣ ከርዕሱ በታች የሕፃን ገጾችን የሚያሳይ ዝርዝር ማየት ይችላሉ። የሕፃን ገጽ ርዕስ ጠቅ ማድረግ ወደ አርትዕ ማያ ገጽ ይወስድዎታል ፣ ከዚያ የሕፃኑን ገጽ ማርትዕ ይችላሉ።
ar: يمكنك رؤية اسم الصفحة التي تتصفحها بصفحة المستكشف كعنوان أعلى الشاشة. إذا كانت الصفحة بها صفحات فرعية بداخلها ، فيمكنك رؤية قائمة تعرض الصفحات الفرعية أسفل العنوان. يؤدي النقر فوق عنوان الصفحة الفرعية إلى نقلك إلى شاشة التحرير ، والتي يمكنك من خلالها تحرير هذه الصفحة الفرعية.

source: If you hover over a child page, you get an arrow on the right-hand side of that child page row. Clicking the arrow displays a further level of child pages.
am: በልጁ ገጽ ላይ ቢያንዣብቡ፣ በዚያ የልጅ ገጽ ረድፍ በቀኝ በኩል ቀስት ያገኛሉ። ቀስቱን ጠቅ ማድረግ ተጨማሪ የልጅ ገጾችን ደረጃ ያሳያል።
ar: إذا قمت بالتمرير فوق صفحة فرعية ، فسيظهر لك سهم على الجانب الأيمن من صف الصفحة الفرعي هذا. يؤدي النقر فوق السهم إلى عرض مستوى آخر من الصفحات الفرعية.

source: ![Explorer](../_static/images/navigating/explorer_page.png "Explorer")
am: ![አሳሽ](../_static/images/navigating/Explorer_page.png "አሳሽ")

source: Explorer
am: አሳሽ
ar: إكسبلورر

source: Additionally, hovering over a child page displays a checkbox at the left-hand side of the child page row. Selecting one or more child pages by clicking their checkboxes gives you an action bar at the bottom of the Explorer page. Clicking on any of the options in the action bar takes you to a confirmation page from which you can confirm the action.
am: በተጨማሪም፣ በልጁ ገጽ ላይ ማንዣበብ በልጁ ረድፉ በግራ በኩል በግራ በኩል ያለውን አመልካች ሳጥን ያሳያል። አመልካች ሳጥኖቻቸውን ጠቅ በማድረግ አንድ ወይም ከዚያ በላይ የሕፃን ገጾችን መምረጥ ከ Explorer ገጽ ግርጌ ላይ ያለውን የእርምጃ አሞሌ ይሰጥዎታል። በድርጊት አሞሌ ውስጥ ያሉትን ማናቸውንም አማራጮች ጠቅ ማድረግ ድርጊቱን ወደሚያረጋግጡበት የማረጋገጫ ገጽ ይወስደዎታል።
ar: بالإضافة إلى ذلك ، يؤدي التمرير فوق صفحة فرعية إلى عرض مربع اختيار في الجانب الأيسر من صف الصفحة الفرعية. يمنحك تحديد صفحة فرعية واحدة أو أكثر من خلال النقر فوق مربعات الاختيار الخاصة بها شريط إجراءات في أسفل صفحة المستكشف. يؤدي النقر فوق أي من الخيارات الموجودة في شريط الإجراءات إلى نقلك إلى صفحة تأكيد يمكنك من خلالها تأكيد الإجراء.

source: ![Child pages](../_static/images/navigating/child_pages.png "Child pages")
am: ![የህፃናት ገጾች](../_static/images/navigating/child_pages.png "የህፃናት ገጾች")
ar: ! [الصفحات الفرعية] (../_ static / images / navigating / child_pages.png "الصفحات الفرعية")

source: Child pages
am: የልጆች ገጾች
ar: الصفحات الفرعية

source: As you drill down through the site, the breadcrumb (the row of pages beginning with the home icon) displays the path you have taken. Clicking on the page titles in the breadcrumb takes you to the Explorer screen for that page.
am: ጣቢያውን እየፈተሹ ሲሄዱ የዳቦ ፍርፋሪው (በመነሻ አዶው የሚጀምረው የገጾች ረድፍ) የሄዱበትን መንገድ ያሳያል። በዳቦ ፍርፋሪ ውስጥ ያሉትን የገጽ አርእስቶች ጠቅ ማድረግ ለዚያ ገጽ ኤክስፕሎረር ስክሪን ይወስደዎታል።
ar: أثناء التنقل في الموقع ، يعرض مسار التنقل (صف الصفحات الذي يبدأ برمز الصفحة الرئيسية) المسار الذي سلكته. يؤدي النقر فوق عناوين الصفحات في مسار التنقل إلى نقلك إلى شاشة المستكشف لتلك الصفحة.

source: ![Breadcrumb](../_static/images/navigating/breadcrumb.png "Breadcrumb")
am: ![የዳቦ ፍርፋሪ](../_static/images/navigating/breadcrumb.png "የዳቦ ፍርፋሪ")

source: Breadcrumb
am: የዳቦ ፍርፋሪ
ar: مسار التنقل

source: Clicking on the … Actions dropdown shows a list of actions for the parent page, like Move, Copy, Delete, Unpublish, and History. Also, clicking the Sort menu order option from the dropdown takes you to the ordering page.
am: በ… የተግባሮች ተቆልቋይ ላይ ጠቅ ማድረግ እንደ አንቀሳቅስ፣ ቅዳ፣ ሰርዝ፣ አለማተም እና ታሪክ ያሉ የወላጅ ገፁን የእርምጃዎች ዝርዝር ያሳያል። እንዲሁም ከተቆልቋዩ ውስጥ የዝርዝር ሜኑ ትዕዛዝ አማራጩን ጠቅ ማድረግ ወደ ማዘዣ ገጹ ይወስደዎታል.
ar: يؤدي النقر فوق القائمة المنسدلة… Actions إلى إظهار قائمة بالإجراءات للصفحة الرئيسية ، مثل نقل ونسخ وحذف وإلغاء النشر والتاريخ. أيضًا ، يؤدي النقر فوق خيار ترتيب قائمة الفرز من القائمة المنسدلة إلى نقلك إلى صفحة الطلب.

source: ![Actions](../_static/images/navigating/actions_page.png "Actions")
am: ![እርምጃዎች](../_static/images/navigating/actions_page.png "እርምጃዎች")
ar: ! [الإجراءات] (../_ static / images / navigating / Actions_page.png "Actions")

source: Actions
am: ድርጊቶች
ar: أجراءات

source: Search the CMS
am: CMS ን ይፈልጉ
ar: ابحث في CMS

source: The search feature is the topmost feature in the Sidebar. You can use the search feature to quickly search for content in the CMS.
am: የፍለጋ ባህሪው በጎን አሞሌ ውስጥ ከፍተኛው ባህሪ ነው። በሲኤምኤስ ውስጥ ይዘትን በፍጥነት ለመፈለግ የፍለጋ ባህሪውን መጠቀም ይችላሉ።
ar: ميزة البحث هي الميزة العليا في الشريط الجانبي. يمكنك استخدام ميزة البحث للبحث بسرعة عن المحتوى في نظام إدارة المحتوى.

source: ![Search](../_static/images/navigating/search.png "Search")
am: ![ፍለጋ](../_static/images/navigating/search.png "ፍለጋ")
ar: ! [بحث] (../_ static / images / navigating / search.png "بحث")

source: Search
am: ፈልግ
ar: يبحث

source: Frequently Asked Questions (FAQs)
am: ተዘውትረው የሚጠየቁ ጥያቄዎች (FAQs)
ar: الأسئلة المتداولة (FAQs)

source: **1. What technologies is the CMS Built on?**
am: **1. ሲኤምኤስ በምን ቴክኖሎጂዎች ነው የተገነባው?**
ar: ** 1. ما هي التقنيات التي يعتمد عليها نظام إدارة المحتوى؟ **

source: The CMS, along with its various components, is **completely open-source** and developed on the [WMO RAF GitHub account](https://github.com/orgs/wmo-raf). This implies that the institution will have **unrestricted access to the source code**, allowing them to identify and report any bugs, request new features, and even actively contribute to the development of the codebase. This open approach encourages collaboration and fosters a sense of ownership and involvement within the institution.
am: ሲኤምኤስ ከተለያዩ ክፍሎቹ ጋር **ሙሉ በሙሉ ክፍት ምንጭ** ነው እና በ[WMO RAF GitHub መለያ](https://github.com/orgs/wmo-raf) ላይ የተሰራ ነው። ይህ የሚያመለክተው ተቋሙ **ያልተገደበ የምንጭ ኮድ መዳረሻ ይኖረዋል** ይህም ማንኛውንም ስህተቶች ለይተው እንዲያሳውቁ፣ አዲስ ባህሪያትን እንዲጠይቁ እና ሌላው ቀርቶ ለኮድ ቤዝ ልማት በንቃት አስተዋፅኦ እንዲያበረክቱ ያስችላቸዋል። ይህ ክፍት አቀራረብ ትብብርን ያበረታታል እና በተቋሙ ውስጥ የባለቤትነት ስሜት እና ተሳትፎን ያዳብራል.
ar: نظام إدارة المحتوى (CMS) ، إلى جانب مكوناته المختلفة ، ** مفتوح المصدر تمامًا ** وتم تطويره على [حساب GitHub التابع للمنظمة WMO RAF] (https://github.com/orgs/wmo-raf). وهذا يعني أن المؤسسة سيكون لها ** وصول غير مقيد إلى الكود المصدري ** ، مما يسمح لها بتحديد أي أخطاء والإبلاغ عنها ، وطلب ميزات جديدة ، وحتى المساهمة بنشاط في تطوير قاعدة التعليمات البرمجية. يشجع هذا النهج المفتوح على التعاون ويعزز الشعور بالملكية والمشاركة داخل المؤسسة.

source: **2. Who will manage the CMS Content?**
am: **2. የሲኤምኤስ ይዘትን ማን ያስተዳድራል?**
ar: ** 2. من سيتولى إدارة محتوى CMS؟ **

source: The **NMHS installing the CMS and its components will be fully responsible** for inputting and managing the content that goes into the CMS, from their side. This means that they take the instance of the code and run it, without anyone else having access to the operational instance, unless authorized to do so.
am: **ኤንኤምኤችኤስ ሲኤምኤስን እና ክፍሎቹን ሲጭኑ ወደ ሲኤምኤስ የሚገባውን ይዘት ከጎናቸው ለማስገባት እና ለማስተዳደር ሙሉ ሀላፊነት አለባቸው። ይህ ማለት ኮድን እንደ ምሳሌ ወስደው ያካሂዱታል, ማንም ሰው ወደ ኦፕሬሽን ኦፕሬሽን ኦፕሬሽን ኦፕሬሽን ኦፕሬሽን ኦፕሬሽን ኦፕሬሽን ኦፕሬሽንስ ካልሆነ በስተቀር ሌላ ሰው ሳይደርስበት ነው.
ar: سيكون ** NMHS الذي يقوم بتثبيت CMS ومكوناته مسؤولاً بالكامل ** عن إدخال وإدارة المحتوى الذي يدخل في CMS ، من جانبهم. هذا يعني أنهم يأخذون مثيل الكود ويقومون بتشغيله ، دون أن يتمكن أي شخص آخر من الوصول إلى المثيل التشغيلي ، ما لم يُصرح لهم بذلك.

source: **3. What if an NMHS already has a website?**
am: **3. ኤንኤምኤችኤስ አስቀድሞ ድህረ ገጽ ካለውስ?**
ar: ** 3. ماذا لو كان المرفق الوطني (NMHS) لديه بالفعل موقع على شبكة الإنترنت؟ **

source: In cases where an NMHS already has an existing website but is interested in testing the new CMS, they have the option to install and run it **concurrently with their existing system** for a specific duration. This allows them to thoroughly evaluate and experience the functionalities offered by the new CMS. Once the NMHS is satisfied and comfortable with the new CMS, a phased approach can be adopted to gradually transition and fully migrate their website to the new CMS. This ensures a smooth and well-managed transition process.
am: ኤን ኤም ኤች ኤስ አስቀድሞ ያለ ድህረ ገጽ ካለው ነገር ግን አዲሱን ሲኤምኤስ ለመፈተሽ ፍላጎት ካለው፣ ለተወሰነ ጊዜ ካለበት ስርዓት ጋር በተመሳሳይ ጊዜ መጫን እና ማስኬድ ይችላሉ። ይህም በአዲሱ ሲኤምኤስ የቀረቡትን ተግባራት በደንብ እንዲገመግሙ እና እንዲለማመዱ ያስችላቸዋል። ኤንኤምኤችኤስ በአዲሱ ሲኤምኤስ ከተረካ እና ከተመቸ፣ ቀስ በቀስ ወደ አዲሱ CMS ድረ-ገጻቸውን ለመሸጋገር እና ለማዛወር ደረጃውን የጠበቀ አካሄድ ሊከተል ይችላል። ይህ ለስላሳ እና በደንብ የሚተዳደር የሽግግር ሂደትን ያረጋግጣል.
ar: في الحالات التي يكون فيها للمرفق الوطني للأرصاد الجوية والهيدرولوجيا موقعًا موجودًا بالفعل ولكنه مهتم باختبار نظام إدارة المحتوى الجديد ، فلديه خيار تثبيته وتشغيله ** بالتزامن مع نظامه الحالي ** لمدة محددة. وهذا يسمح لهم بإجراء تقييم شامل وتجربة الوظائف التي يوفرها نظام إدارة المحتوى الجديد. بمجرد أن يكون المرفق الوطني للأرصاد الجوية والهيدرولوجيا (NMHS) راضيًا ومريحًا عن نظام إدارة المحتوى الجديد ، يمكن اعتماد نهج مرحلي للانتقال التدريجي لموقعه على الويب وترحيله بالكامل إلى نظام إدارة المحتوى الجديد. هذا يضمن عملية انتقال سلسة وجيدة الإدارة.

source: **4. What does ‘CMS’ mean?**
am: **4. ‘ሲኤምኤስ’ ማለት ምን ማለት ነው?**
ar: ** 4. ماذا يعني "CMS"؟ **

source: The term ‘CMS’, as used in this document, refers to **all the components** working together to have a running website, more especially on managing the website content. Read more about the CMS Key functionalities https://github.com/wmo-raf/nmhs-cms/wiki
am: ‘ሲኤምኤስ’ የሚለው ቃል፣ በዚህ ሰነድ ውስጥ ጥቅም ላይ እንደዋለ፣ የሚያመለክተው ** ሁሉም አካላት** የሚሰራ ድረ-ገጽ እንዲኖራቸው በጋራ መስራትን፣ በተለይም የድረ-ገጹን ይዘት በማስተዳደር ላይ ነው። ስለ CMS ቁልፍ ተግባራት የበለጠ ያንብቡ https://github.com/wmo-raf/nmhs-cms/wiki
ar: يشير المصطلح "CMS" ، كما هو مستخدم في هذا المستند ، إلى ** جميع المكونات ** التي تعمل معًا للحصول على موقع ويب قيد التشغيل ، وخاصة فيما يتعلق بإدارة محتوى موقع الويب. اقرأ المزيد عن وظائف مفتاح CMS https://github.com/wmo-raf/nmhs-cms/wiki

source: **5. What with NMHSs services that do not have IT people**
am: **5. የአይቲ ሰዎች ከሌላቸው የኤንኤምኤችኤስ አገልግሎቶች ጋር ምን ማለት ነው**
ar: ** 5. ماذا عن خدمات المرافق الوطنية للأرصاد الجوية والهيدرولوجيا (NMHSs) التي لا يتوفر بها موظفو تكنولوجيا المعلومات **

source: A fundamental aspect considered during the design and development phase of the CMS was to establish a clear and well-defined system for managing content and page structure. This involved creating a **user-friendly interface with a modern design and intuitive features,** aimed at providing users with a seamless and enjoyable experience. The objective was to enable users to easily locate content and utilize the CMS **without the need for specialized IT skills**.
am: በሲኤምኤስ የንድፍ እና የዕድገት ምዕራፍ ወቅት የታሰበው መሠረታዊ ገጽታ ይዘትን እና የገጽ አወቃቀሩን ለማስተዳደር ግልጽ እና በሚገባ የተገለጸ ሥርዓት መዘርጋት ነበር። ይህ ለተጠቃሚዎች እንከን የለሽ እና አስደሳች ተሞክሮ ለማቅረብ ያለመ ዘመናዊ ንድፍ እና ሊታወቅ የሚችል ባህሪያት ያለው ** ለተጠቃሚ ምቹ በይነገጽ መፍጠርን ያካትታል። አላማው ተጠቃሚዎች ይዘትን በቀላሉ እንዲያገኙ እና የሲኤምኤስን **ልዩ የአይቲ ክህሎት ሳያስፈልጋቸው እንዲጠቀሙ ማስቻል ነበር።
ar: كان أحد الجوانب الأساسية التي تم أخذها في الاعتبار أثناء مرحلة التصميم والتطوير لنظام إدارة المحتوى هو إنشاء نظام واضح ومحدد جيدًا لإدارة المحتوى وهيكل الصفحة. تضمن ذلك إنشاء ** واجهة سهلة الاستخدام بتصميم حديث وميزات بديهية ، ** تهدف إلى تزويد المستخدمين بتجربة سلسة وممتعة. كان الهدف هو تمكين المستخدمين من تحديد موقع المحتوى بسهولة واستخدام نظام إدارة المحتوى ** دون الحاجة إلى مهارات تقنية معلومات متخصصة **.

source: **6. Security risks?**
am: **6. የደህንነት ስጋቶች?**
ar: ** 6. أخطار أمنية؟**

source: The CMS, which is being built using open-source technologies, benefits from the advantage of having a community of developers who actively contribute to enhancing its security and stability. Furthermore, the CMS offers robust **support for secure authentication mechanisms**, including username/password authentication, integration with third-party authentication systems such as OAuth, and the ability to implement custom authentication backends. Additionally, the CMS performs **regular backups to safeguard the website's data** and enable its restoration in case of data loss. The NMHS are encouraged to share **only the final products** intended for the public.
am: ክፍት ምንጭ ቴክኖሎጅዎችን በመጠቀም እየተገነባ ያለው CMS ደህንነቱን እና መረጋጋትን ለማሻሻል ንቁ አስተዋጾ የሚያበረክቱ ገንቢዎች ማህበረሰብ በመኖሩ ጥቅም ይጠቀማል። በተጨማሪም ሲኤምኤስ የተጠቃሚ ስም/የይለፍ ቃል ማረጋገጥን፣ እንደ OAuth ካሉ የሶስተኛ ወገን የማረጋገጫ ስርዓቶች ጋር መቀላቀል እና ብጁ የማረጋገጫ ጀርባዎችን የመተግበር ችሎታን ጨምሮ ጠንካራ ** ለአስተማማኝ የማረጋገጫ ስልቶች** ድጋፍ ይሰጣል። በተጨማሪም፣ ሲኤምኤስ የድረ-ገጹን ውሂብ ለመጠበቅ እና የውሂብ መጥፋት በሚከሰትበት ጊዜ ወደነበረበት ለመመለስ ** መደበኛ ምትኬዎችን ያደርጋል። ኤንኤምኤችኤስ ለህዝብ የታሰቡ የመጨረሻዎቹን ምርቶች *** እንዲያካፍሉ ይበረታታሉ።
ar: يستفيد نظام إدارة المحتوى ، الذي يتم إنشاؤه باستخدام تقنيات مفتوحة المصدر ، من ميزة وجود مجتمع من المطورين الذين يساهمون بنشاط في تعزيز أمنه واستقراره. علاوة على ذلك ، يوفر نظام إدارة المحتوى دعمًا قويًا ** لآليات المصادقة الآمنة ** ، بما في ذلك مصادقة اسم المستخدم / كلمة المرور ، والتكامل مع أنظمة المصادقة التابعة لجهات خارجية مثل OAuth ، والقدرة على تنفيذ خلفيات المصادقة المخصصة. بالإضافة إلى ذلك ، يقوم نظام إدارة المحتوى بإجراء ** نسخ احتياطية منتظمة لحماية بيانات موقع الويب ** وتمكين استعادتها في حالة فقد البيانات. يُشجع المرفق الوطني (NMHS) على مشاركة ** فقط المنتجات النهائية ** المخصصة للجمهور.

source: **7. Where is it hosted?**
am: **7. የት ነው የተስተናገደው?**
ar: ** 7. أين هو مستضاف؟ **

source: The CMS is deployed **at the National Meteorological and Hydrological Service (NMHS) level,** utilising either **cloud-based infrastructure or on-premises servers**. Please refer to the provided **server specifications** for more details on the hosting environment.
am: ሲኤምኤስ በ **በብሔራዊ ሚቲዎሮሎጂ እና ሃይድሮሎጂካል አገልግሎት (ኤንኤምኤችኤስ) ደረጃ ተሰማርቷል፣ ** ደመና ላይ የተመሰረቱ መሠረተ ልማቶችን ወይም በግቢው ውስጥ አገልጋዮችን በመጠቀም ***። ስለ ማስተናገጃ አካባቢ ተጨማሪ ዝርዝሮችን ለማግኘት እባክዎ የቀረበውን ** የአገልጋይ ዝርዝር መግለጫ ይመልከቱ።
ar: يتم نشر نظام إدارة المحتوى ** على مستوى الخدمة الوطنية للأرصاد الجوية والهيدرولوجيا (NMHS) ، ** باستخدام إما ** البنية التحتية القائمة على السحابة أو الخوادم المحلية **. يرجى الرجوع إلى ** مواصفات الخادم ** المقدمة لمزيد من التفاصيل حول بيئة الاستضافة.
