Repository: ACMAD-Niamey/climweb
Catalog: docs/locales/*/LC_MESSAGES/_docs.po
Languages: am, ar

source: **Events registrations and Integration with Online Meeting Platforms (Zoom)**
am: **የክስተቶች ምዝገባዎች እና ከመስመር ላይ የስብሰባ መድረኮች (አጉላ) ጋር መቀላቀል**
ar: ** تسجيل الأحداث والتكامل مع منصات الاجتماعات عبر الإنترنت (Zoom) **

source: Create event registration forms hosted on the website.
am: በድር ጣቢያው ላይ የተስተናገዱ የክስተት ምዝገባ ቅጾችን ይፍጠሩ።
ar: إنشاء استمارات تسجيل الأحداث المستضافة على الموقع.

source: Automatically send invitation emails to users as they register to events from the website.
am: ተጠቃሚዎች ከድር ጣቢያው ላይ ለክስተቶች ሲመዘገቡ የግብዣ ኢሜይሎችን በራስ-ሰር ይላኩ።
ar: إرسال رسائل البريد الإلكتروني للدعوات تلقائيًا إلى المستخدمين أثناء تسجيلهم في الأحداث من موقع الويب.

source: Keep record of all your registrants for internal analysis.
am: ለውስጣዊ ትንተና ሁሉንም ተመዝጋቢዎችዎን ይመዝግቡ።
ar: احتفظ بسجل لجميع المسجلين من أجل التحليل الداخلي.

source: Allow users registering to events to also subscribe to your products.
am: ለክስተቶች የተመዘገቡ ተጠቃሚዎች ለምርቶችዎ እንዲመዘገቡ ይፍቀዱላቸው።
ar: السماح للمستخدمين الذين يسجلون في الأحداث بالاشتراك أيضًا في منتجاتك.

source: **Interactive Georeferenced data visualisation**
am: **በይነተገናኝ ጂኦሪፈረንስ የውሂብ እይታ**
ar: ** التصور التفاعلي للبيانات ذات المرجعية الجغرافية **

source: Upload and visualise own gridded data (forecasts, advisories, climate data products) on a map.
am: በካርታ ላይ የራሱን ፍርግርግ ውሂብ (ትንበያዎች፣ ምክሮች፣ የአየር ንብረት መረጃዎችን ምርቶች) ይስቀሉ እና ይሳሉ።
ar: تحميل وتصور البيانات الشبكية الخاصة (التنبؤات ، التحذيرات ، منتجات البيانات المناخية) على الخريطة.

source: Upload and visualise vector data (Point, areas) on a map.
am: በካርታ ላይ የቬክተር መረጃን (ነጥብ፣ አካባቢዎች) ይስቀሉ እና ይመልከቱ።
ar: تحميل وتصور بيانات المتجه (نقطة ، مناطق) على الخريطة.

source: Visualise own CAP alerts.
am: የራስዎን CAP ማንቂያዎችን በዓይነ ሕሊናህ ተመልከት።
ar: تصور تنبيهات CAP الخاصة.

source: Visualise thematic/sectorial data products interactively.
am: የቲማቲክ/የዘርፍ ዳታ ምርቶችን በይነተገናኝ በዓይነ ሕሊናህ ተመልከት።
ar: تصور منتجات البيانات المواضيعية / القطاعية بشكل تفاعلي.

source: Integrate external data sources ( from Regional Centers, Global Producing Centers, Satellite, Google Earth Engine etc).
am: የውጪ የመረጃ ምንጮችን (ከክልል ማዕከላት፣ ዓለም አቀፍ የምርት ማዕከላት፣ ሳተላይት፣ ጎግል ኢፈርት ሞተር ወዘተ) ያዋህዱ።
ar: دمج مصادر البيانات الخارجية (من المراكز الإقليمية ومراكز الإنتاج العالمية والأقمار الصناعية ومحرك Google Earth وما إلى ذلك).

source: Provide a platform to support impact based forecasts, analysis and advisories.
am: ተጽዕኖን መሰረት ያደረጉ ትንበያዎችን፣ ትንታኔዎችን እና ምክሮችን ለመደገፍ መድረክ ያቅርቡ።
ar: توفير منصة لدعم التنبؤات القائمة على التأثير والتحليلات والإرشادات.

source: **Email Marketing integration and user analytics**
am: ** የኢሜል ግብይት ውህደት እና የተጠቃሚ ትንታኔዎች ***
ar: ** تكامل التسويق عبر البريد الإلكتروني وتحليلات المستخدم **

source: Sign Up forms for users to subscribe to NMHSs products (using Mautic or Mailchimp).
am: ለኤንኤምኤችኤስ ምርቶች (Mautic ወይም Mailchimp በመጠቀም) ለተጠቃሚዎች እንዲመዘገቡ ቅጾችን ይመዝገቡ።
ar: استمارات الاشتراك للمستخدمين للاشتراك في منتجات NMHSs (باستخدام Mautic أو Mailchimp).

source: Analyse your email marketing users data.
am: የኢሜል ማሻሻጫ ተጠቃሚዎችን ውሂብ ይተንትኑ።
ar: تحليل بيانات مستخدمي التسويق عبر البريد الإلكتروني.

source: **Survey creation and results analysis**
am: ** የዳሰሳ ፈጠራ እና የውጤት ትንተና ***
ar: ** إنشاء الاستطلاع وتحليل النتائج **

source: Create custom surveys hosted on own website.
am: በራስ ድህረ ገጽ ላይ የሚስተናገዱ ብጁ የዳሰሳ ጥናቶችን ይፍጠሩ።
ar: إنشاء استبيانات مخصصة مستضافة على موقع الويب الخاص.

source: Analyse results on interactive dashboards.
am: በይነተገናኝ ዳሽቦርዶች ላይ ውጤቶችን ተንትን።
ar: تحليل النتائج على لوحات المعلومات التفاعلية.

source: **User analytics**
am: ** የተጠቃሚ ትንታኔዎች ***
ar: ** تحليلات المستخدم **

source: User base breakdown (eg. by sectors, gender, geographic area, etc, from user database - email marketing software).
am: የተጠቃሚ መሰረት መከፋፈል (ለምሳሌ በሴክተሮች፣ ጾታ፣ ጂኦግራፊያዊ አካባቢ፣ ወዘተ፣ ከተጠቃሚ ዳታቤዝ - የኢሜል ግብይት ሶፍትዌር)።
ar: تقسيم قاعدة المستخدمين (على سبيل المثال حسب القطاعات والجنس والمنطقة الجغرافية وما إلى ذلك من قاعدة بيانات المستخدم - برامج التسويق عبر البريد الإلكتروني).

source: User satisfaction (from surveys) data and trends .
am: የተጠቃሚ እርካታ (ከዳሰሳ ጥናቶች) ውሂብ እና አዝማሚያዎች .
ar: رضا المستخدم (من الاستطلاعات) البيانات والاتجاهات.

source: Website traffic analytics (eg. google analytics) .
am: የድር ጣቢያ ትራፊክ ትንታኔ (ለምሳሌ google analytics)።
ar: تحليلات حركة المرور على الموقع (مثل google analytics).

source: System traffic analytics (eg. hazards watch) .
am: የስርዓት ትራፊክ ትንታኔ (ለምሳሌ የአደጋዎች ሰዓት)።
ar: تحليلات حركة مرور النظام (مثل مراقبة المخاطر).

source: Social media analytics
am: የማህበራዊ ሚዲያ ትንታኔ
ar: تحليلات وسائل التواصل الاجتماعي

source: Twitter
am: ትዊተር
ar: تويتر

source: Facebook
am: ፌስቡክ
ar: فيسبوك

source: Instagram
am: ኢንስታግራም
ar: انستغرام

source: Mailing Integrations
am: የደብዳቤ መላኪያ ውህደቶች
ar: تكاملات البريد

source: Mautic
am: ማውቲክ
ar: موتيك

source: Mautic is an open-source alternative to Mailchimp.
am: Mautic ከ Mailchimp ክፍት ምንጭ አማራጭ ነው።
ar: Mautic هو بديل مفتوح المصدر لـ Mailchimp.

source: The aim of this package is to render a given Mautic Form on a Wagtail page, and send the submitted data to Mautic. Other Mautic functionalities might be added later as need arises.
am: የዚህ ፓኬጅ አላማ የተሰጠውን Mautic Form በWagtail ገጽ ላይ ማቅረብ እና የገባውን ውሂብ ወደ Mautic መላክ ነው። እንደ አስፈላጊነቱ ሌሎች የማውቲክ ተግባራት በኋላ ላይ ሊጨመሩ ይችላሉ።
ar: الهدف من هذه الحزمة هو تقديم نموذج Mautic معين على صفحة الذعرة ، وإرسال البيانات المقدمة إلى Mautic. يمكن إضافة وظائف Mautic الأخرى لاحقًا حسب الحاجة.

source: For package developer guide visit [Wagtail Mautic Developer Guide](https://github.com/wmo-raf/wagtailmautic)
am: ለጥቅል ገንቢ መመሪያ [Wagtail Mautic Developer Guide](https://github.com/wmo-raf/wagtailmautic) ይጎብኙ
ar: للحصول على دليل مطور الحزم ، تفضل بزيارة [Wagtail Mautic Developer Guide] (https://github.com/wmo-raf/wagtailmautic)

source: Settings
am: ቅንብሮች
ar: إعدادات

source: `NOTE`: This instructions assume you have knowledge of setting up Wagtail and configuring Mautic, as we don't cover the specifics.
am: `ማስታወሻ'፡ ይህ መመሪያ Wagtailን የማዋቀር እና Mauticን የማዋቀር እውቀት እንዳለዎት ያስባል፣ ምክንያቱም እኛ ልዩነቱን ስለማንሸፍነው።
ar: "ملاحظة": تفترض هذه التعليمات أن لديك معرفة بإعداد Wagtail وتكوين Mautic ، لأننا لا نغطي التفاصيل.

source: Mautic Settings will be added to the Wagtail Admin Menu as below
am: Mautic Settings ከዚህ በታች እንደሚታየው ወደ Wagtail Admin Menu ይታከላሉ።
ar: ستتم إضافة إعدادات Mautic إلى قائمة Wagtail Admin على النحو التالي

source: ![Navigation in Wagtail admin](../_static/images/mautic/locate_mautic_settings.png "Navigation in Wagtail admin")
am: ![በWagtail አስተዳዳሪ ውስጥ አሰሳ](../_static/images/mautic/locate_mautic_settings.png "በዋግቴል አስተዳዳሪ ውስጥ አሰሳ")

source: Navigation in Wagtail admin
am: በWagtail አስተዳዳሪ ውስጥ አሰሳ
ar: التنقل في Wagtail admin

source: Add in the URL for your Mautic instance (including the https://) to the Mautic Url field.
am: ለ Mautic ለምሳሌ (https:// ን ጨምሮ) ወደ Mautic Url መስክ ዩአርኤሉን ያክሉ።
ar: أضف عنوان URL لمثيل Mautic (بما في ذلك https: //) إلى حقل Mautic Url.

source: ![Set Mautic Base Url](../_static/images/mautic/base_url.png "Set Mautic Base Url")
am: ![Mautic Base Url አዘጋጅ](../_static/images/mautic/base_url.png "Mautic Base Url አዘጋጅ")

source: Set Mautic Base Url
am: Mautic Base ዩአርኤልን አዘጋጅ
ar: تعيين عنوان URL لقاعدة Mautic

source: You can use two methods for authentication:
am: ለማረጋገጫ ሁለት ዘዴዎችን መጠቀም ይችላሉ-
ar: يمكنك استخدام طريقتين للمصادقة:

source: OAuth2 that requires client id and client secret from Mautic
am: የደንበኛ መታወቂያ እና የደንበኛ ሚስጥር ከ Mautic የሚፈልግ OAuth2
ar: OAuth2 الذي يتطلب معرف العميل وسر العميل من Mautic

source: Basic Authentication that needs username and password. To use Basic Auth, you must enable this on Mautic Configuration
am: የተጠቃሚ ስም እና የይለፍ ቃል የሚያስፈልገው መሰረታዊ ማረጋገጫ። መሰረታዊ ማረጋገጫን ለመጠቀም ይህንን በ Mautic Configuration ላይ ማንቃት አለብዎት
ar: المصادقة الأساسية التي تحتاج إلى اسم المستخدم وكلمة المرور. لاستخدام المصادقة الأساسية ، يجب تمكين هذا في تكوين Mautic

source: Basic
am: መሰረታዊ
ar: أساسي

source: ![Basic](../_static/images/mautic/basic.png "Basic")
am: ![መሠረታዊ](../_static/images/mautic/basic.png "መሰረታዊ")
ar: ! [أساسي] (../_ static / images / mautic / basic.png "أساسي")

source: Usage
am: አጠቃቀም
ar: إستعمال

source: To create a subscription page based on mautic integration, navigate to `Pages` on the left side panel, select Pages and click on add a child page to the home page by hovering over the homepage.
am: በማውቲክ ውህደት ላይ የተመሰረተ የደንበኝነት ምዝገባ ገጽ ለመፍጠር በግራ በኩል ባለው ፓነል ላይ ወዳለው "ገጾች" ይሂዱ እና ገጾችን ይምረጡ እና በመነሻ ገጹ ላይ በማንዣበብ የልጅ ገጽን ወደ መነሻ ገጹ ላይ ጠቅ ያድርጉ።
ar: لإنشاء صفحة اشتراك بناءً على التكامل الطبيعي ، انتقل إلى "الصفحات" على اللوحة اليسرى ، وحدد الصفحات وانقر فوق إضافة صفحة فرعية إلى الصفحة الرئيسية عن طريق التمرير فوق الصفحة الرئيسية.

source: ![Add child Page](../_static/images/mautic/mautic_navigate.png "Add child Page")
am: ![የልጅ ገጽ አክል](../_static/images/mautic/mautic_navigate.png "የልጅ ገጽ አክል")
ar: ! [أضف صفحة فرعية] (../_ static / images / mautic / mautic_navigate.png "إضافة صفحة فرعية")

source: Add child Page
am: የልጆች ገጽ ያክሉ
ar: أضف صفحة فرعية

source: ![Add child Page](../_static/images/mautic/add_child_page.png "Add child Page")
am: ![የልጅ ገጽ አክል](../_static/images/mautic/add_child_page.png "የልጅ ገጽ አክል")
ar: ! [إضافة صفحة فرعية] (../_ static / images / mautic / add_child_page.png "إضافة صفحة فرعية")

source: Select `Mautic mailing list subsrciption page` from the list. Note that, if this page was already created then this option will not appear as only one instance of this page is allowed.
am: ከዝርዝሩ `Mautic የደብዳቤ መላኪያ ዝርዝር የደንበኝነት ምዝገባ ገጽ`ን ይምረጡ። ያስታውሱ፣ ይህ ገጽ አስቀድሞ የተፈጠረ ከሆነ የዚህ ገጽ አንድ ምሳሌ ብቻ ስለተፈቀደ ይህ አማራጭ አይታይም።
ar: حدد "صفحة الاشتراك في القائمة البريدية Mautic" من القائمة. لاحظ أنه إذا تم إنشاء هذه الصفحة بالفعل ، فلن يظهر هذا الخيار حيث يُسمح بنسخة واحدة فقط من هذه الصفحة.

source: ![Add mautic Page](../_static/images/mautic/add_mautic_page.png "Add mautic Page")
am: ![mautic Page አክል](../_static/images/mautic/add_mautic_page.png "የማውቲክ ገጽ አክል")
ar: ! [أضف صفحة mautic] (../_ static / images / mautic / add_mautic_page.png "أضف صفحة mautic")

source: Add mautic Page
am: የማውቲክ ገጽ ያክሉ
ar: أضف صفحة mautic

source: Fill in the form with necessary input. Example below. The Mautic form ID is retrieved from the subscription form created on Mautic's software. Refer to [Mautic User Guide](https://docs.mautic.org/en)
am: ቅጹን በአስፈላጊ ግቤት ይሙሉ. ምሳሌ ከታች። የማውቲክ ፎርም መታወቂያው በማውቲክ ሶፍትዌር ላይ ከተፈጠረ የደንበኝነት ምዝገባ ቅጽ ወጥቷል። [Mautic User Guide](https://docs.mautic.org/en) ተመልከት
ar: املأ النموذج بالمدخلات اللازمة. المثال أدناه. يتم استرداد معرف النموذج Mautic من نموذج الاشتراك الذي تم إنشاؤه على برنامج Mautic. راجع [دليل مستخدم Mautic] (https://docs.mautic.org/en)

source: Mautic Page
am: የማውቲክ ገጽ
ar: صفحة Mautic

source: Once the page is published, this page will render all fields created in Mautic.
am: ገጹ አንዴ ከታተመ፣ ይህ ገጽ Mautic ውስጥ የተፈጠሩ ሁሉንም መስኮች ያሳያል።
ar: بمجرد نشر الصفحة ، ستعرض هذه الصفحة جميع الحقول التي تم إنشاؤها في Mautic.

source: Mailchimp
am: ሜልቺምፕ

source: In progress ...
am: በሂደት ላይ ...
ar: في تَقَدم ...

source: CAP Editor
am: CAP አርታዒ
ar: محرر CAP

source: The **Common Alerting Protocol (CAP)** provides an open, non-proprietary digital message format for all types of alerts and notifications. It does not address any particular application or telecommunications method. The CAP format is compatible with emerging techniques, such as Web services, as well as existing formats including the Specific Area Message Encoding (SAME) used for the United States' National Oceanic and Atmospheric Administration (NOAA) Weather Radio and the Emergency Alert System (EAS)
am: **የጋራ ማንቂያ ፕሮቶኮል(CAP)** ለሁሉም አይነት ማንቂያዎች እና ማሳወቂያዎች ክፍት የሆነ የዲጂታል መልእክት ቅርጸት ያቀርባል። የትኛውንም የተለየ መተግበሪያ ወይም የቴሌኮሙኒኬሽን ዘዴን አይመለከትም። የCAP ቅርፀቱ እንደ ድር አገልግሎቶች ካሉ አዳዲስ ቴክኒኮች ጋር ተኳሃኝ ነው፣ እንዲሁም ለዩናይትድ ስቴትስ ብሔራዊ የውቅያኖስ እና የከባቢ አየር አስተዳደር (NOAA) የአየር ሁኔታ ሬዲዮ እና የአደጋ ጊዜ ማንቂያ ስርዓት (SAME) ጨምሮ የተወሰኑ ቅርጸቶችን ጨምሮ። ኢኤስ)
ar: يوفر ** بروتوكول التنبيه المشترك (CAP) ** تنسيق رسائل رقمية مفتوحًا وغير مملوك لجميع أنواع التنبيهات والإشعارات. لا يتناول أي تطبيق معين أو طريقة اتصالات. يتوافق تنسيق CAP مع التقنيات الناشئة ، مثل خدمات الويب ، فضلاً عن التنسيقات الحالية بما في ذلك تشفير رسائل المنطقة المحددة (SAME) المستخدم في راديو الطقس التابع للإدارة الوطنية للمحيطات والغلاف الجوي بالولايات المتحدة (NOAA) ونظام تنبيه الطوارئ ( EAS)

source: The CAP xml response follows the structure of the schema provided at http://docs.oasis-open.org/emergency/cap/v1.2/CAP-v1.2-os.html
am: የCAP xml ምላሽ http://docs.oasis-open.org/emergency/cap/v1.2/CAP-v1.2-os.html ላይ የቀረበውን የመርሃግብር መዋቅር ይከተላል።
ar: تتبع استجابة CAP xml بنية المخطط المقدم في http://docs.oasis-open.org/em Emergency/cap/v1.2/CAP-v1.2-os.html

source: CAP Editor Features
am: CAP አርታዒ ባህሪያት
ar: ميزات محرر CAP

source: ![CAP Preview](../_static/images/cap/cap_preview.png "CAP Preview")
am: ![CAP ቅድመ እይታ](../_static/images/cap/cap_preview.png "CAP ቅድመ እይታ")
ar: ! [CAP Preview] (../_ static / images / cap / cap_preview.png "معاينة CAP")

source: CAP Preview
am: CAP ቅድመ እይታ
ar: معاينة CAP

source: The CAP editor tool is a solution that provides a range of functionalities to support the NMHS in seamlessly issuing CAP. It has been developed with an aim of increasing the adoption of CAP by NMHS in Africa. Some of the key features of the tool include:
am: የCAP አርታኢ መሳሪያ ኤንኤምኤችኤስ ያለምንም እንከን CAP ሲያወጣ ለመደገፍ የተለያዩ ተግባራትን የሚሰጥ መፍትሄ ነው። በአፍሪካ ኤን ኤም ኤች ኤስ የ CAP ጉዲፈቻን ለማሳደግ በማለም ነው የተዘጋጀው። አንዳንድ የመሳሪያው ቁልፍ ባህሪያት የሚከተሉትን ያካትታሉ:
ar: أداة محرر CAP هي حل يوفر مجموعة من الوظائف لدعم المرافق NMHS في إصدار CAP بسلاسة. وقد تم تطويره بهدف زيادة اعتماد المرفق الوطني للأرصاد الجوية والهيدرولوجيا (CAP) في أفريقيا. تتضمن بعض الميزات الرئيسية للأداة ما يلي:

source: Possibility to run as standalone editor or integrate into Wagtail-CMS-based website
am: እንደ ራሱን የቻለ አርታዒ የመሄድ ወይም በWagtail-CMS ላይ የተመሰረተ ድረ-ገጽ ውስጥ የመቀላቀል እድል
ar: إمكانية التشغيل كمحرر مستقل أو الاندماج في موقع ويب Wagtail-CMS

source: Search Engine Optimization support to increase visibility and attract targeted traffic to an alert
am: ታይነትን ለመጨመር እና የታለመ ትራፊክን ወደ ማንቂያ ለመሳብ የፍለጋ ሞተር ማሻሻያ ድጋፍ
ar: دعم تحسين محرك البحث لزيادة الرؤية وجذب حركة المرور المستهدفة إلى تنبيه

source: Support for Approval Workflow from composer to approver, including commenting and email notification support
am: የአስተያየት እና የኢሜይል ማሳወቂያ ድጋፍን ጨምሮ ከአቀናባሪ ወደ አጽዳቂ የስራ ፍሰት ድጋፍ
ar: دعم سير عمل الموافقة من الملحن إلى الموافق ، بما في ذلك التعليق ودعم إعلام البريد الإلكتروني

source: Interoperable XML API of Alert List and Detail for integration with CAP Aggregators - Live CAP creation and editing preview
am: ሊሰራ የሚችል የኤክስኤምኤል ኤፒአይ የማንቂያ ዝርዝር እና ዝርዝር ከካፕ ሰብሳቢዎች ጋር ለመዋሃድ - የቀጥታ ካፕ መፍጠር እና አርትዕ ቅድመ እይታ
ar: واجهة برمجة تطبيقات XML قابلة للتشغيل البيني لقائمة التنبيه والتفاصيل للتكامل مع CAP Aggregators - معاينة إنشاء وتحرير CAP المباشر

source: Draw / Upload Polygon Functionality for Alert Area/Areas
am: የፖሊጎን ተግባርን ይሳሉ / ይስቀሉ ለማስጠንቀቂያ አካባቢ/አካባቢ
ar: رسم / تحميل وظيفة المضلع لمنطقة / مناطق التنبيه

source: Simple user friendly and mobile friendly CAP alert creation and management
am: ቀላል ለተጠቃሚ ምቹ እና ለሞባይል ተስማሚ CAP ማንቂያ መፍጠር እና ማስተዳደር
ar: إنشاء وإدارة تنبيه CAP سهل الاستخدام وسهل الاستخدام للهاتف المحمول

source: Alert to Alert/Alerts Reference Linkage
am: ማንቂያ ወደ ማንቂያ/ማንቂያዎች ዋቢ ትስስር
ar: تنبيه لتنبيهات / تنبيهات الارتباط المرجعي

source: Published python package with version management and changelogs https://github.com/wmo-raf/cap-editor
am: ከስሪት አስተዳደር እና ከለውጥ ሎግዎች ጋር የታተመ የpython ጥቅል https://github.com/wmo-raf/cap-editor
ar: حزمة Python المنشورة مع إدارة الإصدار وسجلات التغيير https://github.com/wmo-raf/cap-editor

source: Related Setup/Installation and Usage instructions
am: ተዛማጅ ማዋቀር/መጫኛ እና የአጠቃቀም መመሪያዎች
ar: تعليمات الإعداد / التثبيت والاستخدام ذات الصلة

source: Creating a CAP Alert
am: የ CAP ማንቂያ መፍጠር
ar: إنشاء تنبيه CAP

source: To create a CAP Alert access the editor from the explorer menu as below and add a new cap alert page:
am: የ CAP ማንቂያ ለመፍጠር ከታች እንደሚታየው አርታዒውን ከአሳሽ ምናሌው ይድረሱ እና አዲስ የካፒታል ማንቂያ ገጽ ያክሉ።
ar: لإنشاء تنبيه CAP ، قم بالوصول إلى المحرر من قائمة المستكشف على النحو التالي وأضف صفحة تنبيه جديدة:

source: Sections in the Alert Page and corresponding XML
am: በማንቂያ ገጽ ውስጥ ያሉ ክፍሎች እና ተዛማጅ XML
ar: الأقسام الموجودة في "صفحة التنبيه" و XML المقابل

source: The overall Document Object Model of an alert is as below:
am: የማስጠንቀቂያ አጠቃላይ የሰነድ ነገር ሞዴል እንደሚከተለው ነው፡-
ar: نموذج كائن المستند الإجمالي للتنبيه كما يلي:

source: ![Alert DOM](../_static/images/cap/dom.jpg "CAP Document Object Model")
am: ![ማንቂያ DOM](../_static/images/cap/dom.jpg "CAP Document Object Model")
ar: ! [دوم التنبيه] (../_ static / images / cap / dom.jpg "نموذج كائن مستند CAP")

source: Alert DOM
am: ማንቂያ DOM
ar: تنبيه DOM

source: A. Alert Identification
am: ሀ. ማንቂያ መታወቂያ
ar: أ. تحديد التنبيه

source: This is the root section of CAP corresponds to:
am: ይህ የ CAP ሥር ክፍል ነው፡-
ar: هذا هو قسم الجذر من CAP يتوافق مع:

source: It contains the **Message ID (identifier), Sender ID(sender), Sent Dat/Time (sent), Message Status (status), Message Type (msgType), Scope (scope), Restriction (restriction), Addresses (addresses), Note (note), Reference IDs (references) and Incident ids (incidents)**.
am: በውስጡም **የመልእክት መታወቂያ (ለዪ)፣ የላኪ መታወቂያ(ላኪ)፣ የተላከ ቀን/ሰዓት (የተላከ)፣ የመልእክት ሁኔታ (ሁኔታ)፣ የመልእክት አይነት (msgType)፣ ወሰን (ወሰን)፣ ገደብ (ገደብ)፣ አድራሻዎች (አድራሻዎች) ይዟል። ), ማስታወሻ (ማስታወሻ), የማጣቀሻ መታወቂያዎች (ማጣቀሻዎች) እና የአደጋ መታወቂያዎች (ክስተቶች) ***.
ar: يحتوي على ** معرف الرسالة (المعرف) ، معرف المرسل (المرسل) ، تاريخ / وقت الإرسال (تم الإرسال) ، حالة الرسالة (الحالة) ، نوع الرسالة (نوع الرسالة) ، النطاق (النطاق) ، التقييد (التقييد) ، العناوين (العناوين ) ، ملاحظة (ملاحظة) ، معرفات مرجعية (مراجع) ومعرفات الحوادث (الحوادث) **.

source: ***NOTE:*** Some fields are visible based on selection of different parameters.
am: *** ማሳሰቢያ: *** አንዳንድ መስኮች በተለያዩ መለኪያዎች ምርጫ ላይ ተመስርተው ይታያሉ።
ar: *** ملاحظة: *** بعض الحقول مرئية بناءً على اختيار معلمات مختلفة.

source: ![Alert Identification](../_static/images/cap/alert_identification.png "Alert Identification section")
am: ![የማንቂያ መታወቂያ](../_static/images/cap/alert_identification.png "የማንቂያ መለያ ክፍል")
ar: ! [تعريف التنبيه] (../_ static / images / cap / alert_identification.png "قسم تعريف التنبيه")

source: AlertIdentification
am: ማንቂያ መታወቂያ

source: B. Alert Information
am: ለ. የማንቂያ መረጃ
ar: معلومات التنبيه

source: This is an optional child section of the Alert Identification Section i.e
am: ይህ የማንቂያ መታወቂያ ክፍል አማራጭ የሕፃን ክፍል ነው i.e
ar: هذا قسم فرعي اختياري من قسم تعريف التنبيه ، أي

source: Multiple instances of this section are allowed. It contains the **Langauge (langauge), Event Category/Categories (category), Event Type (event), Response Type/Types (responseType), Urgency (urgency), Severity (severity), Certainty (certainty), Audience (audience), Event Code/Codes (eventCode), Effective Date/Time (effective), Onset Date/Time (onset), Expiration Date/Time (expires), Sender Name (senderName), Headline (headline), Event description (description), Instructions (instruction), Information URL (web), Contact Info (contact) and Parameter/Parameters (parameter)**.
am: የዚህ ክፍል በርካታ አጋጣሚዎች ተፈቅደዋል። በውስጡም **ቋንቋ (ቋንቋ)፣ የክስተት ምድብ/ ምድቦች (ምድብ)፣ የክስተት አይነት (ክስተት)፣ የምላሽ አይነት/አይነቶች (ምላሽ አይነት)፣ አጣዳፊነት (አጣዳፊነት)፣ ቸልተኝነት (አደጋ)፣ እርግጠኝነት (እርግጠኝነት)፣ ታዳሚ (ታዳሚ) ይዟል። ), የክስተት ኮድ/ኮዶች (የክስተት ኮድ)፣ የሚፀናበት ቀን/ሰዓት (ውጤታማ)፣ የተጀመረበት ቀን/ሰአት (ጅምር)፣ የሚያበቃበት ቀን/ሰዓት (ያለቃል)፣ የላኪ ስም (የላኪ ስም)፣ አርእስት (ርዕስ)፣ የክስተት መግለጫ (መግለጫ) መመሪያዎች (መመሪያ)፣ የመረጃ ዩአርኤል (ድር)፣ የእውቂያ መረጃ (ዕውቂያ) እና ፓራሜትር/መለኪያዎች (መለኪያ)**።
ar: يُسمح بمثيلات متعددة من هذا القسم. يحتوي على ** اللغة (اللغة) ، فئة الحدث / الفئات (الفئة) ، نوع الحدث (الحدث) ، نوع / أنواع الاستجابة (نوع الاستجابة) ، الاستعجال (الاستعجال) ، الخطورة (الخطورة) ، اليقين (اليقين) ، الجمهور (الجمهور ) ، رمز / رموز الحدث (رمز الحدث) ، التاريخ / الوقت الفعلي (ساري المفعول) ، تاريخ / وقت البدء (البداية) ، تاريخ / وقت انتهاء الصلاحية (انتهاء الصلاحية) ، اسم المرسل (اسم المرسل) ، العنوان (العنوان) ، وصف الحدث (الوصف) والتعليمات (التعليمات) وعنوان URL للمعلومات (الويب) ومعلومات الاتصال (جهة الاتصال) والمعلمة / المعلمات (المعلمة) **.

source: ![Alert Info](../_static/images/cap/alert_info.png "Alert Info")
am: ![የማንቂያ መረጃ](../_static/images/cap/alert_info.png "የማንቂያ መረጃ")
ar: ! [معلومات التنبيه] (../_ static / images / cap / alert_info.png "معلومات التنبيه")

source: AlertInfo
am: የማንቂያ መረጃ

source: C. Alert Area
am: ሐ. ማንቂያ አካባቢ
ar: منطقة التنبيه

source: This is an optional child section of the Alert Info Section i.e
am: ይህ የማንቂያ መረጃ ክፍል አማራጭ የሕፃን ክፍል ነው i.e
ar: هذا قسم اختياري تابع لقسم معلومات التنبيه ، أي

source: Multiple instances of this section are allowed. It contains the **Area Description (areaDesc), Area Polygon/Polygons (polygon), Area Circle/Circles (circle), Area Geocode/Geocodes (geocode), Altitude (altitude), Ceiling (ceiling)**.
am: የዚህ ክፍል በርካታ አጋጣሚዎች ተፈቅደዋል። በውስጡ **የአካባቢ መግለጫ (አካባቢ ዴስክ)፣ አካባቢ ፖሊጎን/ፖሊጎን (ፖሊጎን)፣ የአካባቢ ክበብ/ክበቦች (ክበብ)፣ አካባቢ ጂኦኮድ/ጂኦኮድ (ጂኦኮድ)፣ ከፍታ (ከፍታ)፣ ጣሪያ (ጣሪያ)** ይዟል።
ar: يُسمح بمثيلات متعددة من هذا القسم. يحتوي على ** وصف المنطقة (areaDesc) ، ومضلع المنطقة / المضلعات (المضلع) ، ودائرة المنطقة / الدوائر (الدائرة) ، والترميز الجغرافي للمنطقة / الرموز الجغرافية (الرمز الجغرافي) ، والارتفاع (الارتفاع) ، والسقف (السقف) **.

source: ![Alert Area](../_static/images/cap/alert_area_options.png "Alert Area section")
am: ![የማንቂያ ቦታ](../_static/images/cap/alert_area_options.png "የማንቂያ አካባቢ ክፍል")
ar: ! [منطقة التنبيه] (../_ static / images / cap / alert_area_options.png "قسم منطقة التنبيه")

source: Alert Area
am: ማንቂያ አካባቢ
ar: منطقة التنبيه

source: The Alert area input accepts 4 options:
am: የማንቂያ አካባቢ ግቤት 4 አማራጮችን ይቀበላል፡-
ar: يقبل إدخال منطقة التنبيه 4 خيارات:

source: Admin Boundary (area is picked from predefined boundaries). To use this option, ensure that admin boundaries are initially loaded. Refer to [Setting up boundaries](#setting-up-boundaries) section.
am: የአስተዳዳሪ ወሰን (ክልሉ አስቀድሞ ከተገለጹት ወሰኖች ይመረጣል)። ይህንን አማራጭ ለመጠቀም የአስተዳዳሪ ድንበሮች መጀመሪያ ላይ መጫኑን ያረጋግጡ። ወደ [ማዋቀር ድንበሮች](#setting-up-boundaries) ክፍልን ተመልከት።
ar: حدود الإدارة (المنطقة منتقاة من حدود محددة مسبقًا). لاستخدام هذا الخيار ، تأكد من تحميل حدود المسؤول في البداية. راجع قسم [إعداد الحدود] (# إعداد الحدود).

source: ![Alert Area boundary](../_static/images/cap/alert_area_boundary.png "Alert Area section")
am: ![የማንቂያ አካባቢ ወሰን](../_static/images/cap/alert_area_boundary.png "የማንቂያ አካባቢ ክፍል)"
ar: ! [حدود منطقة التنبيه] (../_ static / images / cap / alert_area_boundary.png "قسم منطقة التنبيه")

source: Alert Area boundary
am: የማንቂያ አካባቢ ወሰን
ar: حدود منطقة التنبيه

source: Polygon (drawing a polygon)
am: ፖሊጎን (ባለብዙ ጎን መሳል)
ar: مضلع (رسم مضلع)

source: ![Alert Area polygon](../_static/images/cap/alert_area_polygon.png "Alert Area section")
am: ![የማንቂያ አካባቢ ብዙ ጎን](../_static/images/cap/alert_area_polygon.png "የማንቂያ አካባቢ ክፍል"
ar: ! [مضلع منطقة التنبيه] (../_ static / images / cap / alert_area_polygon.png "قسم منطقة التنبيه")

source: Alert Area polygon
am: የማንቂያ አካባቢ ፖሊጎን
ar: مضلع منطقة التنبيه

source: Circle (drawing a circle which specifies the latitude, longitude and radius)
am: ክብ (ኬክሮስ፣ ኬንትሮስ እና ራዲየስ የሚገልጽ ክበብ በመሳል)
ar: دائرة (رسم دائرة تحدد خط الطول وخط الطول ونصف القطر)

source: ![Alert Area circle](../_static/images/cap/alert_area_circle.png "Alert Area section")
am: ![የማንቂያ አካባቢ ክበብ](../_static/images/cap/alert_area_circle.png "የማንቂያ አካባቢ ክፍል")
ar: ! [دائرة منطقة التنبيه] (../_ static / images / cap / alert_area_circle.png "قسم منطقة التنبيه")

source: Alert Area circle
am: የማንቂያ አካባቢ ክበብ
ar: دائرة منطقة التنبيه

source: Geocode (specifying area geocode name and value). Using this option presumes knowleged of the coding system
am: ጂኦኮድ (የአካባቢውን የጂኦኮድ ስም እና ዋጋ የሚገልጽ)። ይህንን አማራጭ መጠቀም የኮዲንግ ስርዓቱን እንደሚያውቅ ይገምታል
ar: تكويد جغرافي (تحديد اسم وقيمة التكويد الجغرافي للمنطقة). استخدام هذا الخيار يفترض المعرفة بنظام الترميز

source: ![Alert Area geocode](../_static/images/cap/alert_area_geocode.png "Alert Area section")
am: ![የማንቂያ አካባቢ ጂኦኮድ](../_static/images/cap/alert_area_geocode.png "የማንቂያ አካባቢ ክፍል")
ar: ! [الرمز الجغرافي لمنطقة التنبيه] (../_ static / images / cap / alert_area_geocode.png "قسم منطقة التنبيه")
