Repository: ACMAD-Niamey/climweb
Catalog: docs/locales/*/LC_MESSAGES/_docs.po
Languages: am, ar

source: Last, if you are accessing the page from the Explorer page of its parent, you can **hover over the page** and then click Edit.
am: በመጨረሻ፣ ገጹን ከወላጁ ኤክስፕሎረር ገጽ እየደረስክ ከሆነ **በገጹ ላይ ማንዣበብ** እና ከዚያ አርትዕን ጠቅ ማድረግ ትችላለህ።
ar: أخيرًا ، إذا كنت تقوم بالوصول إلى الصفحة من صفحة المستكشف التابعة لها ، فيمكنك ** التمرير فوق الصفحة ** ثم النقر فوق تحرير.

source: On the edit screen, you can find the title of the page you are editing at the top of the page. If the page is already published, then you can find a link to the live version of the page at the top right of the page. To change the title of the page, click the title field and enter a new title.
am: በአርትዖት ስክሪኑ ላይ አርትዖት የሚያደርጉትን የገጽ ርዕስ በገጹ አናት ላይ ማግኘት ይችላሉ። ገጹ አስቀድሞ ከታተመ፣ ከዚያ በገጹ ላይኛው ቀኝ ጥግ ላይ ያለውን የገጹን የቀጥታ ሥሪት አገናኝ ማግኘት ይችላሉ። የገጹን ርዕስ ለመቀየር የርዕስ መስኩን ጠቅ ያድርጉ እና አዲስ ርዕስ ያስገቡ።
ar: في شاشة التحرير ، يمكنك العثور على عنوان الصفحة التي تقوم بتحريرها في أعلى الصفحة. إذا تم نشر الصفحة بالفعل ، فيمكنك العثور على رابط للنسخة الحية للصفحة في أعلى يمين الصفحة. لتغيير عنوان الصفحة ، انقر فوق حقل العنوان وأدخل عنوانًا جديدًا.

source: ![Edit pages](../../_static/images/pages/edit_page.png "Edit pages")
am: ![ገጾችን አርትዕ](../../_static/images/pages/edit_page.png "ገጾችን አርትዕ")
ar: ! [تحرير الصفحات] (../../_ static / images / pages / edit_page.png "تحرير الصفحات")

source: Edit pages
am: ገጾችን ያርትዑ
ar: تحرير الصفحات

source: While on the edit screen, you can perform several actions, such as copying, moving, or deleting a page. To perform any of these actions, click … Actions at the top of the edit screen and select the applicable option from the dropdown.
am: በአርትዖት ስክሪኑ ላይ እንደ ገጽ መቅዳት፣ ማንቀሳቀስ ወይም መሰረዝ ያሉ በርካታ ድርጊቶችን ማከናወን ይችላሉ። ከእነዚህ ውስጥ ማንኛቸውም ድርጊቶችን ለመፈጸም በአርትዕ ስክሪኑ አናት ላይ… የሚለውን ጠቅ ያድርጉ እና ከተቆልቋዩ ውስጥ ተገቢውን አማራጭ ይምረጡ።
ar: أثناء وجودك على شاشة التحرير ، يمكنك تنفيذ العديد من الإجراءات ، مثل نسخ الصفحة أو نقلها أو حذفها. لتنفيذ أي من هذه الإجراءات ، انقر فوق ... إجراءات في الجزء العلوي من شاشة التعديل وحدد الخيار المناسب من القائمة المنسدلة.

source: Search Engine Optimization
am: የፍለጋ ፕሮግራም ማመቻቸት
ar: محرك البحث الامثل

source: To promote your page for search engine optimization, using the promote tab set the title tag and meta description. This will ecnourage web crawlers to correctly index your page and rank it higher in search results for related topics. Under the promote tab, the slug is created automatically from the page's initial title
am: ገጽዎን ለፍለጋ ሞተር ማበልጸጊያ ለማስተዋወቅ የማስተዋወቂያ ትሩን በመጠቀም የርዕስ መለያውን እና የሜታ መግለጫውን ያዘጋጁ። ይህ የድር ጎብኚዎች ገጽዎን በትክክል እንዲጠቁሙ እና ተዛማጅ ርዕሶችን በፍለጋ ውጤቶች ከፍ እንዲል ያበረታታል። በማስተዋወቂያው ትር ስር ስሉግ ከገጹ የመጀመሪያ ርዕስ በራስ-ሰር ይፈጠራል።
ar: للترويج لصفحتك من أجل تحسين محرك البحث ، باستخدام علامة تبويب الترويج ، قم بتعيين علامة العنوان والوصف التعريفي. سيؤدي ذلك إلى تشجيع برامج زحف الويب على فهرسة صفحتك بشكل صحيح وترتيبها أعلى في نتائج البحث للمواضيع ذات الصلة. ضمن علامة تبويب الترقية ، يتم إنشاء الرابط الثابت تلقائيًا من العنوان الأولي للصفحة

source: ![Search Engine Optimization](../../_static/images/pages/seo.png "Search Engine Optimization")
am: ![የፍለጋ ሞተር ማበልጸጊያ](../../_static/images/pages/seo.png "የፍለጋ ሞተር ማበልጸጊያ")
ar: ! [تحسين محرك البحث] (../../_ static / images / pages / seo.png "تحسين محرك البحث")

source: Create and edit comments
am: አስተያየቶችን ይፍጠሩ እና ያርትዑ
ar: إنشاء وتحرير التعليقات

source: To toggle on commenting mode, click Comments at the top of the edit screen page. Once commenting mode is on, you can create a new comment or reply to a comment by hovering over any commentable field to reveal the add comment icon.
am: በአስተያየት ሁነታ ላይ ለመቀያየር በማያ ገጹ ላይኛው ክፍል ላይ አስተያየቶችን ጠቅ ያድርጉ። አንዴ የአስተያየት ሁነታ ከበራ፣ የአስተያየት አክል አዶውን ለማሳየት በማንኛውም አስተያየት መስጫ ላይ በማንዣበብ አዲስ አስተያየት መፍጠር ወይም ለአስተያየት መልስ መስጠት ትችላለህ።
ar: للتبديل في وضع التعليق ، انقر فوق التعليقات في الجزء العلوي من صفحة شاشة التحرير. بمجرد تشغيل وضع التعليق ، يمكنك إنشاء تعليق جديد أو الرد على تعليق بالمرور فوق أي حقل قابل للتعليق للكشف عن أيقونة إضافة تعليق.

source: ![Add comment](../../_static/images/pages/add_comment.png "Add comment")
am: ![አስተያየት ጨምር](../../_static/images/pages/add_comment.png "አስተያየት ጨምር")
ar: ! [أضف تعليق] (../../_ static / images / pages / add_comment.png "أضف تعليقًا")

source: Add comment
am: አስተያየት ጨምር
ar: أضف تعليق

source: If there is no pre-existing comment in the field, click the add comment icon to create a new comment. However, if there is an existing comment, clicking either the field button or the comment brings the comment thread into focus. This allows you to add new replies.
am: በመስክ ላይ ምንም ቀድሞ የነበረ አስተያየት ከሌለ አዲስ አስተያየት ለመፍጠር የአክል አስተያየት አዶውን ጠቅ ያድርጉ። ነገር ግን፣ ነባር አስተያየት ካለ የመስክ ቁልፉን ወይም አስተያየቱን ጠቅ ማድረግ የአስተያየቱን ክር ወደ ትኩረት ያመጣል። ይህ አዲስ ምላሾችን እንዲያክሉ ያስችልዎታል።
ar: إذا لم يكن هناك تعليق موجود مسبقًا في الحقل ، فانقر فوق أيقونة إضافة تعليق لإنشاء تعليق جديد. ومع ذلك ، إذا كان هناك تعليق موجود ، فإن النقر فوق زر الحقل أو التعليق يؤدي إلى التركيز على سلسلة التعليق. هذا يسمح لك بإضافة ردود جديدة.

source: ![Add comment](../../_static/images/pages/save_comment.png "Add comment")
am: ![አስተያየት ጨምር](../../_static/images/pages/save_comment.png "አስተያየት ጨምር")
ar: ! [أضف تعليق] (../../_ static / images / pages / save_comment.png "أضف تعليقًا")

source: The arrow to the right of the comments icon shows the comment notifications panel, where you can enable or disable email notifications for other users' comments on the page.
am: ከአስተያየቶች አዶ በስተቀኝ ያለው ቀስት የአስተያየት ማሳወቂያዎች ፓነልን ያሳያል, በገጹ ላይ ለሌሎች ተጠቃሚዎች አስተያየት የኢሜል ማሳወቂያዎችን ማንቃት ወይም ማሰናከል ይችላሉ.
ar: يُظهر السهم الموجود على يمين أيقونة التعليقات لوحة إشعارات التعليقات ، حيث يمكنك تمكين أو تعطيل إشعارات البريد الإلكتروني لتعليقات المستخدمين الآخرين على الصفحة.

source: ![Reveal comment](../../_static/images/pages/reveal_comment.png "Reveal comment")
am: ![አስተያየት ይግለጡ](../../_static/images/pages/reveal_comment.png "አስተያየት ይግለጡ")
ar: ! [كشف التعليق] (../../_ ثابت / صور / صفحات / إظهار التعليق ")

source: Reveal comment
am: አስተያየትን አሳይ
ar: كشف التعليق

source: Note: You will always receive email notifications for threads you are part of, unless you opt out of all comment notifications in your account settings. All participants in a thread will receive email notifications for new replies, even if they no longer have permission to edit the page.
am: ማሳሰቢያ፡ በአካውንት ቅንጅቶች ውስጥ ካሉ ሁሉም የአስተያየት ማሳወቂያዎች መርጠው ካልወጡ በቀር እርስዎ አካል ለሆናችሁበት ተከታታዮች የኢሜይል ማሳወቂያዎች ሁልጊዜ ይደርሰዎታል። በፈትል ውስጥ ያሉ ሁሉም ተሳታፊዎች ለአዲስ ምላሾች የኢሜይል ማሳወቂያዎች ይደርሳቸዋል፣ ምንም እንኳን ከአሁን በኋላ ገጹን የማርትዕ ፍቃድ ባይኖራቸውም።
ar: ملاحظة: ستتلقى دائمًا إشعارات عبر البريد الإلكتروني بشأن سلاسل المحادثات التي أنت جزء منها ، ما لم تقم بإلغاء الاشتراك في جميع إشعارات التعليقات في إعدادات حسابك. سيتلقى جميع المشاركين في إحدى سلاسل الرسائل تنبيهات بالبريد الإلكتروني للردود الجديدة ، حتى إذا لم يعد لديهم إذن بتحرير الصفحة.

source: Manage Page History
am: የገጽ ታሪክን አስተዳድር
ar: إدارة محفوظات الصفحة

source: it is possible to retrieve a version of the content you previously saved as a draft or published. You can do this by hovering over a page on the Explorer page and clicking More from the resulting dropdown options. Alternatively, you can access the page history screen by clicking the History icon in the top-right corner when editing a page.
am: ከዚህ ቀደም እንደ ረቂቅ ያስቀመጡትን ወይም የታተሙትን የይዘት ስሪት ማውጣት ይቻላል። በ Explorer ገጽ ላይ አንድ ገጽ ላይ በማንዣበብ እና ከተገኙት ተቆልቋይ አማራጮች ተጨማሪን ጠቅ በማድረግ ይህንን ማድረግ ይችላሉ። በአማራጭ፣ ገጽን በሚያርትዑበት ጊዜ በላይኛው ቀኝ ጥግ ላይ ያለውን የታሪክ አዶ ጠቅ በማድረግ የገጽ ታሪክ ስክሪን ማግኘት ይችላሉ።
ar: من الممكن استرداد نسخة من المحتوى الذي قمت بحفظه مسبقًا كمسودة أو منشور. يمكنك القيام بذلك عن طريق التمرير فوق صفحة في صفحة Explorer والنقر فوق المزيد من خيارات القائمة المنسدلة الناتجة. بدلاً من ذلك ، يمكنك الوصول إلى شاشة محفوظات الصفحة عن طريق النقر فوق رمز "المحفوظات" في الزاوية العلوية اليمنى عند تحرير الصفحة.

source: ![Acess Page History](../../_static/images/pages/page_history.png "Access Page History")
am: ![መዳረሻ ገጽ ታሪክ](.../../_static/images/pages/page_history.png "የመዳረሻ ገጽ ታሪክ")
ar: ! [محفوظات صفحة الوصول] (../../_ static / images / pages / page_history.png "سجل الوصول إلى الصفحة")

source: Acess Page History
am: የመዳረሻ ገጽ ታሪክ
ar: تاريخ صفحة الوصول

source: On the page's history screen, you can see all the actions previously done on that particular page and the users that carried out the actions. Also, you can see the date or time that the action occurred.
am: በገጹ የታሪክ ስክሪን ላይ ከዚህ ቀደም የተከናወኑ ድርጊቶችን በሙሉ እና ድርጊቱን የፈጸሙ ተጠቃሚዎችን ማየት ይችላሉ። እንዲሁም ድርጊቱ የተፈፀመበትን ቀን ወይም ሰዓት ማየት ይችላሉ።
ar: في شاشة محفوظات الصفحة ، يمكنك رؤية جميع الإجراءات التي تم القيام بها مسبقًا على تلك الصفحة المعينة والمستخدمين الذين نفذوا هذه الإجراءات. يمكنك أيضًا مشاهدة التاريخ أو الوقت الذي حدث فيه الإجراء.

source: You can also search for specific versions of your content on the page history screen by applying a filter.
am: ማጣሪያን በመተግበር በገጽ ታሪክ ማያ ገጽ ላይ የተወሰኑ የይዘትዎን ስሪቶች መፈለግ ይችላሉ።
ar: يمكنك أيضًا البحث عن إصدارات معينة من المحتوى الخاص بك في شاشة محفوظات الصفحة من خلال تطبيق عامل تصفية.

source: ![View History](../../_static/images/pages/view_page_history.png "View Page History")
am: ![ታሪክን ይመልከቱ](.../../_static/images/pages/view_page_history.png "የገጽ ታሪክን ይመልከቱ")
ar: ! [عرض المحفوظات] (../../_ static / images / pages / view_page_history.png "عرض محفوظات الصفحة")

source: View History
am: ታሪክ ይመልከቱ
ar: عرض السجل

source: If you want to compare different draft versions, hover over the draft and click Compare with previous version or Compare with current version.
am: የተለያዩ ረቂቅ ስሪቶችን ማወዳደር ከፈለጉ በረቂቁ ላይ ያንዣብቡ እና ከቀዳሚው ስሪት ጋር አወዳድር የሚለውን ጠቅ ያድርጉ ወይም ከአሁኑ ስሪት ጋር ያወዳድሩ።
ar: إذا كنت تريد مقارنة إصدارات مسودة مختلفة ، فمرر الماوس فوق المسودة وانقر على مقارنة بالإصدار السابق أو مقارنة بالإصدار الحالي.

source: To replace the current version of the draft with a previous version, hover over the preferred version of your draft on the page history screen and click Review this version. Then click Replace current version located at the bottom of the screen. This action appears as a Revert action on the page history screen and you can always go back to review it.
am: የአሁኑን የረቂቅ ስሪት በቀድሞው ስሪት ለመተካት በገጽ ታሪክ ስክሪን ላይ ባለው ተመራጭ የረቂቅዎ ስሪት ላይ አንዣብቡ እና ይህን ስሪት ይገምግሙ የሚለውን ጠቅ ያድርጉ። ከዚያ በማያ ገጹ ግርጌ ላይ የሚገኘውን የአሁኑን እትም ተካ የሚለውን ጠቅ ያድርጉ። ይህ እርምጃ በገጹ ታሪክ ማያ ገጽ ላይ እንደ የተመለስ እርምጃ ሆኖ ይታያል እና እሱን ለመገምገም ሁልጊዜም ተመልሰው መሄድ ይችላሉ።
ar: لاستبدال الإصدار الحالي من المسودة بإصدار سابق ، مرر مؤشر الماوس فوق الإصدار المفضل من المسودة على شاشة محفوظات الصفحة وانقر فوق مراجعة هذا الإصدار. ثم انقر فوق استبدال الإصدار الحالي الموجود أسفل الشاشة. يظهر هذا الإجراء كإجراء التراجع في شاشة محفوظات الصفحة ويمكنك دائمًا الرجوع لمراجعته.

source: ![Review Page Version](../../_static/images/pages/review_page_version.png "Review Page Version")
am: ![የገጽ ሥሪትን ይገምግሙ](../../_static/images/pages/review_page_version.png "የገጽ ሥሪትን መገምገም")
ar: ! [مراجعة إصدار الصفحة] (../../_ static / images / pages / review_page_version.png "مراجعة إصدار الصفحة")

source: Review Page Version
am: የገጽ ሥሪትን ይገምግሙ
ar: مراجعة نسخة الصفحة

source: Workflow
am: የስራ ፍሰት
ar: سير العمل

source: If the page is currently in a workflow, then you can see an additional indicator underneath the title showing the current workflow task. Clicking this shows more information about the page's progress through the workflow and any comments left by reviewers.
am: ገጹ በአሁኑ ጊዜ በስራ ሂደት ውስጥ ከሆነ፣ አሁን ያለውን የስራ ፍሰት ተግባር የሚያሳይ ተጨማሪ አመልካች ከርዕሱ ስር ማየት ይችላሉ። ይህንን ጠቅ ማድረግ የገጹን የስራ ሂደት ሂደት እና በገምጋሚዎች የተሰጡ አስተያየቶችን በተመለከተ ተጨማሪ መረጃ ያሳያል።
ar: إذا كانت الصفحة موجودة حاليًا في سير عمل ، فيمكنك رؤية مؤشر إضافي أسفل العنوان يعرض مهمة سير العمل الحالية. يؤدي النقر فوق هذا إلى إظهار مزيد من المعلومات حول تقدم الصفحة خلال سير العمل وأي تعليقات تركها المراجعون.

source: If you have permission to perform moderation actions, for example, approval or requesting changes on the current task. In that case, you can see additional options in the action bar at the bottom of the page
am: የማስተካከያ እርምጃዎችን ለማከናወን ፈቃድ ካሎት፣ ለምሳሌ ማጽደቅ ወይም አሁን ባለው ተግባር ላይ ለውጦችን መጠየቅ። እንደዚያ ከሆነ በገጹ ግርጌ ላይ ባለው የድርጊት አሞሌ ውስጥ ተጨማሪ አማራጮችን ማየት ይችላሉ።
ar: إذا كان لديك إذن لتنفيذ إجراءات الإشراف ، على سبيل المثال ، الموافقة أو طلب التغييرات على المهمة الحالية. في هذه الحالة ، يمكنك رؤية خيارات إضافية في شريط الإجراءات أسفل الصفحة

source: Copy pages
am: ገጾችን ይቅዱ
ar: نسخ الصفحات

source: Sometimes, you don't need to create a new page from scratch. For example, you may have several pages that are similar in terms of structure but differ in content. In that case, you can copy an existing page and only change the required parts.
am: አንዳንድ ጊዜ ከባዶ አዲስ ገጽ መፍጠር አያስፈልግዎትም። ለምሳሌ፣ በመዋቅር ረገድ ተመሳሳይ የሆኑ ነገር ግን በይዘት የሚለያዩ በርካታ ገፆች ሊኖሩህ ይችላሉ። እንደዚያ ከሆነ, አሁን ያለውን ገጽ መቅዳት እና አስፈላጊዎቹን ክፍሎች ብቻ መቀየር ይችላሉ.
ar: في بعض الأحيان ، لا تحتاج إلى إنشاء صفحة جديدة من البداية. على سبيل المثال ، قد يكون لديك عدة صفحات متشابهة من حيث البنية ولكنها تختلف في المحتوى. في هذه الحالة ، يمكنك نسخ صفحة موجودة وتغيير الأجزاء المطلوبة فقط.

source: ![Copy Page](../../_static/images/pages/copy_page.png "Copy Page")
am: ![ገጽ ቅዳ](.../../_static/images/pages/copy_page.png "ገጽ ቅዳ)"
ar: ! [نسخ الصفحة] (../../_ static / images / pages / copy_page.png "نسخ الصفحة")

source: Copy Page
am: ገጽ ቅዳ
ar: انسخ الصفحة

source: To copy an existing page, hover over a page in an Explorer page, then click More and select Copy. Selecting Copy from the dropdown takes you to a form where you can enter the title and slug of the copy and also choose its parent page. You then get the option to publish the copy right away and an option to mark the copy as an alias of the original page. Once you have completed the form, click Copy this page.
am: ያለውን ገጽ ለመቅዳት በአሳሽ ገጽ ላይ በአንድ ገጽ ላይ ያንዣብቡ እና ከዚያ ተጨማሪን ጠቅ ያድርጉ እና ቅዳ የሚለውን ይምረጡ። ከተቆልቋዩ ውስጥ ቅጂን መምረጥ የቅጂውን ርዕስ እና ስሉግ ወደሚያስገቡበት እና እንዲሁም የወላጅ ገጹን መምረጥ ወደሚችሉበት ቅጽ ይወስደዎታል። ከዚያ ቅጂውን ወዲያውኑ የማተም አማራጭ እና ቅጂውን እንደ ዋናው ገጽ ተለዋጭ ስም ምልክት የማድረግ አማራጭ ያገኛሉ። ቅጹን ከጨረሱ በኋላ ይህን ገጽ ቅዳ የሚለውን ይንኩ።
ar: لنسخ صفحة حالية ، مرر مؤشر الماوس فوق صفحة في صفحة Explorer ، ثم انقر على المزيد وحدد نسخ. يؤدي تحديد "نسخ" من القائمة المنسدلة إلى نقلك إلى نموذج يمكنك من خلاله إدخال العنوان والارتباط التقريبي للنسخة واختيار صفحتها الأصلية أيضًا. ستحصل بعد ذلك على خيار نشر النسخة على الفور وخيارًا لتمييز النسخة كاسم مستعار للصفحة الأصلية. بمجرد الانتهاء من النموذج ، انقر فوق نسخ هذه الصفحة.

source: ![Copy Page](../../_static/images/pages/copy_page_2.png "Copy Page")
am: ![ገጽ ቅዳ](../../_static/images/pages/copy_page_2.png "ገጽ ቅዳ")
ar: ! [نسخ الصفحة] (../../_ static / images / pages / copy_page_2.png "نسخ الصفحة")

source: Congratulations, you just copied a page. You can now find your copied page on the Explorer page.
am: እንኳን ደስ ያለህ፣ ልክ አንድ ገጽ ቀድተሃል። አሁን የተቀዳውን ገጽ በ Explorer ገጽ ላይ ማግኘት ይችላሉ።
ar: تهانينا ، لقد نسخت للتو صفحة. يمكنك الآن العثور على صفحتك المنسوخة في صفحة Explorer.

source: Alias pages
am: ተለዋጭ ገጾች
ar: صفحات الاسم المستعار

source: When copying a page, you have the option to mark it as an alias. The content of an aliased page always stays in sync with the original.
am: አንድን ገጽ ሲገለብጡ እንደ ተለዋጭ ስም ምልክት የማድረግ አማራጭ አለዎት። የተለጠፈ ገጽ ይዘት ሁልጊዜ ከመጀመሪያው ጋር እንደተስማማ ይቆያል።
ar: عند نسخ صفحة ، لديك الخيار لتمييزها كاسم مستعار. يظل محتوى الصفحة ذات الاسم المستعار دائمًا متزامنًا مع الأصل.

source: This is useful when you want a page to be available in multiple places. For example, if you have a page about Publications as a child page of Home, and you want to make the Publications page available in the Pastries section.
am: አንድ ገጽ በበርካታ ቦታዎች እንዲገኝ ሲፈልጉ ይህ ጠቃሚ ነው። ለምሳሌ፣ ስለ ህትመቶች እንደ የቤት ልጅ ገፅ ካሎት፣ እና የሕትመቶችን ገጽ በፓስተር ክፍል ውስጥ እንዲገኝ ማድረግ ከፈለጉ።
ar: هذا مفيد عندما تريد أن تكون الصفحة متاحة في أماكن متعددة. على سبيل المثال ، إذا كانت لديك صفحة حول المنشورات كصفحة فرعية للصفحة الرئيسية ، وتريد إتاحة صفحة المنشورات في قسم المعجنات.

source: Creating an alias for an existing page is similar to creating a copy. Hover over a page in the Explorer page, click More, and then select Copy. Selecting Copy takes you to the copy page form. On the copy page form, choose another page as the parent page by clicking Choose another page.
am: ለነባር ገጽ ተለዋጭ ስም መፍጠር ቅጂ ከመፍጠር ጋር ተመሳሳይ ነው። በ Explorer ገጽ ላይ በአንድ ገጽ ላይ አንዣብብ፣ ተጨማሪን ጠቅ ያድርጉ እና ከዚያ ቅዳ የሚለውን ይምረጡ። ቅጂን መምረጥ ወደ የቅጂ ገጽ ቅጽ ይወስደዎታል። በቅጂ ገጹ ላይ፣ ሌላ ገጽ ምረጥ የሚለውን ጠቅ በማድረግ ሌላ ገጽ እንደ የወላጅ ገጽ ይምረጡ።
ar: يشبه إنشاء اسم مستعار لصفحة موجودة إنشاء نسخة. قم بالتمرير فوق صفحة في صفحة Explorer ، وانقر فوق المزيد ، ثم حدد نسخ. يؤدي تحديد "نسخ" إلى الانتقال إلى نموذج صفحة النسخ. في نموذج نسخ الصفحة ، اختر صفحة أخرى كصفحة رئيسية بالنقر فوق اختيار صفحة أخرى.

source: Then, click the Alias checkbox and click Copy this page to complete the aliasing.
am: ከዚያ፣ የAlias ​​አመልካች ሳጥኑን ጠቅ ያድርጉ እና ይህን ገጽ ቅዳ የሚለውን ተጫን።
ar: ثم ، انقر فوق خانة الاختيار Alias ​​(الاسم المستعار) وانقر فوق Copy هذه الصفحة لإكمال الاسم المستعار.

source: Alias Page
am: ተለዋጭ ገጽ
ar: صفحة الاسم المستعار

source: Congratulations, you just aliased a page. You can now find your aliased page on the Explorer page of the parent page.
am: እንኳን ደስ አለህ፣ አንድ ገጽ ስም አጥፍተሃል። አሁን በወላጅ ገጽ ኤክስፕሎረር ገጽ ላይ የእርስዎን ስም ያለው ገጽ ማግኘት ይችላሉ።
ar: تهانينا ، لقد أضفت اسمًا مستعارًا على الصفحة. يمكنك الآن العثور على صفحتك ذات الاسم المستعار على صفحة المستكشف للصفحة الرئيسية.

source: If you try to edit the aliased page, you get a notification that it's an alias of another page. To edit an aliased page, you have two options:
am: ስም የተለጠፈውን ገጽ ለማርትዕ ከሞከሩ የሌላ ገጽ ተለዋጭ ስም መሆኑን ማሳወቂያ ይደርስዎታል። ስም የለሽ ገጽ ለማርትዕ ሁለት አማራጮች አሉዎት፡-
ar: إذا حاولت تحرير الصفحة ذات الاسم المستعار ، فستتلقى إشعارًا بأنها اسم مستعار لصفحة أخرى. لتحرير صفحة ذات اسم مستعار ، لديك خياران:

source: Edit the original page. This option changes both the original page and the aliased page.
am: ዋናውን ገጽ ያርትዑ። ይህ አማራጭ ሁለቱንም የመጀመሪያውን ገጽ እና ስም የተለጠፈ ገጽን ይለውጣል።
ar: قم بتحرير الصفحة الأصلية. يغير هذا الخيار كلاً من الصفحة الأصلية والصفحة ذات الاسم المستعار.

source: Convert the alias page to an ordinary page, which is a copy of the original. If you choose this option, you must make manual changes to the alias page in order for it to be in sync with the original page.
am: ተለዋጭ ስም ገጹን ወደ ተራ ገጽ ይለውጡ፣ እሱም የዋናው ቅጂ ነው። ይህን አማራጭ ከመረጡ፣ ከመጀመሪያው ገጽ ጋር እንዲመሳሰል በተለዋጭ ስም ገጽ ላይ በእጅ ለውጦች ማድረግ አለብዎት።
ar: قم بتحويل صفحة الاسم المستعار إلى صفحة عادية ، وهي نسخة من الأصل. إذا حددت هذا الخيار ، فيجب إجراء تغييرات يدوية على صفحة الاسم المستعار حتى تتم مزامنتها مع الصفحة الأصلية.

source: About Page
am: ስለ ገጽ
ar: حول الصفحة

source: Create an About Page
am: ስለ ገጽ ይፍጠሩ
ar: قم بإنشاء "صفحة حول"

source: The creation of this page assumes you have already created an organisation index page which is the parent page of this page. To create an organisation index page, please refer to [Managing Organisation Page](./Manage-Organisation).
am: የዚህ ገጽ መፈጠር እርስዎ የዚህ ገጽ ወላጅ ገጽ የሆነ የድርጅት መረጃ ጠቋሚ ገጽ እንደፈጠሩ ይገመታል። የድርጅት መረጃ ጠቋሚ ገጽ ለመፍጠር፣ እባክዎን [የድርጅት ገፅን ማስተዳደር](./አስተዳደር-ድርጅት) ይመልከቱ።
ar: يفترض إنشاء هذه الصفحة أنك قمت بالفعل بإنشاء صفحة فهرس مؤسسة وهي الصفحة الرئيسية لهذه الصفحة. لإنشاء صفحة فهرس مؤسسة ، يرجى الرجوع إلى [إدارة صفحة المؤسسة] (./ إدارة المنظمة).

source: To create an about page, navigate to organisation page and create a child page from it selecting the about page.
am: ስለ ገጽ ለመፍጠር ወደ ድርጅት ገጽ ይሂዱ እና ስለ ገጹ በመምረጥ የልጅ ገጽ ይፍጠሩ።
ar: لإنشاء صفحة حول ، انتقل إلى صفحة المؤسسة وأنشئ صفحة فرعية منها باختيار صفحة حول.

source: ![About page](../../../_static/images/about/add_about_page.png "About page")
am: ![ስለ ገጽ](..././../_static/images/about/add_about_page.png "ስለ ገጽ")
ar: ! [حول الصفحة] (../../../_ static / images / about / add_about_page.png "صفحة حول")

source: About page
am: ስለ ገጽ
ar: حول الصفحة

source: ![About page](../../../_static/images/about/select_about_page.png "About page")
am: ![ስለ ገጽ](..././../_static/images/about/select_about_page.png "ስለ ገጽ")
ar: ! [حول الصفحة] (../../../_ static / images / about / select_about_page.png "صفحة حول")

source: The About page is divided into various sections.
am: ስለ ገጽ በተለያዩ ክፍሎች የተከፈለ ነው።
ar: تنقسم صفحة "حول" إلى أقسام مختلفة.

source: ![About page](../../../_static/images/about/about_sections.png "About page")
am: ![ስለ ገጽ](..././../_static/images/about/about_sections.png "ስለ ገጽ")
ar: ! [صفحة حول] (../../../_ static / images / about / about_sections.png "صفحة حول")

source: The sections include:
am: ክፍሎቹ የሚከተሉትን ያካትታሉ:
ar: تشمل الأقسام:

source: **Banner Section** - this contains the banner image, title, subtitle and call to action button. If no banner image is provided then this section will not be displayed
am: ** ሰንደቅ ክፍል *** - ይህ የሰንደቅ ምስል ፣ ርዕስ ፣ ንዑስ ርዕስ እና ወደ ተግባር ጥሪ ቁልፍ ይይዛል ። ምንም ባነር ምስል ካልቀረበ ይህ ክፍል አይታይም
ar: ** قسم البانر ** - يحتوي على صورة البانر والعنوان والعنوان الفرعي وزر الحث على اتخاذ إجراء. إذا لم يتم توفير صورة لافتة ، فلن يتم عرض هذا القسم

source: ![Banner Sections](../../../_static/images/about/banner_section.png "Banner Sections")
am: ![ሰንደቅ ክፍሎች](../../../_static/images/about/banner_section.png "ሰንደቅ ክፍሎች")
ar: ! [أقسام البانر] (../../../_ static / images / about / banner_section.png "أقسام البانر")

source: ![Introduction Sections](../../../_static/images/about/introduction_section.png "Introduction Sections")
am: ![የመግቢያ ክፍሎች](../../../_static/images/about/introduction_section.png "የመግቢያ ክፍሎች")
ar: ! [أقسام المقدمة] (../../../_ static / images / about / Introduction_section.png "أقسام المقدمة")

source: **Mission and Vision Section** - this is the organisation's mission and vision
am: ** ተልዕኮ እና ራዕይ ክፍል *** - ይህ የድርጅቱ ተልዕኮ እና ራዕይ ነው።
ar: ** قسم الرؤية والرسالة ** - هذه هي رسالة المنظمة ورؤيتها

source: ![Mission & Vision Sections](../../../_static/images/about/mission_vision_section.png "Mission & Vision Sections")
am: ![ሚሽን እና ራዕይ ክፍሎች](.../../../_static/images/about/mission_vision_section.png "ተልእኮ እና ራዕይ ክፍሎች")
ar: ! [أقسام المهمة والرؤية] (../../../_ static / images / about / mission_vision_section.png "أقسام المهمة والرؤية")

source: Mission & Vision Sections
am: ተልዕኮ እና ራዕይ ክፍሎች
ar: أقسام الرؤية والرسالة

source: **Organisation Structure Section** - this contains a heading description and image of the organisational structure.
am: **የድርጅት መዋቅር ክፍል** - ይህ የድርጅት መዋቅር ርዕስ መግለጫ እና ምስል ይዟል።
ar: ** قسم الهيكل التنظيمي ** - يحتوي على وصف للعنوان وصورة للهيكل التنظيمي.

source: ![Organisation Structure Sections](../../../_static/images/about/organisation_structure_section.png "Organisation Structure Sections")
am: ![የድርጅት መዋቅር ክፍሎች](.././../_static/images/about/ድርጅት_structure_section.png "የድርጅት መዋቅር ክፍሎች")
ar: ! [أقسام الهيكل التنظيمي] (../../../_ static / images / about / organisation_structure_section.png "أقسام الهيكل التنظيمي")

source: Organisation Structure Sections
am: የድርጅት መዋቅር ክፍሎች
ar: أقسام الهيكل التنظيمي

source: **Historical Timeline Section** - the historical timeline section allows for narration of the history of the organisation grouping the milestones on an yearly basis.
am: **ታሪካዊ የጊዜ መስመር ክፍል** - የታሪካዊው የጊዜ መስመር ክፍል የድርጅቱን ታሪካዊ ክንውኖች በየአመቱ በቡድን ለመተረክ ያስችላል።
ar: ** قسم الجدول الزمني التاريخي ** - يسمح قسم المخطط الزمني التاريخي بسرد تاريخ المؤسسة الذي يجمع المعالم على أساس سنوي.

source: ![Historical Timeline Sections](../../../_static/images/about/history_timeline_section.png "Historical Timeline Sections")
am: ![ታሪካዊ የጊዜ መስመር ክፍሎች](.../../../_static/images/about/history_timeline_section.png "ታሪካዊ የጊዜ መስመር ክፍሎች")
ar: ! [أقسام المخطط الزمني التاريخية] (../../../_ static / images / about / history_timeline_section.png "أقسام المخطط الزمني التاريخية")

source: Historical Timeline Sections
am: ታሪካዊ የጊዜ መስመር ክፍሎች
ar: أقسام الجدول الزمني التاريخي

source: **Additional Materials** - any additional material including documents or images relating to the organisation can be added here for download.
am: **ተጨማሪ እቃዎች** - ከድርጅቱ ጋር የተያያዙ ሰነዶችን ወይም ምስሎችን ጨምሮ ማንኛውም ተጨማሪ ነገር ለማውረድ እዚህ ሊታከል ይችላል።
ar: ** مواد إضافية ** - يمكن إضافة أي مواد إضافية بما في ذلك المستندات أو الصور المتعلقة بالمنظمة هنا للتنزيل.
